[Killed] Array initializer mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:11:26
     public static int[] DuplicateZeros(int[] arr)
     {
         var listArray = new List<int>();
-        var doubleZero = new int[] {0, 0};
+        var doubleZero = new int[] {};
 
         for (int i = 0; listArray.Count < arr.Length; i++)
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZeros_WhenInputArrayHasZeros; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.DoubleZeroArrayTests.DuplicateZeros_ZerosAtEnd_DuplicatesCorrectly; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZerosCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:13:55
         var listArray = new List<int>();
         var doubleZero = new int[] {0, 0};
 
-        for (int i = 0; listArray.Count < arr.Length; i++)
+        for (int i = 0; listArray.Count < arr.Length; i--)
         {
             if (arr[i] != 0)
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnOriginalArray_WhenInputArrayHasNoZeros; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZeros_WhenInputArrayHasZeros

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:13:25
         var listArray = new List<int>();
         var doubleZero = new int[] {0, 0};
 
-        for (int i = 0; listArray.Count < arr.Length; i++)
+        for (int i = 0; listArray.Count <= arr.Length; i++)
         {
             if (arr[i] != 0)
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnOriginalArray_WhenInputArrayHasNoZeros; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnEmptyArray_WhenInputArrayIsEmpty; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZeros_WhenInputArrayHasZeros

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:15:17
 
         for (int i = 0; listArray.Count < arr.Length; i++)
         {
-            if (arr[i] != 0)
+            if (arr[i] == 0)
             {
                 listArray.Add(arr[i]);
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnOriginalArray_WhenInputArrayHasNoZeros; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZeros_WhenInputArrayHasZeros; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZerosCorrectly

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:17:17
         {
             if (arr[i] != 0)
             {
-                listArray.Add(arr[i]);
+                ;
             }
             else
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnOriginalArray_WhenInputArrayHasNoZeros; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZeros_WhenInputArrayHasZeros; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZerosCorrectly

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:21:17
             }
             else
             {
-                listArray.AddRange(doubleZero);
+                ;
             }
         }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZeros_WhenInputArrayHasZeros; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.DoubleZeroArrayTests.DuplicateZeros_ZerosAtEnd_DuplicatesCorrectly; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZerosCorrectly
