[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/Evaluations.cs:11:13
     {
         try{
             System.Data.DataTable table = new System.Data.DataTable(); // Initializes the table,
-            table.Columns.Add("expression", string.Empty.GetType(), expression); // Adds the string to table "Expressions"
+            ; // Adds the string to table "Expressions"
             System.Data.DataRow row = table.NewRow(); // Gets the math symbols information
             table.Rows.Add(row);
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.EvaluationsTests.Evaluate_ShouldReturnCorrectResult_ForValidExpression; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.EvaluationsTests.Evaluate_ShouldEvaluateCorrectly; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.EvaluationsTests.Evaluate_ShouldEvaluateCorrectly

[Survived] String mutation
Code/bakis/UnitTestGeneration.Easy.App/Evaluations.cs:11:45
     {
         try{
             System.Data.DataTable table = new System.Data.DataTable(); // Initializes the table,
-            table.Columns.Add("expression", string.Empty.GetType(), expression); // Adds the string to table "Expressions"
+            table.Columns.Add("expression", "Stryker was here!".GetType(), expression); // Adds the string to table "Expressions"
             System.Data.DataRow row = table.NewRow(); // Gets the math symbols information
             table.Rows.Add(row);

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/Evaluations.cs:13:13
             System.Data.DataTable table = new System.Data.DataTable(); // Initializes the table,
             table.Columns.Add("expression", string.Empty.GetType(), expression); // Adds the string to table "Expressions"
             System.Data.DataRow row = table.NewRow(); // Gets the math symbols information
-            table.Rows.Add(row);
+            ;
             return decimal.Parse((string)row["expression"]); // executes the operations in the tables.
         }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.EvaluationsTests.Evaluate_ShouldReturnCorrectResult_ForValidExpression; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.EvaluationsTests.Evaluate_MultiplicationAndDivision_ReturnsCorrectResult; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.EvaluationsTests.Evaluate_SimpleSubtraction_ReturnsCorrectResult

[Survived] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/Evaluations.cs:17:9
             return decimal.Parse((string)row["expression"]); // executes the operations in the tables.
         }
         catch (FormatException)
-        {
-            return decimal.Zero;
-        }  
+        {}  
 
     }
