[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:13:42
     {
         var maxLentgh = new List<int>();
         var maxNumber = 0;
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i < nums.Length; i--)
         {
             if (nums[i] == 1)
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleNoOnesAtEnd; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleSingleOne; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:13:25
     {
         var maxLentgh = new List<int>();
         var maxNumber = 0;
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i <= nums.Length; i++)
         {
             if (nums[i] == 1)
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleNoOnesAtEnd; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleSingleOne; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:15:17
         var maxNumber = 0;
         for (int i = 0; i < nums.Length; i++)
         {
-            if (nums[i] == 1)
+            if (nums[i] != 1)
             {
                 maxNumber += 1;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleNoOnesAtEnd; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleSingleOne; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:17:17
         {
             if (nums[i] == 1)
             {
-                maxNumber += 1;
+                maxNumber -= 1;
             }
             else
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleNoOnesAtEnd; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleSingleOne; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:21:17
             }
             else
             {
-                maxLentgh.Add(maxNumber);
+                ;
                 maxNumber = 0;
             }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleNoOnesAtEnd; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ConsecutiveAtBeginning_ReturnsCorrectMax

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:24:22
                 maxLentgh.Add(maxNumber);
                 maxNumber = 0;
             }
-            if (i == nums.Length - 1)
+            if (i == nums.Length + 1)
             {
                 maxLentgh.Add(maxNumber);
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleSingleOne; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:24:17
                 maxLentgh.Add(maxNumber);
                 maxNumber = 0;
             }
-            if (i == nums.Length - 1)
+            if (i != nums.Length - 1)
             {
                 maxLentgh.Add(maxNumber);
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleSingleOne; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes

[Killed] Linq method mutation (Max() to Min())
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:29:16
                 maxLentgh.Add(maxNumber);
             }
         }
-        return maxLentgh.Max();
+        return maxLentgh.Min();
     }
     #endregion
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleNoOnesAtEnd; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectMaxConsecutiveOnes
