[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/FindNumberWithEvenDigitsNum.cs:11:87
     #region 7º Find Numbers with Even Number of Digits
     public static int FindNumbers(int[] nums)
     {
-        return nums.Select(num => num.ToString().ToCharArray()).Count(numCharArray => numCharArray.Length % 2 == 0);
+        return nums.Select(num => num.ToString().ToCharArray()).Count(numCharArray => numCharArray.Length * 2 == 0);
     }
     #endregion
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindNumberWithEvenDigitsNumTests.FindNumbers_ShouldReturnCorrectCount; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.FindNumberWithEvenDigitsNumTests.FindNumbers_ShouldReturnCorrectCount; UnitTestGeneration.Easy.Tests.Cloude.Prompt3.FindNumberWithEvenDigitsNumTests.FindNumbers_ArrayWithAllEvenDigitNumbers_ReturnsArrayLength

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/FindNumberWithEvenDigitsNum.cs:11:87
     #region 7º Find Numbers with Even Number of Digits
     public static int FindNumbers(int[] nums)
     {
-        return nums.Select(num => num.ToString().ToCharArray()).Count(numCharArray => numCharArray.Length % 2 == 0);
+        return nums.Select(num => num.ToString().ToCharArray()).Count(numCharArray => numCharArray.Length % 2 != 0);
     }
     #endregion
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindNumberWithEvenDigitsNumTests.FindNumbers_ShouldHandleSingleDigitNumbers; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.FindNumberWithEvenDigitsNumTests.FindNumbers_AllEvenDigitCounts_ReturnsCorrectCount; UnitTestGeneration.Easy.Tests.Cloude.Prompt3.FindNumberWithEvenDigitsNumTests.FindNumbers_ArrayWithAllEvenDigitNumbers_ReturnsArrayLength
