[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/GeometricShapes.cs:11:65
     {
         public static Tuple<double, double> Area(float length = 12, float breadth = 22)
         {
-            return new Tuple<double, double>( length * breadth, 2 * (length + breadth));
+            return new Tuple<double, double>( length * breadth, 2 / (length + breadth));
         }
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.RectangleShape_Area_ShouldReturnCorrectResult_CustomValues; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.RectangleShape_Area_ShouldReturnCorrectResult_DefaultValues; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.GeometricShapesTests.RectangleArea_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/GeometricShapes.cs:11:70
     {
         public static Tuple<double, double> Area(float length = 12, float breadth = 22)
         {
-            return new Tuple<double, double>( length * breadth, 2 * (length + breadth));
+            return new Tuple<double, double>( length * breadth, 2 * (length - breadth));
         }
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.RectangleShape_Area_ShouldReturnCorrectResult_CustomValues; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.RectangleShape_Area_ShouldReturnCorrectResult_DefaultValues; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.GeometricShapesTests.RectangleArea_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/GeometricShapes.cs:20:47
         
         public static  Tuple<double, double> Area(float _base = 5, float height = 13, float side1 = 12, float side2 = 10)
         {
-            return new Tuple<double, double>( _base * height / 2, _base + side1 + side2);
+            return new Tuple<double, double>( _base / height / 2, _base + side1 + side2);
         }
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.TriangleShape_Area_ShouldReturnCorrectResult_CustomValues; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.GeometricShapesTests.TriangleArea_ShouldCalculateCorrectly; UnitTestGeneration.Easy.Tests.Cloude.Prompt3.GeometricShapesTests.TriangleArea_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/GeometricShapes.cs:20:67
         
         public static  Tuple<double, double> Area(float _base = 5, float height = 13, float side1 = 12, float side2 = 10)
         {
-            return new Tuple<double, double>( _base * height / 2, _base + side1 + side2);
+            return new Tuple<double, double>( _base * height / 2, _base - side1 + side2);
         }
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.TriangleShape_Area_ShouldReturnCorrectResult_CustomValues; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.GeometricShapesTests.TriangleArea_ShouldCalculateCorrectly; UnitTestGeneration.Easy.Tests.Cloude.Prompt3.GeometricShapesTests.TriangleArea_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/GeometricShapes.cs:28:59
     {
         public static Tuple<double, double> Area(float side = 12)
         {
-            return new Tuple<double, double>(side * side, 4 * side);
+            return new Tuple<double, double>(side * side, 4 / side);
         }
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.SquareShape_Area_ShouldReturnCorrectResult_DefaultValue; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.SquareShape_Area_ShouldReturnCorrectResult_CustomValue; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.GeometricShapesTests.SquareArea_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/GeometricShapes.cs:28:46
     {
         public static Tuple<double, double> Area(float side = 12)
         {
-            return new Tuple<double, double>(side * side, 4 * side);
+            return new Tuple<double, double>(side / side, 4 * side);
         }
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.SquareShape_Area_ShouldReturnCorrectResult_DefaultValue; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.SquareShape_Area_ShouldReturnCorrectResult_CustomValue; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.GeometricShapesTests.SquareArea_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/GeometricShapes.cs:36:46
     {
         public static Tuple<double, double> Area(float radius = 20)
         {
-            return new Tuple<double, double>(3.14 * radius * radius, 4 * 3.14 * radius);
+            return new Tuple<double, double>(3.14 / radius * radius, 4 * 3.14 * radius);
         }
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.CircleShape_Area_ShouldReturnCorrectResult_DefaultValue; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.CircleShape_Area_ShouldReturnCorrectResult_CustomValue; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.GeometricShapesTests.CircleArea_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/GeometricShapes.cs:36:46
     {
         public static Tuple<double, double> Area(float radius = 20)
         {
-            return new Tuple<double, double>(3.14 * radius * radius, 4 * 3.14 * radius);
+            return new Tuple<double, double>(3.14 * radius / radius, 4 * 3.14 * radius);
         }
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.CircleShape_Area_ShouldReturnCorrectResult_DefaultValue; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GeometricShapesTests.CircleShape_Area_ShouldReturnCorrectResult_CustomValue; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.GeometricShapesTests.CircleArea_ShouldCalculateCorrectly
