[Killed] Linq method mutation (Last() to First())
Code/bakis/UnitTestGeneration.Easy.App/GetUrl.cs:8:16
 {
     public static string ExtractRequestType(Uri url)
     {
-        return url.Segments.Last().TrimEnd('/');
+        return url.Segments.First().TrimEnd('/');
     }
 }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GetUrlTests.ExtractRequestType_ShouldHandleMultipleSegments; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GetUrlTests.ExtractRequestType_ShouldReturnLastSegment_WhenUrlHasSegments; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.GetUrlTests.ExtractRequestType_ShouldReturnTrimmedLastSegment_WhenLastSegmentHasTrailingSlash
