[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Easy.App/IsNumber.cs:9:50
 {
     public static bool IsNumeric(string number)
     {
-        if (string.IsNullOrEmpty(number)) return false;
+        if (string.IsNullOrEmpty(number)) return true;
         foreach (var digit in number)
             if (!int.TryParse(digit.ToString(), out _))
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnFalse_ForNullString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnFalse_ForEmptyString; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.IsNumberTests.IsNumeric_EmptyString_ReturnsFalse

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Easy.App/IsNumber.cs:9:13
 {
     public static bool IsNumeric(string number)
     {
-        if (string.IsNullOrEmpty(number)) return false;
+        if (!(string.IsNullOrEmpty(number))) return false;
         foreach (var digit in number)
             if (!int.TryParse(digit.ToString(), out _))
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnFalse_ForNullString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnTrue_ForNumericString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnTrue_ForNumericString

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Easy.App/IsNumber.cs:11:17
     {
         if (string.IsNullOrEmpty(number)) return false;
         foreach (var digit in number)
-            if (!int.TryParse(digit.ToString(), out _))
+            if (int.TryParse(digit.ToString(), out _))
                 return false;
         return true;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnFalse_ForNonNumericString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnTrue_ForNumericString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnTrue_ForNumericString

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Easy.App/IsNumber.cs:12:24
         if (string.IsNullOrEmpty(number)) return false;
         foreach (var digit in number)
             if (!int.TryParse(digit.ToString(), out _))
-                return false;
+                return true;
         return true;
     }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnFalse_ForNonNumericString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnFalse_ForNonNumericString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnFalse_ForNonNumericString

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Easy.App/IsNumber.cs:13:16
         foreach (var digit in number)
             if (!int.TryParse(digit.ToString(), out _))
                 return false;
-        return true;
+        return false;
     }
 }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnTrue_ForNumericString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnTrue_ForNumericString; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.IsNumberTests.IsNumeric_ShouldReturnTrue_ForNumericString
