[Killed] Negate expression
Code/bakis/UnitTestGeneration.Easy.App/LoanApplication.cs:8:13
     public static bool CanGetFamilyLoan(byte firstPersonAge, byte secondPersonAge, bool haveKids = false)
     {
         const int legalAge = 17;
-        if (haveKids)
+        if (!(haveKids))
         {
             return (firstPersonAge + secondPersonAge) > legalAge * 3;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.LoadApplicationTests.CanGetFamilyLoan_ShouldReturnCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/LoanApplication.cs:10:57
         const int legalAge = 17;
         if (haveKids)
         {
-            return (firstPersonAge + secondPersonAge) > legalAge * 3;
+            return (firstPersonAge + secondPersonAge) > legalAge / 3;
         }
         return firstPersonAge > legalAge && secondPersonAge > legalAge;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.LoadApplicationTests.CanGetFamilyLoan_ShouldReturnCorrectResult; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.LoadApplicationTests.CanGetFamilyLoan_ShouldReturnCorrectResult; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.LoanApplicationTests.CanGetFamilyLoan_WithKids_CombinedAgeBelowThreshold_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/LoanApplication.cs:10:20
         const int legalAge = 17;
         if (haveKids)
         {
-            return (firstPersonAge + secondPersonAge) > legalAge * 3;
+            return (firstPersonAge + secondPersonAge) < legalAge * 3;
         }
         return firstPersonAge > legalAge && secondPersonAge > legalAge;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.LoadApplicationTests.CanGetFamilyLoan_ShouldReturnCorrectResult; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.LoadApplicationTests.CanGetFamilyLoan_ShouldReturnCorrectResult; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.LoanApplicationTests.CanGetFamilyLoan_WithKids_CombinedAgeBelowThreshold_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/LoanApplication.cs:12:45
         {
             return (firstPersonAge + secondPersonAge) > legalAge * 3;
         }
-        return firstPersonAge > legalAge && secondPersonAge > legalAge;
+        return firstPersonAge > legalAge && secondPersonAge >= legalAge;
     }
 }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.LoadApplicationTests.CanGetFamilyLoan_ShouldReturnCorrectResult; UnitTestGeneration.Easy.Tests.Cloude.Prompt3.LoadApplicationTests.CanGetFamilyLoan_WithoutKids_ReturnsFalse

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Easy.App/LoanApplication.cs:12:16
         {
             return (firstPersonAge + secondPersonAge) > legalAge * 3;
         }
-        return firstPersonAge > legalAge && secondPersonAge > legalAge;
+        return firstPersonAge > legalAge || secondPersonAge > legalAge;
     }
 }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.LoadApplicationTests.CanGetFamilyLoan_ShouldReturnCorrectResult; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.LoanApplicationTests.CanGetFamilyLoan_WithoutKids_OneBelowLegalAge_ReturnsFalse; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt1.LoadApplicationTests.CanGetFamilyLoan_ShouldReturnCorrectResult
