[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/MultiCardsCheck.cs:9:45
 {
     public static int CheckForMultiCards(string[] valueCounters, int valueCount)
     {
-        return valueCounters.Count(value => Convert.ToInt32(value.Split('|')[1]) == valueCount);
+        return valueCounters.Count(value => Convert.ToInt32(value.Split('|')[1]) != valueCount);
     }
 }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.MultiCardsCheckTests.CheckForMultiCards_ShouldReturnCorrectCount_WhenValueCountersContainsMatchingElements; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.MultiCardsCheckTests.CheckForMultiCards_ShouldReturnZero_WhenValueCountersContainsNoMatchingElements; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.MultiCardsCheckTests.CheckForMultiCards_MultipleMatches_ReturnsCorrectCount
