[NoCoverage] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/Program.cs:29:9
         
         
         // GeometricShapes
-        Console.WriteLine(GeometricShapes.RectangleShape.Area(2));
+        ;
         Console.WriteLine(GeometricShapes.TriangleShape.Area(2));
         Console.WriteLine(GeometricShapes.SquareShape.Area(2));

[NoCoverage] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/Program.cs:30:9
         
         // GeometricShapes
         Console.WriteLine(GeometricShapes.RectangleShape.Area(2));
-        Console.WriteLine(GeometricShapes.TriangleShape.Area(2));
+        ;
         Console.WriteLine(GeometricShapes.SquareShape.Area(2));
         Console.WriteLine(GeometricShapes.CircleShape.Area(2));

[NoCoverage] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/Program.cs:31:9
         // GeometricShapes
         Console.WriteLine(GeometricShapes.RectangleShape.Area(2));
         Console.WriteLine(GeometricShapes.TriangleShape.Area(2));
-        Console.WriteLine(GeometricShapes.SquareShape.Area(2));
+        ;
         Console.WriteLine(GeometricShapes.CircleShape.Area(2));
         

[NoCoverage] Statement mutation
Code/bakis/UnitTestGeneration.Easy.App/Program.cs:32:9
         Console.WriteLine(GeometricShapes.RectangleShape.Area(2));
         Console.WriteLine(GeometricShapes.TriangleShape.Area(2));
         Console.WriteLine(GeometricShapes.SquareShape.Area(2));
-        Console.WriteLine(GeometricShapes.CircleShape.Area(2));
+        ;
         
         
