[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/RemoveArrayDuplicates.cs:15:17
 
         foreach (var num in nums)
         {
-            if (nums[result - 1] != num)
+            if (nums[result - 1] == num)
             {
                 nums[result++] = num;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldModifyArray_WhenArrayHasDuplicates; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldReturnLengthOfOne_WhenArrayHasNoDuplicates; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldReturnCorrectLength_WhenArrayHasDuplicates

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/RemoveArrayDuplicates.cs:15:22
 
         foreach (var num in nums)
         {
-            if (nums[result - 1] != num)
+            if (nums[result + 1] != num)
             {
                 nums[result++] = num;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldModifyArray_WhenArrayHasDuplicates; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldReturnLengthOfOne_WhenArrayHasNoDuplicates; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldReturnCorrectLength_WhenArrayHasDuplicates

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Easy.App/RemoveArrayDuplicates.cs:17:22
         {
             if (nums[result - 1] != num)
             {
-                nums[result++] = num;
+                nums[result--] = num;
             }
         }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldModifyArray_WhenArrayHasDuplicates; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldReturnLengthOfOne_WhenArrayHasNoDuplicates; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldReturnCorrectLength_WhenArrayHasDuplicates
