[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/SqrtFunction.cs:8:12
 public static class SqrtFunction
 {
     public static decimal Sqrt(decimal x, decimal epsilon = 0.0M) {
-        if(x<0) throw new OverflowException("Cannot calculate square root from a negative number");
+        if(x<=0) throw new OverflowException("Cannot calculate square root from a negative number");
 
         decimal current = (decimal)Math.Sqrt((double)x), previous;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnZero_ForZero

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Easy.App/SqrtFunction.cs:8:12
 public static class SqrtFunction
 {
     public static decimal Sqrt(decimal x, decimal epsilon = 0.0M) {
-        if(x<0) throw new OverflowException("Cannot calculate square root from a negative number");
+        if(!(x<0)) throw new OverflowException("Cannot calculate square root from a negative number");
 
         decimal current = (decimal)Math.Sqrt((double)x), previous;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/SqrtFunction.cs:13:16
         decimal current = (decimal)Math.Sqrt((double)x), previous;
         do {
             previous=current;
-            if(previous==0.0M) return 0;
+            if(previous!=0.0M) return 0;
             current=(previous+x/previous)/2;
         }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/SqrtFunction.cs:14:31
         do {
             previous=current;
             if(previous==0.0M) return 0;
-            current=(previous+x/previous)/2;
+            current=(previous+x*previous)/2;
         }
         while(Math.Abs(previous-current)>epsilon);
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Easy.App/SqrtFunction.cs:14:22
         do {
             previous=current;
             if(previous==0.0M) return 0;
-            current=(previous+x/previous)/2;
+            current=(previous-x/previous)/2;
         }
         while(Math.Abs(previous-current)>epsilon);
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPositiveNumbers
