[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:13:13
     public static bool CheckIfExists(int[] arr)
     {
         var index = 0;
-        if (arr.Length != 0)
+        if (arr.Length == 0)
         {
             foreach (var item in arr)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithDouble_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithNegativeNumbers_ReturnsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithMultipleZeros_ReturnsTrue

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:17:21
         {
             foreach (var item in arr)
             {
-                if (item != 0)
+                if (item == 0)
                 {
                     var find = Array.Find(arr, i => i == item * 2);
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithDouble_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithNegativeNumbers_ReturnsCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithNonZeroValuesAndDoubleExists_ReturnsTrue

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:19:58
             {
                 if (item != 0)
                 {
-                    var find = Array.Find(arr, i => i == item * 2);
+                    var find = Array.Find(arr, i => i == item / 2);
                     if (find != 0)
                     {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithoutDouble_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithNonZeroValuesAndDoubleDoesNotExist_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithoutDouble_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:19:53
             {
                 if (item != 0)
                 {
-                    var find = Array.Find(arr, i => i == item * 2);
+                    var find = Array.Find(arr, i => i != item * 2);
                     if (find != 0)
                     {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithoutDouble_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithNonZeroValuesAndDoubleDoesNotExist_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_ZeroAsDouble_ReturnsTrue

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:20:25
                 if (item != 0)
                 {
                     var find = Array.Find(arr, i => i == item * 2);
-                    if (find != 0)
+                    if (find == 0)
                     {
                         return true;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithoutDouble_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithNonZeroValuesAndDoubleDoesNotExist_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithoutDouble_ReturnsFalse

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:22:32
                     var find = Array.Find(arr, i => i == item * 2);
                     if (find != 0)
                     {
-                        return true;
+                        return false;
                     }
                 }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithNonZeroValuesAndDoubleExists_ReturnsTrue

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:25:21
                         return true;
                     }
                 }
-                if (item == 0)
+                if (item != 0)
                 {
                     for (int cont = index + 1; cont < arr.Length; cont++)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithMultipleZeros_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithOnlyZeroes_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_MultipleZeros_ReturnsTrue

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:27:37
                 }
                 if (item == 0)
                 {
-                    for (int cont = index + 1; cont < arr.Length; cont++)
+                    for (int cont = index - 1; cont < arr.Length; cont++)
                     {
                         if (arr[cont] == item)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithMultipleZeros_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithZeroAndNonZeroValues_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithOnlyZeroes_ReturnsTrue

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:27:48
                 }
                 if (item == 0)
                 {
-                    for (int cont = index + 1; cont < arr.Length; cont++)
+                    for (int cont = index + 1; cont <= arr.Length; cont++)
                     {
                         if (arr[cont] == item)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_ZeroAsDouble_ReturnsTrue

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:29:29
                 {
                     for (int cont = index + 1; cont < arr.Length; cont++)
                     {
-                        if (arr[cont] == item)
+                        if (arr[cont] != item)
                         {
                             return true;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithOnlyZeroes_ReturnsTrue; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_ReturnsExpectedResult_ForDifferentArrays

[Survived] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:35:17
                         }
                     }
                 }
-                index++;
+                index--;
             }
         }

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:35:17
                         }
                     }
                 }
-                index++;
+                ;
             }
         }
