[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:15:44
         // { 17, 18, 5, 4, 6, 1 };
         var newArray = new int[arr.Length];
         
-        if (arr.Length == 1) newArray[0] = -1;
+        if (arr.Length == 1) newArray[0] = +1;
         else
         {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.SingleElementArray_ReturnsMinusOne; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ElementReplacementTests.ReplaceElements_ShouldHandleSingleElementArray; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ElementReplacementTests.ReplaceElements_ShouldReplaceElementsWithGreatestElementOnRightSide

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:15:13
         // { 17, 18, 5, 4, 6, 1 };
         var newArray = new int[arr.Length];
         
-        if (arr.Length == 1) newArray[0] = -1;
+        if (arr.Length != 1) newArray[0] = -1;
         else
         {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.EmptyArray_ReturnsEmptyArray

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:18:32
         if (arr.Length == 1) newArray[0] = -1;
         else
         {
-            for (int cont = 0; cont < arr.Length; cont++)
+            for (int cont = 0; cont <= arr.Length; cont++)
             {
                 var result = -1;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.EmptyArray_ReturnsEmptyArray

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:18:32
         if (arr.Length == 1) newArray[0] = -1;
         else
         {
-            for (int cont = 0; cont < arr.Length; cont++)
+            for (int cont = 0; cont > arr.Length; cont++)
             {
                 var result = -1;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithDescendingElements_ReplacesElementsCorrectly

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:20:30
         {
             for (int cont = 0; cont < arr.Length; cont++)
             {
-                var result = -1;
+                var result = +1;
                 for (int contX = cont; contX < arr.Length; contX++)
                 {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithDescendingElements_ReplacesElementsCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:21:40
             for (int cont = 0; cont < arr.Length; cont++)
             {
                 var result = -1;
-                for (int contX = cont; contX < arr.Length; contX++)
+                for (int contX = cont; contX > arr.Length; contX++)
                 {
                     if (contX + 1 < arr.Length)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithDescendingElements_ReplacesElementsCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:21:60
             for (int cont = 0; cont < arr.Length; cont++)
             {
                 var result = -1;
-                for (int contX = cont; contX < arr.Length; contX++)
+                for (int contX = cont; contX < arr.Length; contX--)
                 {
                     if (contX + 1 < arr.Length)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithDescendingElements_ReplacesElementsCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:23:25
                 var result = -1;
                 for (int contX = cont; contX < arr.Length; contX++)
                 {
-                    if (contX + 1 < arr.Length)
+                    if (contX - 1 < arr.Length)
                     {
                         if (arr[contX + 1] > result)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ElementReplacementTests.ReplaceElements_ShouldHandleArrayWithAllElementsSame; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ElementReplacementTests.ReplaceElements_ShouldReplaceElementsWithGreatestElementOnRightSide; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ElementReplacementTests.ReplaceElements_ShouldReplaceElementsWithGreatestElementOnRightSide

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:23:25
                 var result = -1;
                 for (int contX = cont; contX < arr.Length; contX++)
                 {
-                    if (contX + 1 < arr.Length)
+                    if (!(contX + 1 < arr.Length))
                     {
                         if (arr[contX + 1] > result)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithMultipleElements_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithTwoElements_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithDuplicateElements_ReturnsCorrectResult

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:25:29
                 {
                     if (contX + 1 < arr.Length)
                     {
-                        if (arr[contX + 1] > result)
+                        if (!(arr[contX + 1] > result))
                         {
                             result = arr[contX + 1];
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithDescendingElements_ReplacesElementsCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:25:33
                 {
                     if (contX + 1 < arr.Length)
                     {
-                        if (arr[contX + 1] > result)
+                        if (arr[contX - 1] > result)
                         {
                             result = arr[contX + 1];
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithDescendingElements_ReplacesElementsCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:27:42
                     {
                         if (arr[contX + 1] > result)
                         {
-                            result = arr[contX + 1];
+                            result = arr[contX - 1];
                         }   
                     }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithEqualValues_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.TypicalArray_ReplacesElementsCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ElementReplacementTests.ArrayWithDescendingElements_ReplacesElementsCorrectly
