[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:8:22
 {
     public static bool SequenceEqualOrderIgnore<T>(this IEnumerable<T> first, IEnumerable<T> second, IEqualityComparer<T> comparer)
     {
-        if (first is null || second is null) return false;
+        if (first is not null || second is null) return false;
         Dictionary<T, int>? dict = new Dictionary<T, int>(comparer);
         foreach (T element in first)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_CustomComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_DefaultComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.NullInput_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:8:40
 {
     public static bool SequenceEqualOrderIgnore<T>(this IEnumerable<T> first, IEnumerable<T> second, IEqualityComparer<T> comparer)
     {
-        if (first is null || second is null) return false;
+        if (first is null || second is not null) return false;
         Dictionary<T, int>? dict = new Dictionary<T, int>(comparer);
         foreach (T element in first)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_WithCustomComparer_SequencesEqual_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_WithDefaultComparer_SequencesEqual_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_NullSecondSequence_ReturnsFalse

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:13:29
         foreach (T element in first)
         {
             dict.TryGetValue(element, out int count);
-            dict[element] = count + 1;
+            dict[element] = count - 1;
         }
         foreach (T element in second)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_CustomComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_DefaultComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_MatchingSequences_ReturnsTrue

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:17:17
         }
         foreach (T element in second)
         {
-            if (!dict.TryGetValue(element, out int count))
+            if (dict.TryGetValue(element, out int count))
                 return false;
             else if (--count == 0)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_CustomComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_DefaultComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.EnumerableExtensionsTests.SequenceEqualOrderIgnore_DefaultComparer_CallsOverloadWithComparer

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:18:24
         foreach (T element in second)
         {
             if (!dict.TryGetValue(element, out int count))
-                return false;
+                return true;
             else if (--count == 0)
                 dict.Remove(element);
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_WithDefaultComparer_SequencesNotEqual_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_SequencesNotEqual_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_WithCustomComparer_SequencesNotEqual_ReturnsFalse

[Killed] PreDecrementExpression to PreIncrementExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:19:22
         {
             if (!dict.TryGetValue(element, out int count))
                 return false;
-            else if (--count == 0)
+            else if (++count == 0)
                 dict.Remove(element);
             else
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_CustomComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_DefaultComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.EnumerableExtensionsTests.SequenceEqualOrderIgnore_DefaultComparer_CallsOverloadWithComparer

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:19:22
         {
             if (!dict.TryGetValue(element, out int count))
                 return false;
-            else if (--count == 0)
+            else if (--count != 0)
                 dict.Remove(element);
             else
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_CustomComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_DefaultComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.EnumerableExtensionsTests.SequenceEqualOrderIgnore_DefaultComparer_CallsOverloadWithComparer

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:20:17
             if (!dict.TryGetValue(element, out int count))
                 return false;
             else if (--count == 0)
-                dict.Remove(element);
+                ;
             else
                 dict[element] = count;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_CustomComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_DefaultComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.EnumerableExtensionsTests.SequenceEqualOrderIgnore_DefaultComparer_CallsOverloadWithComparer

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:27:5
         return dict.Count == 0;
     }
     public static bool SequenceEqualOrderIgnore<T>(this IEnumerable<T> first, IEnumerable<T> second)
-    {
-        return SequenceEqualOrderIgnore<T>(first, second, EqualityComparer<T>.Default);
-    }
+    {}
 }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.EnumerableExtensionsTests.EqualSequences_DefaultComparer_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.EnumerableExtensionsTests.SequenceEqualOrderIgnore_DefaultComparer_CallsOverloadWithComparer; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_MatchingSequences_ReturnsTrue
