[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:14:13
     decimal denominator {get; set;}
     public static decimal SafeDivision(decimal numerator, decimal denominator)
     {
-        if (numerator == 0 || denominator == 0)
+        if (!(numerator == 0 || denominator == 0))
             throw new DivideByZeroException();
         return numerator / denominator;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.SafeDivision_ValidInputs_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.SafeDivision_NumeratorIsZero_ThrowsDivideByZeroException; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ValidInput_ReturnsResult3

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:14:13
     decimal denominator {get; set;}
     public static decimal SafeDivision(decimal numerator, decimal denominator)
     {
-        if (numerator == 0 || denominator == 0)
+        if (numerator != 0 || denominator == 0)
             throw new DivideByZeroException();
         return numerator / denominator;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ValidInput_ReturnsResult3; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ZeroNumerator_ThrowsException1; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ValidInput_ReturnsResult

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:15:13
     public static decimal SafeDivision(decimal numerator, decimal denominator)
     {
         if (numerator == 0 || denominator == 0)
-            throw new DivideByZeroException();
+            ;
         return numerator / denominator;
     }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.SafeDivision_NumeratorIsZero_ThrowsDivideByZeroException; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ZeroNumerator_ThrowsException1; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ZeroNumerator_ThrowsException

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:16:16
     {
         if (numerator == 0 || denominator == 0)
             throw new DivideByZeroException();
-        return numerator / denominator;
+        return numerator * denominator;
     }
     public decimal Fraction(string FracTxt)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.SafeDivision_ValidInputs_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ValidInput_ReturnsResult3; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ValidInput_ReturnsResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:26:26
         {
             numerator = decimal.Parse(pieces[0]);
             denominator = decimal.Parse(pieces[1]);
-            simplified = numerator / denominator;
+            simplified = numerator * denominator;
         }
         catch (DivideByZeroException)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.FractionConvertersTests.Fraction_ValidInput_ReturnsCorrectDecimal; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.Fraction_DenominatorIsZero_WritesErrorMessage; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.Fraction_ValidInputs_ReturnsCorrectResult

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:30:13
         }
         catch (DivideByZeroException)
         {
-            Console.WriteLine("Attempted to write by zero.");
+            ;
         }
         return simplified;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.Fraction_DenominatorIsZero_WritesErrorMessage; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.FractionConvertersTests.Fraction_DenominatorZero_WritesErrorMessage

[Killed] String mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:37:43
     // Function converts feet from something like 66.888 to the proper form.
     public decimal InchesSplit(string inchesTxt)
     {
-        string[] pieces = inchesTxt.Split("'");
+        string[] pieces = inchesTxt.Split("");
         feet = decimal.Parse(pieces[0]) * 12;
         inches = decimal.Parse(pieces[1]);
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.FractionConvertersTests.InchesSplit_TypicalInput_ReturnsCorrectDecimal; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.InchesSplit_ValidInputs_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.InchesSplit_ValidInputs_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:38:16
     public decimal InchesSplit(string inchesTxt)
     {
         string[] pieces = inchesTxt.Split("'");
-        feet = decimal.Parse(pieces[0]) * 12;
+        feet = decimal.Parse(pieces[0]) / 12;
         inches = decimal.Parse(pieces[1]);
         simplified = feet + inches;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.FractionConvertersTests.InchesSplit_TypicalInput_ReturnsCorrectDecimal; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.InchesSplit_ValidInputs_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.InchesSplit_ValidInputs_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:40:22
         string[] pieces = inchesTxt.Split("'");
         feet = decimal.Parse(pieces[0]) * 12;
         inches = decimal.Parse(pieces[1]);
-        simplified = feet + inches;
+        simplified = feet - inches;
         return simplified;
     }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.FractionConvertersTests.InchesSplit_TypicalInput_ReturnsCorrectDecimal; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.InchesSplit_ValidInputs_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.InchesSplit_ValidInputs_ReturnsCorrectResult
