[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:10:22
 {
     private readonly Dictionary<string, (string symbol, int predence, bool rightAssociative)> operators =
         new (string symbol, int predence, bool rightAssociative)[] {
-            ("^", 4, true),
+            ("^", 4, false),
             ("×", 3, false),
             ("÷", 3, false),
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_RightAssociativeOperator_ReturnsCorrectPostfix

[Killed] String mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:10:14
 {
     private readonly Dictionary<string, (string symbol, int predence, bool rightAssociative)> operators =
         new (string symbol, int predence, bool rightAssociative)[] {
-            ("^", 4, true),
+            ("", 4, true),
             ("×", 3, false),
             ("÷", 3, false),
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_EmptyInput_ReturnsEmptyList; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_RightAssociativeOperator_ReturnsCorrectPostfix

[Survived] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:11:22
     private readonly Dictionary<string, (string symbol, int predence, bool rightAssociative)> operators =
         new (string symbol, int predence, bool rightAssociative)[] {
             ("^", 4, true),
-            ("×", 3, false),
+            ("×", 3, true),
             ("÷", 3, false),
             ("+", 2, false),

[Survived] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:12:22
         new (string symbol, int predence, bool rightAssociative)[] {
             ("^", 4, true),
             ("×", 3, false),
-            ("÷", 3, false),
+            ("÷", 3, true),
             ("+", 2, false),
             ("-", 2, false)

[Survived] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:13:22
             ("^", 4, true),
             ("×", 3, false),
             ("÷", 3, false),
-            ("+", 2, false),
+            ("+", 2, true),
             ("-", 2, false)
         }.ToDictionary(op => op.symbol);

[Survived] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:14:22
             ("×", 3, false),
             ("÷", 3, false),
             ("+", 2, false),
-            ("-", 2, false)
+            ("-", 2, true)
         }.ToDictionary(op => op.symbol);
     

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:22:16
         Stack<string> stack = new Stack<string>();
         List<string> postfix = new List<string>();
         foreach(string token in tokens) {
-            if(Decimal.TryParse(token, out _)) {
+            if(!(Decimal.TryParse(token, out _))) {
                 postfix.Add(token);
             } else if(operators.TryGetValue(token, out var op1)) {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.SimpleInfixExpression_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_SimpleExpression_ReturnsCorrectPostfix

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:23:17
         List<string> postfix = new List<string>();
         foreach(string token in tokens) {
             if(Decimal.TryParse(token, out _)) {
-                postfix.Add(token);
+                ;
             } else if(operators.TryGetValue(token, out var op1)) {
                 while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.SimpleInfixExpression_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.InfixToPostfixAppTests.InfixToPostfix_SingleNumber_ReturnsNumberAsPostfix

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:24:23
         foreach(string token in tokens) {
             if(Decimal.TryParse(token, out _)) {
                 postfix.Add(token);
-            } else if(operators.TryGetValue(token, out var op1)) {
+            } else if(!(operators.TryGetValue(token, out var op1))) {
                 while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
                     int c = op1.predence.CompareTo(op2.predence);
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.SimpleInfixExpression_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_SimpleExpression_ReturnsCorrectPostfix

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:25:23
             if(Decimal.TryParse(token, out _)) {
                 postfix.Add(token);
             } else if(operators.TryGetValue(token, out var op1)) {
-                while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
+                while(stack.Count >= 0 && operators.TryGetValue(stack.Peek(), out var op2)){
                     int c = op1.predence.CompareTo(op2.predence);
                     if(c < 0 || !op1.rightAssociative && c<=0) {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.SimpleInfixExpression_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.InfixToPostfixAppTests.InfixToPostfix_SimpleExpression_ReturnsCorrectPostfix

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:27:24
             } else if(operators.TryGetValue(token, out var op1)) {
                 while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
                     int c = op1.predence.CompareTo(op2.predence);
-                    if(c < 0 || !op1.rightAssociative && c<=0) {
+                    if(c <= 0 || !op1.rightAssociative && c<=0) {
                         postfix.Add(stack.Pop());
                     } else {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_RightAssociativeOperator_ReturnsCorrectPostfix; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.InfixToPostfixAppTests.InfixToPostfix_ReturnsCorrectPostfixExpression

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:27:24
             } else if(operators.TryGetValue(token, out var op1)) {
                 while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
                     int c = op1.predence.CompareTo(op2.predence);
-                    if(c < 0 || !op1.rightAssociative && c<=0) {
+                    if(!(c < 0 || !op1.rightAssociative && c<=0)) {
                         postfix.Add(stack.Pop());
                     } else {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_RightAssociativeOperator_ReturnsCorrectPostfix; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.InfixToPostfixAppTests.InfixToPostfix_ReturnsCorrectPostfixExpression

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:28:25
                 while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
                     int c = op1.predence.CompareTo(op2.predence);
                     if(c < 0 || !op1.rightAssociative && c<=0) {
-                        postfix.Add(stack.Pop());
+                        ;
                     } else {
                         break;

[Timeout] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:30:25
                     if(c < 0 || !op1.rightAssociative && c<=0) {
                         postfix.Add(stack.Pop());
                     } else {
-                        break;
+                        ;
                     }
                 }

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:33:17
                         break;
                     }
                 }
-                stack.Push(token);
+                ;
             } else if(token=="(") {
                 stack.Push("(");
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.SimpleInfixExpression_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.InfixToPostfixAppTests.InfixToPostfix_SimpleExpression_ReturnsCorrectPostfix

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:34:23
                     }
                 }
                 stack.Push(token);
-            } else if(token=="(") {
+            } else if(token!="(") {
                 stack.Push("(");
             } else if(token ==")") {
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.InfixToPostfixAppTests.InfixToPostfix_EmptyInfix_ReturnsEmptyPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_EmptyInput_ReturnsEmptyList; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_EmptyExpression_ReturnsEmptyList

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:35:17
                 }
                 stack.Push(token);
             } else if(token=="(") {
-                stack.Push("(");
+                ;
             } else if(token ==")") {
                 while(stack.Count > 0 && stack.Peek() != "(") {

[Survived] String mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:35:28
                 }
                 stack.Push(token);
             } else if(token=="(") {
-                stack.Push("(");
+                stack.Push("");
             } else if(token ==")") {
                 while(stack.Count > 0 && stack.Peek() != "(") {

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:36:23
                 stack.Push(token);
             } else if(token=="(") {
                 stack.Push("(");
-            } else if(token ==")") {
+            } else if(token !=")") {
                 while(stack.Count > 0 && stack.Peek() != "(") {
                     postfix.Add(stack.Pop());
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.InfixToPostfixAppTests.InfixToPostfix_EmptyInfix_ReturnsEmptyPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_EmptyInput_ReturnsEmptyList; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_EmptyExpression_ReturnsEmptyList

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:37:23
             } else if(token=="(") {
                 stack.Push("(");
             } else if(token ==")") {
-                while(stack.Count > 0 && stack.Peek() != "(") {
+                while(!(stack.Count > 0 && stack.Peek() != "(")) {
                     postfix.Add(stack.Pop());
                 }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_InvalidExpression_ThrowsException; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.InfixToPostfixAppTests.InfixToPostfix_HandlesInvalidInput

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:37:42
             } else if(token=="(") {
                 stack.Push("(");
             } else if(token ==")") {
-                while(stack.Count > 0 && stack.Peek() != "(") {
+                while(stack.Count > 0 && stack.Peek() == "(") {
                     postfix.Add(stack.Pop());
                 }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_InvalidExpression_ThrowsException; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.InfixToPostfixAppTests.InfixToPostfix_HandlesInvalidInput

[Timeout] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:38:21
                 stack.Push("(");
             } else if(token ==")") {
                 while(stack.Count > 0 && stack.Peek() != "(") {
-                    postfix.Add(stack.Pop());
+                    ;
                 }
                 postfix.Add(stack.Pop());

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:40:17
                 while(stack.Count > 0 && stack.Peek() != "(") {
                     postfix.Add(stack.Pop());
                 }
-                postfix.Add(stack.Pop());
+                ;
             }
         }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_InvalidExpression_ThrowsException; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.InfixToPostfixAppTests.InfixToPostfix_HandlesInvalidInput

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:43:15
                 postfix.Add(stack.Pop());
             }
         }
-        while(stack.Count >0) {
+        while(!(stack.Count >0)) {
             postfix.Add(stack.Pop());
         }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.SimpleInfixExpression_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.InfixToPostfixAppTests.InfixToPostfix_SingleNumber_ReturnsNumberAsPostfix

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:43:15
                 postfix.Add(stack.Pop());
             }
         }
-        while(stack.Count >0) {
+        while(stack.Count >=0) {
             postfix.Add(stack.Pop());
         }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.RightAssociativeOperator_ConvertsToPostfix; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.InfixToPostfixAppTests.SimpleInfixExpression_ConvertsToPostfix

[Timeout] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:44:13
             }
         }
         while(stack.Count >0) {
-            postfix.Add(stack.Pop());
+            ;
         }
         foreach(string s in postfix) {

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:47:13
             postfix.Add(stack.Pop());
         }
         foreach(string s in postfix) {
-            Console.Write(s+" ");
+            ;
         }
         Console.WriteLine("");

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:49:9
         foreach(string s in postfix) {
             Console.Write(s+" ");
         }
-        Console.WriteLine("");
+        ;
         return postfix;   
     }

[Survived] String mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:49:27
         foreach(string s in postfix) {
             Console.Write(s+" ");
         }
-        Console.WriteLine("");
+        Console.WriteLine("Stryker was here!");
         return postfix;   
     }
