[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:8:16
     public static bool CanGetFamilyLoan(int firstPersonAge, int secondPersonAge)
     {
         const int legalAge = 17;
-        return firstPersonAge > legalAge && secondPersonAge > legalAge;
+        return firstPersonAge < legalAge && secondPersonAge > legalAge;
     }
     
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_IneligibleAge; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.CanGetFamilyLoan_ReturnsCorrectEligibility; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.CanGetFamilyLoan_ReturnsCorrectEligibility

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:8:45
     public static bool CanGetFamilyLoan(int firstPersonAge, int secondPersonAge)
     {
         const int legalAge = 17;
-        return firstPersonAge > legalAge && secondPersonAge > legalAge;
+        return firstPersonAge > legalAge && secondPersonAge >= legalAge;
     }
     
killedBy: UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt3.LoanApplicationTests.CanGetFamilyLoan_ValidAges_ReturnsExpectedResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:13:20
     
     public static int FindMonthlyPaymentSize(int firstPersonSalary, int secondPersonSalary)
     {
-        var sum = (firstPersonSalary + secondPersonSalary) / 10 * 3;
+        var sum = (firstPersonSalary - secondPersonSalary) / 10 * 3;
         return sum;
     }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.FindMonthlyPaymentSize_CalculatesCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.FindMonthlyPaymentSize_CalculatesCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_EligibleFamily_SufficientPayment

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:13:19
     
     public static int FindMonthlyPaymentSize(int firstPersonSalary, int secondPersonSalary)
     {
-        var sum = (firstPersonSalary + secondPersonSalary) / 10 * 3;
+        var sum = (firstPersonSalary + secondPersonSalary) * 10 * 3;
         return sum;
     }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.LoanApplicationTests.FindMonthlyPaymentSize_ValidSalaries_ReturnsCorrectPaymentSize; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.LoanApplicationTests.FindMonthlyPaymentSize_ValidSalaries_ReturnsCorrectPaymentSize; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.LoanApplicationTests.IsFamilyApplicableForLoad_BothAgesAboveLegalAge_PaymentSizeAboveMinimum_ReturnsTrueAndPaymentSize

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:20:13
     public static Tuple<bool, int> IsFamilyApplicableForLoad(Tuple<int,int> ages, Tuple<int, int> salaries)
     {
         const int minimumPaymentSize = 100;
-        if (CanGetFamilyLoan(ages.Item1, ages.Item2))
+        if (!(CanGetFamilyLoan(ages.Item1, ages.Item2)))
         {
             var monthlyPaymentSize = FindMonthlyPaymentSize(salaries.Item1, salaries.Item2);
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_IneligibleAge; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_EligibleFamily_SufficientPayment; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.LoanApplicationTests.IsFamilyApplicableForLoad_Underage_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:23:17
         if (CanGetFamilyLoan(ages.Item1, ages.Item2))
         {
             var monthlyPaymentSize = FindMonthlyPaymentSize(salaries.Item1, salaries.Item2);
-            if (monthlyPaymentSize > minimumPaymentSize)
+            if (monthlyPaymentSize < minimumPaymentSize)
             {
                 return new Tuple<bool, int>(true, monthlyPaymentSize);
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_EligibleFamily_SufficientPayment; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.LoanApplicationTests.IsFamilyApplicableForLoad_WhenEligibleForLoan_ReturnsTrueAndCorrectPayment; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.LoanApplicationTests.IsFamilyApplicableForLoad_Eligible_ReturnsTrue

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:23:17
         if (CanGetFamilyLoan(ages.Item1, ages.Item2))
         {
             var monthlyPaymentSize = FindMonthlyPaymentSize(salaries.Item1, salaries.Item2);
-            if (monthlyPaymentSize > minimumPaymentSize)
+            if (!(monthlyPaymentSize > minimumPaymentSize))
             {
                 return new Tuple<bool, int>(true, monthlyPaymentSize);
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_EligibleFamily_SufficientPayment; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.LoanApplicationTests.IsFamilyApplicableForLoad_WhenEligibleForLoan_ReturnsTrueAndCorrectPayment; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.LoanApplicationTests.IsFamilyApplicableForLoad_Eligible_ReturnsTrue

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:25:45
             var monthlyPaymentSize = FindMonthlyPaymentSize(salaries.Item1, salaries.Item2);
             if (monthlyPaymentSize > minimumPaymentSize)
             {
-                return new Tuple<bool, int>(true, monthlyPaymentSize);
+                return new Tuple<bool, int>(false, monthlyPaymentSize);
             }
 
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_EligibleFamily_SufficientPayment; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.LoanApplicationTests.IsFamilyApplicableForLoad_WhenEligibleForLoan_ReturnsTrueAndCorrectPayment; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.LoanApplicationTests.IsFamilyApplicableForLoad_Eligible_ReturnsTrue

[NoCoverage] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:28:41
                 return new Tuple<bool, int>(true, monthlyPaymentSize);
             }
 
-            return new Tuple<bool, int>(false, monthlyPaymentSize);
+            return new Tuple<bool, int>(true, monthlyPaymentSize);
         }
 

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:31:37
             return new Tuple<bool, int>(false, monthlyPaymentSize);
         }
 
-        return new Tuple<bool, int>(false, 0);
+        return new Tuple<bool, int>(true, 0);
     }
 }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_IneligibleAge; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.LoanApplicationTests.IsFamilyApplicableForLoad_WhenBothAgesUnderLegalAge_ReturnsFalseAndZeroPayment; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.LoanApplicationTests.IsFamilyApplicableForLoad_Underage_ReturnsFalse
