[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/PostfixEvaluation.cs:19:16
         decimal temp,topStack, retVal=0;
         var stack = new Stack<string>();
         foreach(string s in postfix) {
-            if(Decimal.TryParse(s,out _)) {
+            if(!(Decimal.TryParse(s,out _))) {
                 stack.Push(s);
             } else if(operators.TryGetValue(s,out var op)) {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_InvalidExpression; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_MultipleOperations; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_SimpleAddition

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/PostfixEvaluation.cs:20:17
         var stack = new Stack<string>();
         foreach(string s in postfix) {
             if(Decimal.TryParse(s,out _)) {
-                stack.Push(s);
+                ;
             } else if(operators.TryGetValue(s,out var op)) {
                 Decimal.TryParse(stack.Pop(), out topStack);
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_MultipleOperations; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_SimpleAddition; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PostfixEvaluationTests.EvaluatePostfix_DivideByZero_ThrowsException

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/PostfixEvaluation.cs:21:23
         foreach(string s in postfix) {
             if(Decimal.TryParse(s,out _)) {
                 stack.Push(s);
-            } else if(operators.TryGetValue(s,out var op)) {
+            } else if(!(operators.TryGetValue(s,out var op))) {
                 Decimal.TryParse(stack.Pop(), out topStack);
                 Decimal.TryParse(stack.Pop(), out temp);
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_InvalidExpression; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_MultipleOperations; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_SimpleAddition

[Survived] UnaryMinusExpression to UnaryPlusExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/PostfixEvaluation.cs:38:32
                         retVal=Decimal.Multiply(temp, topStack);
                         break;
                     default:
-                        retVal=-987656789;
+                        retVal=+987656789;
                         break;
                 }

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Moderate.App/PostfixEvaluation.cs:41:17
                         retVal=-987656789;
                         break;
                 }
-                stack.Push(retVal.ToString());
+                ;
             }
         }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_MultipleOperations; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PostfixEvaluationTests.EvaluatePostfix_SimpleAddition; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PostfixEvaluationTests.EvaluatePostfix_ValidInput_ReturnsCorrectResult
