[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:8:39
 {
         public static bool IsNumberEven(int numberToCheck)
         {
-            return !Convert.ToBoolean(numberToCheck % 2);
+            return !Convert.ToBoolean(numberToCheck * 2);
         }
         public static bool IsNumberPrime(int numberToCheck, int potencialDivider = 3)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.IsNumberEven_ShouldReturnTrueForEvenNumbers; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.PrimeTest_ShouldIdentifyNonPrimesCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.IsNumberEven_ShouldReturnCorrectResult

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:8:20
 {
         public static bool IsNumberEven(int numberToCheck)
         {
-            return !Convert.ToBoolean(numberToCheck % 2);
+            return Convert.ToBoolean(numberToCheck % 2);
         }
         public static bool IsNumberPrime(int numberToCheck, int potencialDivider = 3)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.IsNumberEven_ShouldReturnFalseForOddNumbers; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.IsNumberEven_ShouldReturnTrueForEvenNumbers; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.PrimeTest_ShouldIdentifyNonPrimesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:12:54
         }
         public static bool IsNumberPrime(int numberToCheck, int potencialDivider = 3)
         {
-            bool primeTestResult = Convert.ToBoolean(numberToCheck % potencialDivider);
+            bool primeTestResult = Convert.ToBoolean(numberToCheck * potencialDivider);
 
             if (potencialDivider <= Math.Sqrt(numberToCheck))
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.PrimeTest_ShouldIdentifyNonPrimesCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.IsNumberPrime_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:14:17
         {
             bool primeTestResult = Convert.ToBoolean(numberToCheck % potencialDivider);
 
-            if (potencialDivider <= Math.Sqrt(numberToCheck))
+            if (potencialDivider < Math.Sqrt(numberToCheck))
             {
                 if (!primeTestResult)

[Timeout] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:14:17
         {
             bool primeTestResult = Convert.ToBoolean(numberToCheck % potencialDivider);
 
-            if (potencialDivider <= Math.Sqrt(numberToCheck))
+            if (!(potencialDivider <= Math.Sqrt(numberToCheck)))
             {
                 if (!primeTestResult)

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:16:21
 
             if (potencialDivider <= Math.Sqrt(numberToCheck))
             {
-                if (!primeTestResult)
+                if (primeTestResult)
                 {
                     return primeTestResult;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.PrimeTest_ShouldIdentifyNonPrimesCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.IsNumberPrime_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult

[Survived] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:17:17
             if (potencialDivider <= Math.Sqrt(numberToCheck))
             {
                 if (!primeTestResult)
-                {
-                    return primeTestResult;
-                }
+                {}
                 else
                 {

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:22:21
                 }
                 else
                 {
-                    potencialDivider += 2;
+                    potencialDivider -= 2;
                     if (IsNumberPrime(potencialDivider)) 
                     {
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.PrimeNumbersTests.IsNumberPrime_PrimeNumber_ReturnsTrue

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:23:25
                 else
                 {
                     potencialDivider += 2;
-                    if (IsNumberPrime(potencialDivider)) 
+                    if (!(IsNumberPrime(potencialDivider))) 
                     {
                         return IsNumberPrime(numberToCheck, potencialDivider);
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.IsNumberPrime_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PrimeNumbersTests.IsNumberPrime_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt1.PrimeNumersTests.IsNumberPrime_ReturnsExpectedResult

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:24:21
                 {
                     potencialDivider += 2;
                     if (IsNumberPrime(potencialDivider)) 
-                    {
-                        return IsNumberPrime(numberToCheck, potencialDivider);
-                    } 
+                    {} 
                     else
                     {
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.PrimeNumbersTests.IsNumberPrime_PrimeNumber_ReturnsTrue

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:35:13
                 }
             }
             else
-            {
-                return primeTestResult;
-            }
+            {}
         }
 
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:44:17
         {
             bool primeTestResult;
 
-            if (numberToCheck > 1)
+            if (numberToCheck < 1)
             {
                 if (numberToCheck == 2)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.PrimeTest_ShouldHandleInvalidInput; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.PrimeNumbersTests.PrimeTest_Two_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PrimeNumbersTests.PrimeTest_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:44:17
         {
             bool primeTestResult;
 
-            if (numberToCheck > 1)
+            if (numberToCheck >= 1)
             {
                 if (numberToCheck == 2)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.PrimeTest_ShouldIdentifyNonPrimesCorrectly; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.PrimeNumbersTests.PrimeTest_ZeroAndOne_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PrimeNumbersTests.PrimeTest_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:46:21
 
             if (numberToCheck > 1)
             {
-                if (numberToCheck == 2)
+                if (numberToCheck != 2)
                 {
                     primeTestResult = true;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.PrimeTest_ShouldIdentifyNonPrimesCorrectly

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:48:39
             {
                 if (numberToCheck == 2)
                 {
-                    primeTestResult = true;
+                    primeTestResult = false;
                 } else if (IsNumberEven(numberToCheck))
                 {
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.PrimeNumbersTests.PrimeTest_Two_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PrimeNumbersTests.PrimeTest_ReturnsCorrectResult

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:49:28
                 if (numberToCheck == 2)
                 {
                     primeTestResult = true;
-                } else if (IsNumberEven(numberToCheck))
+                } else if (!(IsNumberEven(numberToCheck)))
                 {
                     primeTestResult = false;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:51:39
                     primeTestResult = true;
                 } else if (IsNumberEven(numberToCheck))
                 {
-                    primeTestResult = false;
+                    primeTestResult = true;
                 }
                 else if (!IsNumberEven(numberToCheck) && !IsNumberPrime(numberToCheck))
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.PrimeNumbersTests.PrimeTest_ShouldIdentifyNonPrimesCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:53:58
                 {
                     primeTestResult = false;
                 }
-                else if (!IsNumberEven(numberToCheck) && !IsNumberPrime(numberToCheck))
+                else if (!IsNumberEven(numberToCheck) && IsNumberPrime(numberToCheck))
                 {
                     primeTestResult = false;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:53:26
                 {
                     primeTestResult = false;
                 }
-                else if (!IsNumberEven(numberToCheck) && !IsNumberPrime(numberToCheck))
+                else if (!IsNumberEven(numberToCheck) || !IsNumberPrime(numberToCheck))
                 {
                     primeTestResult = false;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:57:26
                 {
                     primeTestResult = false;
                 }
-                else if (!IsNumberEven(numberToCheck) && IsNumberPrime(numberToCheck)) 
+                else if (!(!IsNumberEven(numberToCheck) && IsNumberPrime(numberToCheck))) 
                 {
                     primeTestResult = true;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PrimeNumbersTests.PrimeTest_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PrimeNumbersTests.PrimeTest_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.PrimeNumbersTests.PrimeTest_PrimeNumber_ReturnsTrue

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:57:26
                 {
                     primeTestResult = false;
                 }
-                else if (!IsNumberEven(numberToCheck) && IsNumberPrime(numberToCheck)) 
+                else if (IsNumberEven(numberToCheck) && IsNumberPrime(numberToCheck)) 
                 {
                     primeTestResult = true;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.PrimeNumbersTests.PrimeTest_ShouldReturnCorrectResult

[NoCoverage] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:61:40
                 {
                     primeTestResult = true;
                 } 
-                else primeTestResult = false;
+                else primeTestResult = true;
             }
             else
