[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:14:16
 
     public decimal PoundsToKilograms(decimal _pounds)
     {
-        return _pounds / 2.20462262185m;
+        return _pounds * 2.20462262185m;
     }
     public decimal KilogramsToPounds(decimal kilograms)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.PoundsToKilograms_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.PoundsToKilograms_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.PoundsToKilograms_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:18:16
     }
     public decimal KilogramsToPounds(decimal kilograms)
     {
-        return kilograms * 2.20462262185m;
+        return kilograms / 2.20462262185m;
     }
     public decimal InchesToCentimeters(decimal _converted)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.UnitsConverterTests.KilogramsToPounds_ConvertsCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.KilogramsToPounds_ReturnsCorrectValue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.KilogramsToPounds_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:22:16
     }
     public decimal InchesToCentimeters(decimal _converted)
     {
-        return _converted * 2.54m;
+        return _converted / 2.54m;
     }
     public string CentimetersToInches(decimal centimeters)
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.UnitsConverterTests.InchesToCentimeters_ConvertsCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.InchesToCentimeters_ReturnsCorrectValue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.InchesToCentimeters_ReturnsCorrectValue

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:27:23
     public string CentimetersToInches(decimal centimeters)
     {
             
-        cmconverted = centimeters / 2.54m;
+        cmconverted = centimeters * 2.54m;
         if(cmconverted >= onefoot)
         {
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.CentimetersToInches_ReturnsCorrectValue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt1.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:28:12
     {
             
         cmconverted = centimeters / 2.54m;
-        if(cmconverted >= onefoot)
+        if(cmconverted < onefoot)
         {
             decimal dividedbytwelve = Math.Round(cmconverted / 12, 2);
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt1.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt1.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:28:12
     {
             
         cmconverted = centimeters / 2.54m;
-        if(cmconverted >= onefoot)
+        if(!(cmconverted >= onefoot))
         {
             decimal dividedbytwelve = Math.Round(cmconverted / 12, 2);
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt1.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt1.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:30:50
         cmconverted = centimeters / 2.54m;
         if(cmconverted >= onefoot)
         {
-            decimal dividedbytwelve = Math.Round(cmconverted / 12, 2);
+            decimal dividedbytwelve = Math.Round(cmconverted * 12, 2);
             string feet = dividedbytwelve.ToString();
             feet = feet.Replace(".", "'");

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:36:9
             return feet;
         }
         else
-        {
-            return cmconverted.ToString();
-        }
+        {}
 
     }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.CentimetersToInches_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.UnitsConverterTests.CentimetersToInches_ReturnsCorrectValue

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:43:16
     }
     public decimal CelsiusToFahrenheit(decimal celsius)
     {
-        return celsius + 32 * 1.8m;
+        return celsius - 32 * 1.8m;
     }
     public decimal FahrenheitToCelsius(decimal fahrenheit)

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:43:26
     }
     public decimal CelsiusToFahrenheit(decimal celsius)
     {
-        return celsius + 32 * 1.8m;
+        return celsius + 32 / 1.8m;
     }
     public decimal FahrenheitToCelsius(decimal fahrenheit)

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:47:17
     }
     public decimal FahrenheitToCelsius(decimal fahrenheit)
     {
-        return (fahrenheit - 32) / 1.8m;
+        return (fahrenheit + 32) / 1.8m;
     }
 }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.FahrenheitToCelsius_ReturnsCorrectValue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.FahrenheitToCelsius_ReturnsCorrectValue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.FahrenheitToCelsius_ReturnsCorrectValue

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:47:16
     }
     public decimal FahrenheitToCelsius(decimal fahrenheit)
     {
-        return (fahrenheit - 32) / 1.8m;
+        return (fahrenheit - 32) * 1.8m;
     }
 }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.FahrenheitToCelsius_ReturnsCorrectValue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.UnitsConverterTests.FahrenheitToCelsius_ReturnsCorrectValue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.UnitsConverterTests.FahrenheitToCelsius_ReturnsCorrectResult
