[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:12:31
     public bool ValidMountainArray(int[] arr)
     {
         // new[] { 0,2,3,2,1};
-        if (arr.Length < 3 || arr[0] > arr[1] || arr[^1] > arr[^2]) return false;
+        if (arr.Length < 3 || arr[0] < arr[1] || arr[^1] > arr[^2]) return false;
 
         bool incresing = true;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ValidateArrayTests.ValidMountainArray_DecreasingFromStart_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:12:13
     public bool ValidMountainArray(int[] arr)
     {
         // new[] { 0,2,3,2,1};
-        if (arr.Length < 3 || arr[0] > arr[1] || arr[^1] > arr[^2]) return false;
+        if (arr.Length < 3 && arr[0] > arr[1] || arr[^1] > arr[^2]) return false;
 
         bool incresing = true;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ValidateArrayTests.ValidMountainArray_ShouldHandleEmptyArrays; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt2.ValidateArrayTests.ValidMountainArray_ReturnsExpectedResult; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt2.ValidateArrayTests.ValidMountainArray_ArrayLessThan3Elements_ReturnsFalse

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:14:26
         // new[] { 0,2,3,2,1};
         if (arr.Length < 3 || arr[0] > arr[1] || arr[^1] > arr[^2]) return false;
 
-        bool incresing = true;
+        bool incresing = false;
         int previous = -1;
 
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ValidateArrayTests.ValidMountainArray_ValidMountainArray_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:15:24
         if (arr.Length < 3 || arr[0] > arr[1] || arr[^1] > arr[^2]) return false;
 
         bool incresing = true;
-        int previous = -1;
+        int previous = +1;
 
         foreach (var item in arr)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ValidateArrayTests.ValidMountainArray_ValidMountainArray_ReturnsTrue

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:19:42
 
         foreach (var item in arr)
         {
-            if (previous == item) return false;
+            if (previous == item) return true;
             else if (incresing && previous > item) incresing = false;
             else if (!incresing && previous < item) return false;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.ValidateArrayTests.ValidMountainArray_ShouldReturnFalseForInvalidArrays; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.ValidateArrayTests.ValidMountainArray_NoDecrease_ReturnsFalse; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.ValidateArrayTests.ValidMountainArray_Plateau_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:19:17
 
         foreach (var item in arr)
         {
-            if (previous == item) return false;
+            if (previous != item) return false;
             else if (incresing && previous > item) incresing = false;
             else if (!incresing && previous < item) return false;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ValidateArrayTests.ValidMountainArray_ValidMountainArray_ReturnsTrue

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:20:22
         foreach (var item in arr)
         {
             if (previous == item) return false;
-            else if (incresing && previous > item) incresing = false;
+            else if (incresing || previous > item) incresing = false;
             else if (!incresing && previous < item) return false;
 
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:20:35
         foreach (var item in arr)
         {
             if (previous == item) return false;
-            else if (incresing && previous > item) incresing = false;
+            else if (incresing && previous < item) incresing = false;
             else if (!incresing && previous < item) return false;
 
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ValidateArrayTests.ValidMountainArray_ValidMountainArray_ReturnsTrue

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:21:22
         {
             if (previous == item) return false;
             else if (incresing && previous > item) incresing = false;
-            else if (!incresing && previous < item) return false;
+            else if (!(!incresing && previous < item)) return false;
 
             previous = item;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ValidateArrayTests.ValidMountainArray_ValidMountainArray_ReturnsTrue

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Moderate.App/ValidateArray.cs:21:22
         {
             if (previous == item) return false;
             else if (incresing && previous > item) incresing = false;
-            else if (!incresing && previous < item) return false;
+            else if (incresing && previous < item) return false;
 
             previous = item;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.ValidateArrayTests.ValidMountainArray_ValidArray_ReturnsTrue
