[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/VisualCalculator.cs:23:24
             case Calculator_Opertaions.none:
                 break;
             case Calculator_Opertaions.add:
-                return dblNum1 + dblNum2;
+                return dblNum1 - dblNum2;
             case Calculator_Opertaions.subtract:
                 return dblNum1 - dblNum2;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.VisualCalculatorTests.BtnEnter_Click_CalculatesCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.VisualCalculatorTests.BtnEnter_Click_ShouldAddNumbers; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.VisualCalculatorTests.BtnEnter_Click_Addition_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/VisualCalculator.cs:25:24
             case Calculator_Opertaions.add:
                 return dblNum1 + dblNum2;
             case Calculator_Opertaions.subtract:
-                return dblNum1 - dblNum2;
+                return dblNum1 + dblNum2;
             case Calculator_Opertaions.multiplicate:
                 return dblNum1 * dblNum2;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.VisualCalculatorTests.BtnEnter_Click_CalculatesCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.VisualCalculatorTests.BtnEnter_Click_ShouldSubtractNumbers; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.VisualCalculatorTests.BtnEnter_Click_ShouldSubtractNumbers

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/VisualCalculator.cs:27:24
             case Calculator_Opertaions.subtract:
                 return dblNum1 - dblNum2;
             case Calculator_Opertaions.multiplicate:
-                return dblNum1 * dblNum2;
+                return dblNum1 / dblNum2;
             case Calculator_Opertaions.divide:
                 return dblNum1 / dblNum2;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.VisualCalculatorTests.BtnEnter_Click_CalculatesCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.VisualCalculatorTests.BtnEnter_Click_ShouldMultiplicateNumbers; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.VisualCalculatorTests.BtnEnter_Click_ShouldMultiplicateNumbers

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Moderate.App/VisualCalculator.cs:29:24
             case Calculator_Opertaions.multiplicate:
                 return dblNum1 * dblNum2;
             case Calculator_Opertaions.divide:
-                return dblNum1 / dblNum2;
+                return dblNum1 * dblNum2;
             default:
                 return 0;
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.VisualCalculatorTests.BtnEnter_Click_CalculatesCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.VisualCalculatorTests.BtnEnter_Click_ShouldHandleDivisionByZero; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.VisualCalculatorTests.BtnEnter_Click_ShouldHandleDivisionByZero
