[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:20:9
 
         #region Constructors
         public Card(string value, string suit)
-        {
-            CardValue = value;
-            CardSuit = suit;
-        }
+        {}
         #endregion
     }
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CardDeckCreatorTests.Card_PropertiesSetCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CardDeckCreatorTests.SetCardDeck_ShouldReturnDistinctCards; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.CardDeckCreatorTests.Card_Constructor_ShouldCreateCardObject

[Killed] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:36:24
             case 11:
                 return "J";
             case 12:
-                return "Q";
+                return "";
             case 13:
                 return "K";
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.ConvertValue_ValidInputs_ReturnsExpectedValues

[Killed] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:38:24
             case 12:
                 return "Q";
             case 13:
-                return "K";
+                return "";
             default:
                 return num.ToString();
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.ConvertValue_ValidInputs_ReturnsExpectedValues

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:46:5
     
     // Method to convert numeric value to suit characters.
     public static char ConvertSuit(int num)
-    {
-        switch (num)
-        {
-            case 1:
-                return 'C';
-            case 2:
-                return 'D';
-            case 3:
-                return 'H';
-            case 4:
-                return 'S';
-            default:
-                return 'X';
-        }
-    }
+    {}
     
     // Method to set card deck in a randomized order.
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.ConvertSuit_InvalidInputs_ReturnsX; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.ConvertSuit_InvalidInputs_ReturnsX; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.ConvertSuit_InvalidInputs_ReturnsX

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:66:36
     public static Card[] SetCardDeck(bool isHand = false)
     {
         string cardDeckInput = "";
-        Card[] cardDeck = new Card[isHand ? 5 : 52];
+        Card[] cardDeck = new Card[!(isHand ) ? 5 : 52];
 
         for (int i = 0; i < cardDeck.Length; i++)
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CardDeckCreatorTests.SetCardDeck_CreatesStandardDeck; UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CardDeckCreatorTests.SetCardDeck_CreatesHand; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CardDeckCreatorTests.SetCardDeck_ShouldReturn52CardsForFullDeck

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:68:25
         string cardDeckInput = "";
         Card[] cardDeck = new Card[isHand ? 5 : 52];
 
-        for (int i = 0; i < cardDeck.Length; i++)
+        for (int i = 0; i <= cardDeck.Length; i++)
         {
             string card = $"{ConvertValue((rand.Next(1, 14)))}|{ConvertSuit(rand.Next(1, 5))}";
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.SetCardDeck_IsHandTrue_Returns5UniqueCards

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:68:46
         string cardDeckInput = "";
         Card[] cardDeck = new Card[isHand ? 5 : 52];
 
-        for (int i = 0; i < cardDeck.Length; i++)
+        for (int i = 0; i < cardDeck.Length; i--)
         {
             string card = $"{ConvertValue((rand.Next(1, 14)))}|{ConvertSuit(rand.Next(1, 5))}";
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.SetCardDeck_IsHandTrue_Returns5UniqueCards; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.SetCardDeck_DefaultCase_Returns52UniqueCards

[Timeout] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:70:27
 
         for (int i = 0; i < cardDeck.Length; i++)
         {
-            string card = $"{ConvertValue((rand.Next(1, 14)))}|{ConvertSuit(rand.Next(1, 5))}";
+            string card = $"";
 
             // Checking for duplicates

[Timeout] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:73:17
             string card = $"{ConvertValue((rand.Next(1, 14)))}|{ConvertSuit(rand.Next(1, 5))}";
 
             // Checking for duplicates
-            if (!cardDeckInput.Contains(card))
+            if (cardDeckInput.Contains(card))
             {
                 // Append the card

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:81:17
             else
             {
                 // Try again if duplicate found
-                i--;
+                ;
                 continue;
             }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CardDeckCreatorTests.SetCardDeck_ShouldReturnDistinctCards; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.CardDeckCreatorTests.SetCardDeck_ShouldNotContainDuplicates_WhenCalled; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CardDeckCreatorTests.SetCardDeck_DefaultCase_Returns52UniqueCards

[Killed] PostDecrementExpression to PostIncrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:81:17
             else
             {
                 // Try again if duplicate found
-                i--;
+                i++;
                 continue;
             }
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CardDeckCreatorTests.SetCardDeck_NoDuplicates; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CardDeckCreatorTests.SetCardDeck_ShouldReturnDistinctCards; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.CardDeckCreatorTests.SetCardDeck_ShouldCreateUniqueDeckOf52Cards

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/CardDeckCreator.cs:82:17
             {
                 // Try again if duplicate found
                 i--;
-                continue;
+                ;
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CardDeckCreatorTests.SetCardDeck_ShouldReturnDistinctCards; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.CardDeckCreatorTests.SetCardDeck_WithoutHand_ReturnsFullDeck
