[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:22:57
         /// <returns>uint</returns>
         public uint Load32(byte[] x, int i)
         {
-            return (UInt32)(x[i] | (x[i + 1] << 8) | (x[i + 2] << 16) | (x[i + 3] << 24));
+            return (UInt32)(x[i] | (x[i + 1] << 8) | (x[i - 2] << 16) | (x[i + 3] << 24));
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.ChaChaTests.Load32_ConvertsBytesToInteger; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.ChaChaTests.Load32_ShouldReturnCorrectUIntRepresentations; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.ChaChaTests.Load32_ShouldReturnCorrectUIntRepresentations

[Killed] Bitwise mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:22:37
         /// <returns>uint</returns>
         public uint Load32(byte[] x, int i)
         {
-            return (UInt32)(x[i] | (x[i + 1] << 8) | (x[i + 2] << 16) | (x[i + 3] << 24));
+            return (UInt32)(x[i] | (x[i + 1] >> 8) | (x[i + 2] << 16) | (x[i + 3] << 24));
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.ChaChaTests.Load32_ConvertsBytesToInteger; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.ChaChaTests.Load32_ShouldReturnCorrectUIntRepresentations; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.ChaChaTests.Load32_ShouldReturnCorrectUIntRepresentations

[Killed] Bitwise mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:33:27
         /// <param name="u">uint</param>
         public void Store32(byte[] x, int i, uint u)
         {
-            x[i] = (byte)(u & 0xff);
+            x[i] = (byte)(u | 0xff);
             u >>= 8;
             x[i + 1] = (byte)(u & 0xff);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] RightShiftAssignmentExpression to LeftShiftAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:34:13
         public void Store32(byte[] x, int i, uint u)
         {
             x[i] = (byte)(u & 0xff);
-            u >>= 8;
+            u <<= 8;
             x[i + 1] = (byte)(u & 0xff);
             u >>= 8;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] Bitwise mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:35:31
         {
             x[i] = (byte)(u & 0xff);
             u >>= 8;
-            x[i + 1] = (byte)(u & 0xff);
+            x[i + 1] = (byte)(u | 0xff);
             u >>= 8;
             x[i + 2] = (byte)(u & 0xff);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:35:15
         {
             x[i] = (byte)(u & 0xff);
             u >>= 8;
-            x[i + 1] = (byte)(u & 0xff);
+            x[i - 1] = (byte)(u & 0xff);
             u >>= 8;
             x[i + 2] = (byte)(u & 0xff);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] RightShiftAssignmentExpression to LeftShiftAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:36:13
             x[i] = (byte)(u & 0xff);
             u >>= 8;
             x[i + 1] = (byte)(u & 0xff);
-            u >>= 8;
+            u <<= 8;
             x[i + 2] = (byte)(u & 0xff);
             u >>= 8;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:37:15
             u >>= 8;
             x[i + 1] = (byte)(u & 0xff);
             u >>= 8;
-            x[i + 2] = (byte)(u & 0xff);
+            x[i - 2] = (byte)(u & 0xff);
             u >>= 8;
             x[i + 3] = (byte)(u & 0xff);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] Bitwise mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:37:31
             u >>= 8;
             x[i + 1] = (byte)(u & 0xff);
             u >>= 8;
-            x[i + 2] = (byte)(u & 0xff);
+            x[i + 2] = (byte)(u | 0xff);
             u >>= 8;
             x[i + 3] = (byte)(u & 0xff);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] RightShiftAssignmentExpression to LeftShiftAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:38:13
             x[i + 1] = (byte)(u & 0xff);
             u >>= 8;
             x[i + 2] = (byte)(u & 0xff);
-            u >>= 8;
+            u <<= 8;
             x[i + 3] = (byte)(u & 0xff);
         }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:39:15
             u >>= 8;
             x[i + 2] = (byte)(u & 0xff);
             u >>= 8;
-            x[i + 3] = (byte)(u & 0xff);
+            x[i - 3] = (byte)(u & 0xff);
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Killed] Bitwise mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:39:31
             u >>= 8;
             x[i + 2] = (byte)(u & 0xff);
             u >>= 8;
-            x[i + 3] = (byte)(u & 0xff);
+            x[i + 3] = (byte)(u | 0xff);
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Store32_ShouldStoreBytesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.ChaChaTests.Store32_ShouldStoreUint32ToBytesCorrectly

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:48:13
         public void Demo()
         {
             var key = new byte[32];
-            RandomNumberGenerator.Create().GetBytes(key);
+            ;
 
             // The nonce includes the IV.  Each message must have a unique nonce.

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:53:13
             // The nonce includes the IV.  Each message must have a unique nonce.
             // Do not use the same nonce twice.
             var nonce = new byte[24];
-            RandomNumberGenerator.Create().GetBytes(nonce);
+            ;
 
             Console.WriteLine("key={0}", System.Convert.ToBase64String(key));

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:55:13
             var nonce = new byte[24];
             RandomNumberGenerator.Create().GetBytes(nonce);
 
-            Console.WriteLine("key={0}", System.Convert.ToBase64String(key));
+            ;
             Console.WriteLine("nonce={0}", System.Convert.ToBase64String(nonce));
             Console.WriteLine();

[Survived] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:55:31
             var nonce = new byte[24];
             RandomNumberGenerator.Create().GetBytes(nonce);
 
-            Console.WriteLine("key={0}", System.Convert.ToBase64String(key));
+            Console.WriteLine("", System.Convert.ToBase64String(key));
             Console.WriteLine("nonce={0}", System.Convert.ToBase64String(nonce));
             Console.WriteLine();

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:56:13
             RandomNumberGenerator.Create().GetBytes(nonce);
 
             Console.WriteLine("key={0}", System.Convert.ToBase64String(key));
-            Console.WriteLine("nonce={0}", System.Convert.ToBase64String(nonce));
+            ;
             Console.WriteLine();
 

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:57:13
 
             Console.WriteLine("key={0}", System.Convert.ToBase64String(key));
             Console.WriteLine("nonce={0}", System.Convert.ToBase64String(nonce));
-            Console.WriteLine();
+            ;
 
             string input = "What is Lorem Ipsum? Lorem Ipsum is simply dummy text of the printing " +

[Survived] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:59:28
             Console.WriteLine("nonce={0}", System.Convert.ToBase64String(nonce));
             Console.WriteLine();
 
-            string input = "What is Lorem Ipsum? Lorem Ipsum is simply dummy text of the printing " +
+            string input = "" +
                 "and typesetting industry.Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, " +
                 "when an unknown printer took a galley of type and scrambled it to make a type specimen book. " +

[Survived] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:62:17
             string input = "What is Lorem Ipsum? Lorem Ipsum is simply dummy text of the printing " +
                 "and typesetting industry.Lorem Ipsum has been the industry's standard dummy text ever since the 1500s, " +
                 "when an unknown printer took a galley of type and scrambled it to make a type specimen book. " +
-                "It has survived not only five centuries, but also the leap into electronic typesetting, remaining " +
+                "" +
                 "essentially unchanged. It was popularized in the 1960s with the release of Letraset sheets containing " +
                 "Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including " +

[Survived] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:64:17
                 "when an unknown printer took a galley of type and scrambled it to make a type specimen book. " +
                 "It has survived not only five centuries, but also the leap into electronic typesetting, remaining " +
                 "essentially unchanged. It was popularized in the 1960s with the release of Letraset sheets containing " +
-                "Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including " +
+                "" +
                 "versions of Lorem Ipsum.";
 

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:76:13
             byte[] ct = new byte[pt.Length];
 
             // Encrypt into cipher text (ct).
-            Encrypt(ctx, ct, pt, pt.Length);
+            ;
 
             Console.WriteLine("pt={0}", input);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:78:13
             // Encrypt into cipher text (ct).
             Encrypt(ctx, ct, pt, pt.Length);
 
-            Console.WriteLine("pt={0}", input);
+            ;
             Console.WriteLine("len={0}", input.Length);
             Console.WriteLine("hash={0}", Math.Abs(input.GetHashCode()));

[Survived] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:78:31
             // Encrypt into cipher text (ct).
             Encrypt(ctx, ct, pt, pt.Length);
 
-            Console.WriteLine("pt={0}", input);
+            Console.WriteLine("", input);
             Console.WriteLine("len={0}", input.Length);
             Console.WriteLine("hash={0}", Math.Abs(input.GetHashCode()));

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:79:13
             Encrypt(ctx, ct, pt, pt.Length);
 
             Console.WriteLine("pt={0}", input);
-            Console.WriteLine("len={0}", input.Length);
+            ;
             Console.WriteLine("hash={0}", Math.Abs(input.GetHashCode()));
             Console.WriteLine();

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:80:13
 
             Console.WriteLine("pt={0}", input);
             Console.WriteLine("len={0}", input.Length);
-            Console.WriteLine("hash={0}", Math.Abs(input.GetHashCode()));
+            ;
             Console.WriteLine();
 

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:81:13
             Console.WriteLine("pt={0}", input);
             Console.WriteLine("len={0}", input.Length);
             Console.WriteLine("hash={0}", Math.Abs(input.GetHashCode()));
-            Console.WriteLine();
+            ;
 
             Console.WriteLine("ct={0}", System.Convert.ToBase64String(ct));

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:83:13
             Console.WriteLine("hash={0}", Math.Abs(input.GetHashCode()));
             Console.WriteLine();
 
-            Console.WriteLine("ct={0}", System.Convert.ToBase64String(ct));
+            ;
             Console.WriteLine("len={0}", ct.Length);
             Console.WriteLine();

[Survived] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:83:31
             Console.WriteLine("hash={0}", Math.Abs(input.GetHashCode()));
             Console.WriteLine();
 
-            Console.WriteLine("ct={0}", System.Convert.ToBase64String(ct));
+            Console.WriteLine("", System.Convert.ToBase64String(ct));
             Console.WriteLine("len={0}", ct.Length);
             Console.WriteLine();

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:84:13
             Console.WriteLine();
 
             Console.WriteLine("ct={0}", System.Convert.ToBase64String(ct));
-            Console.WriteLine("len={0}", ct.Length);
+            ;
             Console.WriteLine();
 

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:85:13
 
             Console.WriteLine("ct={0}", System.Convert.ToBase64String(ct));
             Console.WriteLine("len={0}", ct.Length);
-            Console.WriteLine();
+            ;
 
             ctx = Init(key, nonce);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:91:13
 
             // decrypted text
             byte[] dt = new byte[ct.Length];
-            Encrypt(ctx, dt, ct, pt.Length);
+            ;
 
             string output = Encoding.UTF8.GetString(dt, 0, dt.Length);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:95:13
 
             string output = Encoding.UTF8.GetString(dt, 0, dt.Length);
 
-            Console.WriteLine("dt={0}", output);
+            ;
             Console.WriteLine("len={0}", output.Length);
             Console.WriteLine("hash={0}", Math.Abs(output.GetHashCode()));

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:96:13
             string output = Encoding.UTF8.GetString(dt, 0, dt.Length);
 
             Console.WriteLine("dt={0}", output);
-            Console.WriteLine("len={0}", output.Length);
+            ;
             Console.WriteLine("hash={0}", Math.Abs(output.GetHashCode()));
             Console.WriteLine();

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:97:13
 
             Console.WriteLine("dt={0}", output);
             Console.WriteLine("len={0}", output.Length);
-            Console.WriteLine("hash={0}", Math.Abs(output.GetHashCode()));
+            ;
             Console.WriteLine();
         }

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:98:13
             Console.WriteLine("dt={0}", output);
             Console.WriteLine("len={0}", output.Length);
             Console.WriteLine("hash={0}", Math.Abs(output.GetHashCode()));
-            Console.WriteLine();
+            ;
         }
 

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:115:20
             int i = 0;
             int dstPos = 0;
             int srcPos = 0;
-            while (len > 0)
+            while (!(len > 0))
             {
                 for (i = 0; i < 16; i++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.ChaChaTests.Encrypt_ShouldEncryptCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:115:20
             int i = 0;
             int dstPos = 0;
             int srcPos = 0;
-            while (len > 0)
+            while (len < 0)
             {
                 for (i = 0; i < 16; i++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.ChaChaTests.Encrypt_ShouldEncryptCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:117:29
             int srcPos = 0;
             while (len > 0)
             {
-                for (i = 0; i < 16; i++)
+                for (i = 0; i <= 16; i++)
                 {
                     x[i] = ctx[i];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:117:37
             int srcPos = 0;
             while (len > 0)
             {
-                for (i = 0; i < 16; i++)
+                for (i = 0; i < 16; i--)
                 {
                     x[i] = ctx[i];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Survived] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:118:17
             while (len > 0)
             {
                 for (i = 0; i < 16; i++)
-                {
-                    x[i] = ctx[i];
-                }
+                {}
                 GetRounds(x);
                 for (i = 0; i < 16; i++)

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:121:17
                 {
                     x[i] = ctx[i];
                 }
-                GetRounds(x);
+                ;
                 for (i = 0; i < 16; i++)
                 {

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:122:29
                     x[i] = ctx[i];
                 }
                 GetRounds(x);
-                for (i = 0; i < 16; i++)
+                for (i = 0; i <= 16; i++)
                 {
                     x[i] += ctx[i];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:122:37
                     x[i] = ctx[i];
                 }
                 GetRounds(x);
-                for (i = 0; i < 16; i++)
+                for (i = 0; i < 16; i--)
                 {
                     x[i] += ctx[i];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:124:21
                 GetRounds(x);
                 for (i = 0; i < 16; i++)
                 {
-                    x[i] += ctx[i];
+                    x[i] -= ctx[i];
                 }
                 for (i = 0; i < 16; i++)

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:126:29
                 {
                     x[i] += ctx[i];
                 }
-                for (i = 0; i < 16; i++)
+                for (i = 0; i <= 16; i++)
                 {
                     Store32(buf, i * 4, x[i]);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:126:37
                 {
                     x[i] += ctx[i];
                 }
-                for (i = 0; i < 16; i++)
+                for (i = 0; i < 16; i--)
                 {
                     Store32(buf, i * 4, x[i]);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:128:21
                 }
                 for (i = 0; i < 16; i++)
                 {
-                    Store32(buf, i * 4, x[i]);
+                    ;
                 }
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.ChaChaTests.Encrypt_ShouldEncryptCorrectly

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:128:34
                 }
                 for (i = 0; i < 16; i++)
                 {
-                    Store32(buf, i * 4, x[i]);
+                    Store32(buf, i / 4, x[i]);
                 }
 

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:132:17
                 }
 
                 // nonce
-                ctx[12] += 1;
+                ctx[12] -= 1;
                 if (ctx[12] == 0)
                 {

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:133:21
 
                 // nonce
                 ctx[12] += 1;
-                if (ctx[12] == 0)
+                if (ctx[12] != 0)
                 {
                     ctx[13] += 1;

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:135:21
                 ctx[12] += 1;
                 if (ctx[12] == 0)
                 {
-                    ctx[13] += 1;
+                    ctx[13] -= 1;
                 }
 

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:138:21
                     ctx[13] += 1;
                 }
 
-                if (len < 64)
+                if (len > 64)
                 {
                     break;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:138:21
                     ctx[13] += 1;
                 }
 
-                if (len < 64)
+                if (!(len < 64))
                 {
                     break;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.ChaChaTests.Encrypt_ShouldEncryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:140:21
 
                 if (len < 64)
                 {
-                    break;
+                    ;
                 }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:143:37
                     break;
                 }
 
-                for (i = 0; i < 64; i++)
+                for (i = 0; i < 64; i--)
                 {
                     dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:143:29
                     break;
                 }
 
-                for (i = 0; i < 64; i++)
+                for (i = 0; i <= 64; i++)
                 {
                     dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:145:25
 
                 for (i = 0; i < 64; i++)
                 {
-                    dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
+                    dst[i - dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
                 }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:145:50
 
                 for (i = 0; i < 64; i++)
                 {
-                    dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
+                    dst[i + dstPos] = (byte)(src[i - srcPos] ^ buf[i]);
                 }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] SubtractAssignmentExpression to AddAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:148:17
                     dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
                 }
 
-                len -= 64;
+                len += 64;
                 srcPos += 64;
                 dstPos += 64;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:149:17
                 }
 
                 len -= 64;
-                srcPos += 64;
+                srcPos -= 64;
                 dstPos += 64;
             }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:150:17
 
                 len -= 64;
                 srcPos += 64;
-                dstPos += 64;
+                dstPos -= 64;
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:156:34
             // left over bytes
             // This should never happen.  The plain text should be right padded
             // with dummy characters.  The last byte is the padding length.
-            for (i = 0; i < len; i++)
+            for (i = 0; i < len; i--)
             {
                 dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:156:25
             // left over bytes
             // This should never happen.  The plain text should be right padded
             // with dummy characters.  The last byte is the padding length.
-            for (i = 0; i < len; i++)
+            for (i = 0; i > len; i++)
             {
                 dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:170:29
         /// <param name="state">uint[]</param>
         public void GetRounds(uint[] state)
         {
-            for (var i = 0; i < 10; i++)
+            for (var i = 0; i > 10; i++)
             {
                 // The compiler generates better code with references.
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.ChaChaTests.GetRounds_ShouldApplyRoundsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.GetRounds_PerformsCorrectNumberOfRounds
