[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:170:29
         /// <param name="state">uint[]</param>
         public void GetRounds(uint[] state)
         {
-            for (var i = 0; i < 10; i++)
+            for (var i = 0; i <= 10; i++)
             {
                 // The compiler generates better code with references.

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:173:17
             for (var i = 0; i < 10; i++)
             {
                 // The compiler generates better code with references.
-                Round(ref state[0], ref state[4], ref state[8], ref state[12]);
+                ;
                 Round(ref state[1], ref state[5], ref state[9], ref state[13]);
                 Round(ref state[2], ref state[6], ref state[10], ref state[14]);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:174:17
             {
                 // The compiler generates better code with references.
                 Round(ref state[0], ref state[4], ref state[8], ref state[12]);
-                Round(ref state[1], ref state[5], ref state[9], ref state[13]);
+                ;
                 Round(ref state[2], ref state[6], ref state[10], ref state[14]);
                 Round(ref state[3], ref state[7], ref state[11], ref state[15]);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:175:17
                 // The compiler generates better code with references.
                 Round(ref state[0], ref state[4], ref state[8], ref state[12]);
                 Round(ref state[1], ref state[5], ref state[9], ref state[13]);
-                Round(ref state[2], ref state[6], ref state[10], ref state[14]);
+                ;
                 Round(ref state[3], ref state[7], ref state[11], ref state[15]);
                 Round(ref state[0], ref state[5], ref state[10], ref state[15]);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:176:17
                 Round(ref state[0], ref state[4], ref state[8], ref state[12]);
                 Round(ref state[1], ref state[5], ref state[9], ref state[13]);
                 Round(ref state[2], ref state[6], ref state[10], ref state[14]);
-                Round(ref state[3], ref state[7], ref state[11], ref state[15]);
+                ;
                 Round(ref state[0], ref state[5], ref state[10], ref state[15]);
                 Round(ref state[1], ref state[6], ref state[11], ref state[12]);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:177:17
                 Round(ref state[1], ref state[5], ref state[9], ref state[13]);
                 Round(ref state[2], ref state[6], ref state[10], ref state[14]);
                 Round(ref state[3], ref state[7], ref state[11], ref state[15]);
-                Round(ref state[0], ref state[5], ref state[10], ref state[15]);
+                ;
                 Round(ref state[1], ref state[6], ref state[11], ref state[12]);
                 Round(ref state[2], ref state[7], ref state[8], ref state[13]);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:178:17
                 Round(ref state[2], ref state[6], ref state[10], ref state[14]);
                 Round(ref state[3], ref state[7], ref state[11], ref state[15]);
                 Round(ref state[0], ref state[5], ref state[10], ref state[15]);
-                Round(ref state[1], ref state[6], ref state[11], ref state[12]);
+                ;
                 Round(ref state[2], ref state[7], ref state[8], ref state[13]);
                 Round(ref state[3], ref state[4], ref state[9], ref state[14]);

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:179:17
                 Round(ref state[3], ref state[7], ref state[11], ref state[15]);
                 Round(ref state[0], ref state[5], ref state[10], ref state[15]);
                 Round(ref state[1], ref state[6], ref state[11], ref state[12]);
-                Round(ref state[2], ref state[7], ref state[8], ref state[13]);
+                ;
                 Round(ref state[3], ref state[4], ref state[9], ref state[14]);
             }

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:180:17
                 Round(ref state[0], ref state[5], ref state[10], ref state[15]);
                 Round(ref state[1], ref state[6], ref state[11], ref state[12]);
                 Round(ref state[2], ref state[7], ref state[8], ref state[13]);
-                Round(ref state[3], ref state[4], ref state[9], ref state[14]);
+                ;
             }
         }

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:196:13
         public void Round(ref uint a, ref uint b, ref uint c, ref uint d)
         {
             // The compiler generates better code with references.
-            a += b;
+            a -= b;
             d = RotateLeft(d ^ a, 16);
             c += d;

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:198:13
             // The compiler generates better code with references.
             a += b;
             d = RotateLeft(d ^ a, 16);
-            c += d;
+            c -= d;
             b = RotateLeft(b ^ c, 12);
             a += b;

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:200:13
             d = RotateLeft(d ^ a, 16);
             c += d;
             b = RotateLeft(b ^ c, 12);
-            a += b;
+            a -= b;
             d = RotateLeft(d ^ a, 8);
             c += d;

[Survived] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:202:13
             b = RotateLeft(b ^ c, 12);
             a += b;
             d = RotateLeft(d ^ a, 8);
-            c += d;
+            c -= d;
             b = RotateLeft(b ^ c, 7);
         }

[Killed] Bitwise mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:209:21
         // Rotate value left by count bits.
         public uint RotateLeft(uint value, int count)
         {
-            return (value << count) | (value >> (32 - count));
+            return (value >> count) | (value >> (32 - count));
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.RotateLeft_ShouldRotateCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.ChaChaTests.RotateLeft_ShouldRotateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:209:50
         // Rotate value left by count bits.
         public uint RotateLeft(uint value, int count)
         {
-            return (value << count) | (value >> (32 - count));
+            return (value << count) | (value >> (32 + count));
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.ChaChaTests.RotateLeft_ShouldRotateCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:231:29
             result[14] = Load32(nonce, 0);
             result[15] = Load32(nonce, 4);
 
-            for (var i = 0; i < 8; i++)
+            for (var i = 0; i <= 8; i++)
             {
                 result[i + 4] = Load32(key, i * 4);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Init_ShouldInitializeStateCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:231:36
             result[14] = Load32(nonce, 0);
             result[15] = Load32(nonce, 4);
 
-            for (var i = 0; i < 8; i++)
+            for (var i = 0; i < 8; i--)
             {
                 result[i + 4] = Load32(key, i * 4);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Init_ShouldInitializeStateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:233:24
 
             for (var i = 0; i < 8; i++)
             {
-                result[i + 4] = Load32(key, i * 4);
+                result[i - 4] = Load32(key, i * 4);
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Encrypt_ShouldEncryptAndDecryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Init_ShouldInitializeStateCorrectly

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:233:45
 
             for (var i = 0; i < 8; i++)
             {
-                result[i + 4] = Load32(key, i * 4);
+                result[i + 4] = Load32(key, i / 4);
             }
 

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:245:9
         /// <param name="plainText">string</param>
         /// <returns>string</returns>
         public static string Base64Encode(string plainText)
-        {
-            var plainTextBytes = System.Text.Encoding.UTF8.GetBytes(plainText);
-            return System.Convert.ToBase64String(plainTextBytes);
-        }
+        {}
 
         /// <summary>
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Base64Encode_ShouldEncodeCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.ChaChaTests.Base64Encode_ShouldEncodeCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.ChaChaTests.Base64Encode_Decode_ShouldReturnOriginalString

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:256:9
         /// <param name="base64EncodedData">string</param>
         /// <returns>string</returns>
         public static string Base64Decode(string base64EncodedData)
-        {
-            var base64EncodedBytes = System.Convert.FromBase64String(base64EncodedData);
-            return System.Text.Encoding.UTF8.GetString(base64EncodedBytes);
-        }
+        {}
 }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.ChaChaTests.Base64Decode_ShouldDecodeCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.ChaChaTests.Base64Decode_ShouldDecodeCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.ChaChaTests.Base64Encode_And_Decode_ShouldWorkCorrectly
