[Killed] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:30:24
         switch (num)
         {
             case 1:
-                return "A";
+                return "";
             case 11:
                 return "J";
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.ConvertValue_ReturnsCorrectValue; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.CheckStraightTests.ConvertValue_ShouldConvertCorrectly_WhenGivenNumber; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.ConvertValue_ValidInput_ReturnsCorrectValue

[Killed] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:32:24
             case 1:
                 return "A";
             case 11:
-                return "J";
+                return "";
             case 12:
                 return "Q";
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.ConvertValue_ValidInput_ReturnsCorrectValue; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:47:13
         int currentValue = 0, endValue = 0;
 
         // Check if there's an ace (can be the lowest or highest).
-        if (SearchCardValue("A", cardHand))
+        if (!(SearchCardValue("A", cardHand)))
         {
             if (SearchCardValue("2", cardHand))
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CheckStraightTests.CheckForStraight_IdentifiesStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAceAndKingConsecutiveCards

[Killed] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:47:29
         int currentValue = 0, endValue = 0;
 
         // Check if there's an ace (can be the lowest or highest).
-        if (SearchCardValue("A", cardHand))
+        if (SearchCardValue("", cardHand))
         {
             if (SearchCardValue("2", cardHand))
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CheckStraightTests.CheckForStraight_IdentifiesStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAceAndKingConsecutiveCards

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:49:17
         // Check if there's an ace (can be the lowest or highest).
         if (SearchCardValue("A", cardHand))
         {
-            if (SearchCardValue("2", cardHand))
+            if (!(SearchCardValue("2", cardHand)))
             {
                 // A and 2 are in the hand.
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue

[Killed] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:49:33
         // Check if there's an ace (can be the lowest or highest).
         if (SearchCardValue("A", cardHand))
         {
-            if (SearchCardValue("2", cardHand))
+            if (SearchCardValue("", cardHand))
             {
                 // A and 2 are in the hand.
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:50:13
         if (SearchCardValue("A", cardHand))
         {
             if (SearchCardValue("2", cardHand))
-            {
-                // A and 2 are in the hand.
-                currentValue = 3;
-                endValue = 5;
-            }
+            {}
             else if (SearchCardValue("K", cardHand))
             {
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.CheckStraightTests.CheckForStraight_ShouldReturnTrue_WhenStraightWithAceExists

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:55:22
                 currentValue = 3;
                 endValue = 5;
             }
-            else if (SearchCardValue("K", cardHand))
+            else if (!(SearchCardValue("K", cardHand)))
             {
                 // A and K are in the hand.
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:56:13
                 endValue = 5;
             }
             else if (SearchCardValue("K", cardHand))
-            {
-                // A and K are in the hand.
-                currentValue = 10;
-                endValue = 12;
-            }
+            {}
             else
             {
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:64:24
             else
             {
                 // Since ace has no consecutive card value, it is automatically not a straight.
-                return false;
+                return true;
             }
         }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsFalse_WhenHandContainsAceButNoConsecutiveCards

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:70:29
         else
         {
             // If there's no ace, search for the lowest card value.
-            for (int i = 2; i <= 13; i++)
+            for (int i = 2; i > 13; i++)
             {
                 if (SearchCardValue(ConvertValue(i), cardHand))
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:70:38
         else
         {
             // If there's no ace, search for the lowest card value.
-            for (int i = 2; i <= 13; i++)
+            for (int i = 2; i <= 13; i--)
             {
                 if (SearchCardValue(ConvertValue(i), cardHand))

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:72:21
             // If there's no ace, search for the lowest card value.
             for (int i = 2; i <= 13; i++)
             {
-                if (SearchCardValue(ConvertValue(i), cardHand))
+                if (!(SearchCardValue(ConvertValue(i), cardHand)))
                 {
                     currentValue = i + 1;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAnotherStraight; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.CheckStraightTests.CheckForStraight_BasicStraight_ReturnsTrue; UnitTestGeneration.Difficult.Tests.Gemini.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrueForStraight

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:74:36
             {
                 if (SearchCardValue(ConvertValue(i), cardHand))
                 {
-                    currentValue = i + 1;
+                    currentValue = i - 1;
                     endValue = i + 4;
                     break;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAnotherStraight; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.CheckStraightTests.CheckForStraight_BasicStraight_ReturnsTrue; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:75:32
                 if (SearchCardValue(ConvertValue(i), cardHand))
                 {
                     currentValue = i + 1;
-                    endValue = i + 4;
+                    endValue = i - 4;
                     break;
                 }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_NonStraightHand_ReturnsFalse

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:76:21
                 {
                     currentValue = i + 1;
                     endValue = i + 4;
-                    break;
+                    ;
                 }
             }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_StraightHand_ReturnsTrue

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:81:51
             }
         }
 
-        for (int i = currentValue; i <= endValue; i++)
+        for (int i = currentValue; i <= endValue; i--)
         {
             if (!SearchCardValue(ConvertValue(i), cardHand)) return false;
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CheckStraightTests.CheckForStraight_IdentifiesStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAceAndKingConsecutiveCards

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:81:36
             }
         }
 
-        for (int i = currentValue; i <= endValue; i++)
+        for (int i = currentValue; i > endValue; i++)
         {
             if (!SearchCardValue(ConvertValue(i), cardHand)) return false;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_NonStraightHand_ReturnsFalse

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:83:17
 
         for (int i = currentValue; i <= endValue; i++)
         {
-            if (!SearchCardValue(ConvertValue(i), cardHand)) return false;
+            if (SearchCardValue(ConvertValue(i), cardHand)) return false;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CheckStraightTests.CheckForStraight_IdentifiesStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsTrue_WhenHandContainsAceAndKingConsecutiveCards

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:83:69
 
         for (int i = currentValue; i <= endValue; i++)
         {
-            if (!SearchCardValue(ConvertValue(i), cardHand)) return false;
+            if (!SearchCardValue(ConvertValue(i), cardHand)) return true;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.CheckStraightTests.CheckForStraight_IdentifiesNonStraight; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsFalse_WhenHandDoesNotContainAStraight; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.CheckStraightTests.CheckForStraight_ShouldReturnFalse_WhenHandDoesNotContainStraight

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:91:39
     
     public static bool SearchCardValue(string value, Card[] cardHand)
     {
-        return cardHand.Count(card => card.CardValue == value) > 0;
+        return cardHand.Count(card => card.CardValue != value) > 0;
     }
 }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.SearchCardValue_ReturnsFalse_WhenValueIsNotPresent; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsFalse_WhenHandContainsAceButNoConsecutiveCards; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.CheckStraightTests.CheckForStraight_ReturnsFalse_WhenHandDoesNotContainAStraight

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/CheckStraight.cs:91:16
     
     public static bool SearchCardValue(string value, Card[] cardHand)
     {
-        return cardHand.Count(card => card.CardValue == value) > 0;
+        return cardHand.Count(card => card.CardValue == value) >= 0;
     }
 }
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.CheckStraightTests.CheckForStraight_ShouldReturnFalse_WhenHandDoesNotContainStraight; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.CheckStraightTests.SearchCardValue_ShouldReturnFalse_WhenValueDoesNotExistInHand; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.CheckStraightTests.CheckForStraight_NonStraightHand_ReturnsFalse
