[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:12:44
 
     public static int FindMinDistance(int[] dist,bool[] sptSet)
     {
-        int min = int.MaxValue, minIndex = -1;
+        int min = int.MaxValue, minIndex = +1;
 
         for (int v = 0; v < vertexQuantity; v++)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_NoUnvisitedVertices_ReturnsNegativeOne

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:14:25
     {
         int min = int.MaxValue, minIndex = -1;
 
-        for (int v = 0; v < vertexQuantity; v++)
+        for (int v = 0; v <= vertexQuantity; v++)
             if (sptSet[v] == false && dist[v] <= min)
             {
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_SomeUnvisitedVertices_ReturnsMinimumDistanceVertex; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_NoUnvisitedVertices_ReturnsNegativeOne

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:14:45
     {
         int min = int.MaxValue, minIndex = -1;
 
-        for (int v = 0; v < vertexQuantity; v++)
+        for (int v = 0; v < vertexQuantity; v--)
             if (sptSet[v] == false && dist[v] <= min)
             {
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_SomeUnvisitedVertices_ReturnsMinimumDistanceVertex; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_NoUnvisitedVertices_ReturnsNegativeOne

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:15:39
         int min = int.MaxValue, minIndex = -1;
 
         for (int v = 0; v < vertexQuantity; v++)
-            if (sptSet[v] == false && dist[v] <= min)
+            if (sptSet[v] == false && dist[v] > min)
             {
                 min = dist[v];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_SomeUnvisitedVertices_ReturnsMinimumDistanceVertex; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.DijkstraTests.UseDijkstraAlgorithm_ShouldFindShortestPaths_ForGivenGraph

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:15:30
         int min = int.MaxValue, minIndex = -1;
 
         for (int v = 0; v < vertexQuantity; v++)
-            if (sptSet[v] == false && dist[v] <= min)
+            if (sptSet[v] == true && dist[v] <= min)
             {
                 min = dist[v];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_SomeUnvisitedVertices_ReturnsMinimumDistanceVertex; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_NoUnvisitedVertices_ReturnsNegativeOne; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:16:13
 
         for (int v = 0; v < vertexQuantity; v++)
             if (sptSet[v] == false && dist[v] <= min)
-            {
-                min = dist[v];
-                minIndex = v;
-            }
+            {}
 
         return minIndex;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_SomeUnvisitedVertices_ReturnsMinimumDistanceVertex

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:27:9
     public static void PrintSolution(int[] dist, int n)
     {
         Console.ForegroundColor = ConsoleColor.Cyan;
-        Console.WriteLine("Rezultat zastosowania Algorytmu Dijkistry:");
+        ;
         Console.Write("Wierzchołek     Odległość "
                       + "od korzenia\n");
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:28:9
     {
         Console.ForegroundColor = ConsoleColor.Cyan;
         Console.WriteLine("Rezultat zastosowania Algorytmu Dijkistry:");
-        Console.Write("Wierzchołek     Odległość "
-                      + "od korzenia\n");
+        ;
         for (int i = 0; i < vertexQuantity; i++)
             Console.Write(i + " \t\t " + dist[i] + "\n");
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:28:23
     {
         Console.ForegroundColor = ConsoleColor.Cyan;
         Console.WriteLine("Rezultat zastosowania Algorytmu Dijkistry:");
-        Console.Write("Wierzchołek     Odległość "
+        Console.Write(""
                       + "od korzenia\n");
         for (int i = 0; i < vertexQuantity; i++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:29:25
         Console.ForegroundColor = ConsoleColor.Cyan;
         Console.WriteLine("Rezultat zastosowania Algorytmu Dijkistry:");
         Console.Write("Wierzchołek     Odległość "
-                      + "od korzenia\n");
+                      + "");
         for (int i = 0; i < vertexQuantity; i++)
             Console.Write(i + " \t\t " + dist[i] + "\n");
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:30:25
         Console.WriteLine("Rezultat zastosowania Algorytmu Dijkistry:");
         Console.Write("Wierzchołek     Odległość "
                       + "od korzenia\n");
-        for (int i = 0; i < vertexQuantity; i++)
+        for (int i = 0; i <= vertexQuantity; i++)
             Console.Write(i + " \t\t " + dist[i] + "\n");
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:30:25
         Console.WriteLine("Rezultat zastosowania Algorytmu Dijkistry:");
         Console.Write("Wierzchołek     Odległość "
                       + "od korzenia\n");
-        for (int i = 0; i < vertexQuantity; i++)
+        for (int i = 0; i > vertexQuantity; i++)
             Console.Write(i + " \t\t " + dist[i] + "\n");
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:31:13
         Console.Write("Wierzchołek     Odległość "
                       + "od korzenia\n");
         for (int i = 0; i < vertexQuantity; i++)
-            Console.Write(i + " \t\t " + dist[i] + "\n");
+            ;
 
         Console.ForegroundColor = ConsoleColor.Gray;
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:41:25
         int[] dist = new int[vertexQuantity]; 
         bool[] sptSet = new bool[vertexQuantity];
 
-        for (int i = 0; i < vertexQuantity; i++)
+        for (int i = 0; i > vertexQuantity; i++)
         {
             dist[i] = int.MaxValue;
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:41:45
         int[] dist = new int[vertexQuantity]; 
         bool[] sptSet = new bool[vertexQuantity];
 
-        for (int i = 0; i < vertexQuantity; i++)
+        for (int i = 0; i < vertexQuantity; i--)
         {
             dist[i] = int.MaxValue;
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.DijkstraTests.UseDijkstraAlgorithm_ShouldFindShortestPaths_ForGivenGraph

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:44:25
         for (int i = 0; i < vertexQuantity; i++)
         {
             dist[i] = int.MaxValue;
-            sptSet[i] = false;
+            sptSet[i] = true;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.DijkstraTests.UseDijkstraAlgorithm_ShouldFindShortestPaths_ForGivenGraph

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:49:29
 
         dist[src] = 0;
 
-        for (int count = 0; count < vertexQuantity - 1; count++)
+        for (int count = 0; count > vertexQuantity - 1; count++)
         {
             int u = FindMinDistance(dist, sptSet);
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:49:57
 
         dist[src] = 0;
 
-        for (int count = 0; count < vertexQuantity - 1; count++)
+        for (int count = 0; count < vertexQuantity - 1; count--)
         {
             int u = FindMinDistance(dist, sptSet);
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.DijkstraTests.UseDijkstraAlgorithm_ShouldFindShortestPaths_ForGivenGraph

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:53:25
         {
             int u = FindMinDistance(dist, sptSet);
 
-            sptSet[u] = true;
+            sptSet[u] = false;
 
             for (int v = 0; v < vertexQuantity; v++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:55:29
 
             sptSet[u] = true;
 
-            for (int v = 0; v < vertexQuantity; v++)
+            for (int v = 0; v > vertexQuantity; v++)
                 if (!sptSet[v] && graph[u, v] != 0 &&
                      dist[u] != int.MaxValue && dist[u] + graph[u, v] < dist[v])
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:56:21
             sptSet[u] = true;
 
             for (int v = 0; v < vertexQuantity; v++)
-                if (!sptSet[v] && graph[u, v] != 0 &&
-                     dist[u] != int.MaxValue && dist[u] + graph[u, v] < dist[v])
+                if (!sptSet[v] && graph[u, v] != 0 &&
+                     dist[u] != int.MaxValue || dist[u] + graph[u, v] < dist[v])
                     dist[v] = dist[u] + graph[u, v];
         }
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:56:21
             sptSet[u] = true;
 
             for (int v = 0; v < vertexQuantity; v++)
-                if (!sptSet[v] && graph[u, v] != 0 &&
+                if (!sptSet[v] || graph[u, v] != 0 &&
                      dist[u] != int.MaxValue && dist[u] + graph[u, v] < dist[v])
                     dist[v] = dist[u] + graph[u, v];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:57:22
 
             for (int v = 0; v < vertexQuantity; v++)
                 if (!sptSet[v] && graph[u, v] != 0 &&
-                     dist[u] != int.MaxValue && dist[u] + graph[u, v] < dist[v])
+                     dist[u] == int.MaxValue && dist[u] + graph[u, v] < dist[v])
                     dist[v] = dist[u] + graph[u, v];
         }
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:57:49
 
             for (int v = 0; v < vertexQuantity; v++)
                 if (!sptSet[v] && graph[u, v] != 0 &&
-                     dist[u] != int.MaxValue && dist[u] + graph[u, v] < dist[v])
+                     dist[u] != int.MaxValue && dist[u] + graph[u, v] > dist[v])
                     dist[v] = dist[u] + graph[u, v];
         }
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:58:31
             for (int v = 0; v < vertexQuantity; v++)
                 if (!sptSet[v] && graph[u, v] != 0 &&
                      dist[u] != int.MaxValue && dist[u] + graph[u, v] < dist[v])
-                    dist[v] = dist[u] + graph[u, v];
+                    dist[v] = dist[u] - graph[u, v];
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:61:9
                     dist[v] = dist[u] + graph[u, v];
         }
 
-        PrintSolution(dist, vertexQuantity);
+        ;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:70:9
         int graphHeight = graph.GetLength(1);
 
         Console.ForegroundColor = ConsoleColor.Yellow;
-        Console.WriteLine("Algorym Dijkistry został zastosowany dla następującej macierzy:");
+        ;
         if (graphHeight > 0 && graphWidth > 0)
         {
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:71:13
 
         Console.ForegroundColor = ConsoleColor.Yellow;
         Console.WriteLine("Algorym Dijkistry został zastosowany dla następującej macierzy:");
-        if (graphHeight > 0 && graphWidth > 0)
+        if (graphHeight < 0 && graphWidth > 0)
         {
             for (int col = 0; col < graphWidth; col++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:71:13
 
         Console.ForegroundColor = ConsoleColor.Yellow;
         Console.WriteLine("Algorym Dijkistry został zastosowany dla następującej macierzy:");
-        if (graphHeight > 0 && graphWidth > 0)
+        if (!(graphHeight > 0 && graphWidth > 0))
         {
             for (int col = 0; col < graphWidth; col++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:73:31
         Console.WriteLine("Algorym Dijkistry został zastosowany dla następującej macierzy:");
         if (graphHeight > 0 && graphWidth > 0)
         {
-            for (int col = 0; col < graphWidth; col++)
+            for (int col = 0; col > graphWidth; col++)
             {
                 for (int row = 0; row < graphHeight; row++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:73:31
         Console.WriteLine("Algorym Dijkistry został zastosowany dla następującej macierzy:");
         if (graphHeight > 0 && graphWidth > 0)
         {
-            for (int col = 0; col < graphWidth; col++)
+            for (int col = 0; col <= graphWidth; col++)
             {
                 for (int row = 0; row < graphHeight; row++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:75:35
         {
             for (int col = 0; col < graphWidth; col++)
             {
-                for (int row = 0; row < graphHeight; row++)
+                for (int row = 0; row <= graphHeight; row++)
                 {
                     Console.Write($"{graph[col, row]} ");
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:75:35
         {
             for (int col = 0; col < graphWidth; col++)
             {
-                for (int row = 0; row < graphHeight; row++)
+                for (int row = 0; row > graphHeight; row++)
                 {
                     Console.Write($"{graph[col, row]} ");
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:77:21
             {
                 for (int row = 0; row < graphHeight; row++)
                 {
-                    Console.Write($"{graph[col, row]} ");
+                    ;
                 }
                 Console.Write("\n");
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:79:17
                 {
                     Console.Write($"{graph[col, row]} ");
                 }
-                Console.Write("\n");
+                ;
             }
         }

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:83:9
             }
         }
         Console.ForegroundColor = ConsoleColor.Gray;
-        Console.WriteLine("\n");
+        ;
     }
 }
