[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:13:13
 {
     public static double Dot(this double[] lhs, double[] rhs)
     {
-        if (lhs.Length != rhs.Length)
+        if (lhs.Length == rhs.Length)
         {
             throw new ArgumentException("Dot product arguments must have same dimension");
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Dot_CalculatesCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Dot_CalculatesCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Magnitude_CalculatesCorrectResult

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:15:13
     {
         if (lhs.Length != rhs.Length)
         {
-            throw new ArgumentException("Dot product arguments must have same dimension");
+            ;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Dot_DifferentLengths_ThrowsArgumentException; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Dot_ThrowsException_WhenArraysHaveDifferentLengths

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:19:25
         }
 
         double result = 0;
-        for (var i = 0; i < lhs.Length; i++)
+        for (var i = 0; i <= lhs.Length; i++)
         {
             result += lhs[i] * rhs[i];
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.EigenvalueTests.Dot_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Dot_SameVectors_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.NextVector_ReturnsNormalizedVector

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:19:25
         }
 
         double result = 0;
-        for (var i = 0; i < lhs.Length; i++)
+        for (var i = 0; i > lhs.Length; i++)
         {
             result += lhs[i] * rhs[i];
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.EigenvalueTests.Dot_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Dot_SameVectors_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.NextVector_ReturnsNormalizedVector

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:21:13
         double result = 0;
         for (var i = 0; i < lhs.Length; i++)
         {
-            result += lhs[i] * rhs[i];
+            result -= lhs[i] * rhs[i];
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.EigenvalueTests.Dot_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Dot_SameVectors_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.NextVector_ReturnsNormalizedVector

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:21:23
         double result = 0;
         for (var i = 0; i < lhs.Length; i++)
         {
-            result += lhs[i] * rhs[i];
+            result += lhs[i] / rhs[i];
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Magnitude_ShouldCalculateMagnitude_WhenGivenVector; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Dot_ShouldCalculateDotProduct_WhenGivenTwoVectors; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.NextVector_ShouldGenerateRandomNormalizedVector_WhenGivenSize

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:29:5
 
  
     public static double Magnitude(this double[] vector)
-    {
-        var magnitude = Dot(vector, vector);
-        magnitude = Math.Sqrt(magnitude);
-        return magnitude;
-    }
+    {}
     
     public static double[,] ToColumnVector(this double[] source)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.NextVector_ReturnsNormalizedVector; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Magnitude_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Magnitude_ShouldCalculateMagnitude_WhenGivenVector

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:39:25
     {
         var columnVector = new double[source.Length, 1];
 
-        for (var i = 0; i < source.Length; i++)
+        for (var i = 0; i <= source.Length; i++)
         {
             columnVector[i, 0] = source[i];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToColumnVector_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.ToColumnVector_ShouldConvertArrayToColumnVector_WhenGivenArray; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.EigenvalueTests.ToColumnVector_ValidVector_ReturnsCorrectResult

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:39:44
     {
         var columnVector = new double[source.Length, 1];
 
-        for (var i = 0; i < source.Length; i++)
+        for (var i = 0; i < source.Length; i--)
         {
             columnVector[i, 0] = source[i];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToColumnVector_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.EigenvalueTests.ToColumnVector_ValidVector_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.EigenvalueTests.ToColumnVector_ShouldConvertToColumnVectorCorrectly

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:40:9
         var columnVector = new double[source.Length, 1];
 
         for (var i = 0; i < source.Length; i++)
-        {
-            columnVector[i, 0] = source[i];
-        }
+        {}
 
         return columnVector;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToColumnVector_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.ToColumnVector_ShouldConvertArrayToColumnVector_WhenGivenArray; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.EigenvalueTests.ToColumnVector_ValidVector_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:49:13
     
     public static double[] ToRowVector(this double[,] source)
     {
-        if (source.GetLength(1) != 1)
+        if (source.GetLength(1) == 1)
         {
             throw new InvalidOperationException("The column vector should have only 1 element in width.");
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToRowVector_ColumnVectorWithOneColumn_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToRowVector_ColumnVectorWithMultipleColumns_ThrowsInvalidOperationException; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.ToRowVector_ShouldConvertColumnVectorToRowVector_WhenGivenColumnVector

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:51:13
     {
         if (source.GetLength(1) != 1)
         {
-            throw new InvalidOperationException("The column vector should have only 1 element in width.");
+            ;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToRowVector_ColumnVectorWithMultipleColumns_ThrowsInvalidOperationException; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.ToRowVector_ThrowsException_WhenColumnVectorHasMultipleColumns

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:56:25
 
         var rowVector = new double[source.Length];
 
-        for (var i = 0; i < rowVector.Length; i++)
+        for (var i = 0; i <= rowVector.Length; i++)
         {
             rowVector[i] = source[i, 0];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToRowVector_ColumnVectorWithOneColumn_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.ToRowVector_ShouldConvertColumnVectorToRowVector_WhenGivenColumnVector; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.EigenvalueTests.ToRowVector_ValidColumnVector_ReturnsCorrectResult

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:56:47
 
         var rowVector = new double[source.Length];
 
-        for (var i = 0; i < rowVector.Length; i++)
+        for (var i = 0; i < rowVector.Length; i--)
         {
             rowVector[i] = source[i, 0];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToRowVector_ColumnVectorWithOneColumn_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.EigenvalueTests.ToRowVector_ValidColumnVector_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.EigenvalueTests.ToRowVector_ShouldConvertToRowVectorCorrectly

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:57:9
         var rowVector = new double[source.Length];
 
         for (var i = 0; i < rowVector.Length; i++)
-        {
-            rowVector[i] = source[i, 0];
-        }
+        {}
 
         return rowVector;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToRowVector_ColumnVectorWithOneColumn_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.ToRowVector_ShouldConvertColumnVectorToRowVector_WhenGivenColumnVector; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.EigenvalueTests.ToRowVector_ValidColumnVector_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:67:13
     
     public static double[,] Multiply(this double[,] source, double[,] operand)
     {
-        if (source.GetLength(1) != operand.GetLength(0))
+        if (source.GetLength(1) == operand.GetLength(0))
         {
             throw new InvalidOperationException(
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_ThrowsException_WhenDimensionsMismatch; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_CalculatesCorrectResult

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:69:13
     {
         if (source.GetLength(1) != operand.GetLength(0))
         {
-            throw new InvalidOperationException(
-                "The width of a first operand should match the height of a second.");
+            ;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_ThrowsException_WhenDimensionsMismatch

[Survived] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:70:17
         if (source.GetLength(1) != operand.GetLength(0))
         {
             throw new InvalidOperationException(
-                "The width of a first operand should match the height of a second.");
+                "");
         }
 

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:75:50
 
         var result = new double[source.GetLength(0), operand.GetLength(1)];
 
-        for (var i = 0; i < result.GetLength(0); i++)
+        for (var i = 0; i < result.GetLength(0); i--)
         {
             for (var j = 0; j < result.GetLength(1); j++)
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.EigenvalueTests.Multiply_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Multiply_CompatibleMatrices_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Gemini.Prompt2.EigenvalueTests.Multiply_CalculatesMatrixProduct

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:75:25
 
         var result = new double[source.GetLength(0), operand.GetLength(1)];
 
-        for (var i = 0; i < result.GetLength(0); i++)
+        for (var i = 0; i <= result.GetLength(0); i++)
         {
             for (var j = 0; j < result.GetLength(1); j++)
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.EigenvalueTests.Multiply_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Multiply_CompatibleMatrices_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Multiply_ShouldMultiplyMatrices_WhenGivenTwoMatrices

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:77:29
 
         for (var i = 0; i < result.GetLength(0); i++)
         {
-            for (var j = 0; j < result.GetLength(1); j++)
+            for (var j = 0; j <= result.GetLength(1); j++)
             {
                 double elementProduct = 0;
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.EigenvalueTests.Multiply_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Multiply_CompatibleMatrices_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Multiply_ShouldMultiplyMatrices_WhenGivenTwoMatrices

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:77:29
 
         for (var i = 0; i < result.GetLength(0); i++)
         {
-            for (var j = 0; j < result.GetLength(1); j++)
+            for (var j = 0; j > result.GetLength(1); j++)
             {
                 double elementProduct = 0;
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.EigenvalueTests.Multiply_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Multiply_CompatibleMatrices_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Multiply_ShouldMultiplyMatrices_WhenGivenTwoMatrices

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:81:33
             {
                 double elementProduct = 0;
 
-                for (var k = 0; k < source.GetLength(1); k++)
+                for (var k = 0; k > source.GetLength(1); k++)
                 {
                     elementProduct += source[i, k] * operand[k, j];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Multiply_ShouldMultiplyMatrices_WhenGivenTwoMatrices; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_CalculatesCorrectResult

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:81:58
             {
                 double elementProduct = 0;
 
-                for (var k = 0; k < source.GetLength(1); k++)
+                for (var k = 0; k < source.GetLength(1); k--)
                 {
                     elementProduct += source[i, k] * operand[k, j];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_CalculatesCorrectResult

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:83:21
 
                 for (var k = 0; k < source.GetLength(1); k++)
                 {
-                    elementProduct += source[i, k] * operand[k, j];
+                    elementProduct -= source[i, k] * operand[k, j];
                 }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_CalculatesCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:83:39
 
                 for (var k = 0; k < source.GetLength(1); k++)
                 {
-                    elementProduct += source[i, k] * operand[k, j];
+                    elementProduct += source[i, k] / operand[k, j];
                 }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_CalculatesCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:98:13
         double[] startVector,
         double error = 0.00001)
     {
-        if (source.GetLength(0) != source.GetLength(1))
+        if (source.GetLength(0) == source.GetLength(1))
         {
             throw new ArgumentException("The source matrix is not square-shaped.");
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Dominant_ThrowsException_WhenMatrixIsNotSquare

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:100:13
     {
         if (source.GetLength(0) != source.GetLength(1))
         {
-            throw new ArgumentException("The source matrix is not square-shaped.");
+            ;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Dominant_ThrowsException_WhenMatrixIsNotSquare

[Survived] String mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:100:41
     {
         if (source.GetLength(0) != source.GetLength(1))
         {
-            throw new ArgumentException("The source matrix is not square-shaped.");
+            throw new ArgumentException("");
         }
 

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:103:13
             throw new ArgumentException("The source matrix is not square-shaped.");
         }
 
-        if (source.GetLength(0) != startVector.Length)
+        if (source.GetLength(0) == startVector.Length)
         {
             throw new ArgumentException(
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Dominant_StartVectorLengthMismatch_ThrowsArgumentException; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Dominant_ThrowsException_WhenStartVectorLengthDoesNotMatchMatrixSize

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:105:13
 
         if (source.GetLength(0) != startVector.Length)
         {
-            throw new ArgumentException(
-                "The length of the start vector doesn't equal the size of the source matrix.");
+            ;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Dominant_StartVectorLengthMismatch_ThrowsArgumentException; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.EigenvalueTests.Dominant_StartVectorWithWrongLength_ThrowsArgumentException; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Dominant_ThrowsException_WhenStartVectorLengthDoesNotMatchMatrixSize

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:121:65
                 .ToRowVector();
 
             eigenNorm = currentEigenVector.Magnitude();
-            currentEigenVector = currentEigenVector.Select(x => x / eigenNorm).ToArray();
+            currentEigenVector = currentEigenVector.Select(x => x * eigenNorm).ToArray();
         }
         while (Math.Abs(currentEigenVector.Dot(previousEigenVector)) < 1.0 - error);

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:123:72
             eigenNorm = currentEigenVector.Magnitude();
             currentEigenVector = currentEigenVector.Select(x => x / eigenNorm).ToArray();
         }
-        while (Math.Abs(currentEigenVector.Dot(previousEigenVector)) < 1.0 - error);
+        while (Math.Abs(currentEigenVector.Dot(previousEigenVector)) < 1.0 + error);
 
         var eigenvalue = source.Multiply(currentEigenVector.ToColumnVector()).ToRowVector().Magnitude();

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:139:35
         var vector = Enumerable.Range(0, size)
             .Select(_ => rand.NextDouble()).ToArray();
         var norm = vector.Magnitude();
-        return vector.Select(x => x / norm).ToArray();
+        return vector.Select(x => x * norm).ToArray();
     }
 }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.NextVector_ReturnsNormalizedVector; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.NextVector_ShouldGenerateRandomNormalizedVector_WhenGivenSize; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.NextVector_GeneratesNormalizedRandomVector
