[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:14:29
         // Is p prime?
         public static bool IsPrime(long p)
         {
-            for (int i = 2; i <= Math.Sqrt(p); i++)
+            for (int i = 2; i > Math.Sqrt(p); i++)
             {
                 if (p % i == 0)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:14:29
         // Is p prime?
         public static bool IsPrime(long p)
         {
-            for (int i = 2; i <= Math.Sqrt(p); i++)
+            for (int i = 2; i < Math.Sqrt(p); i++)
             {
                 if (p % i == 0)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:16:21
         {
             for (int i = 2; i <= Math.Sqrt(p); i++)
             {
-                if (p % i == 0)
+                if (p * i == 0)
                     return false;
             }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:16:21
         {
             for (int i = 2; i <= Math.Sqrt(p); i++)
             {
-                if (p % i == 0)
+                if (p % i != 0)
                     return false;
             }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:17:28
             for (int i = 2; i <= Math.Sqrt(p); i++)
             {
                 if (p % i == 0)
-                    return false;
+                    return true;
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.IsPrime_NonPrimeNumbers_ReturnsFalse

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:25:20
 
         public static bool CheckPrimes(long p, long q)
         {
-            return p != q && IsPrime(p) && IsPrime(q);
+            return p != q && IsPrime(p) || IsPrime(q);
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.CheckPrimes_InvalidPrimes_ReturnsFalse; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.SimpleRSATests.CheckPrimes_ShouldReturnCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.SimpleRSATests.CheckPrimes_ShouldReturnCorrectResult

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:25:20
 
         public static bool CheckPrimes(long p, long q)
         {
-            return p != q && IsPrime(p) && IsPrime(q);
+            return p != q || IsPrime(p) && IsPrime(q);
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.CheckPrimes_InvalidPrimes_ReturnsFalse

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:34:28
             const int maxLength = 40;
             List<long> list = new List<long>();
 
-            long totient = (p - 1) * (q - 1);
+            long totient = (p - 1) / (q - 1);
 
             for (long i = 2; i < totient; i++)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:34:29
             const int maxLength = 40;
             List<long> list = new List<long>();
 
-            long totient = (p - 1) * (q - 1);
+            long totient = (p + 1) * (q - 1);
 
             for (long i = 2; i < totient; i++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SimpleRSATests.GetPrimes_ShouldReturnArrayOfPrimes

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:36:43
 
             long totient = (p - 1) * (q - 1);
 
-            for (long i = 2; i < totient; i++)
+            for (long i = 2; i < totient; i--)
             {
                 if (totient % i == 0)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:36:30
 
             long totient = (p - 1) * (q - 1);
 
-            for (long i = 2; i < totient; i++)
+            for (long i = 2; i > totient; i++)
             {
                 if (totient % i == 0)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Timeout] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:38:21
 
             for (long i = 2; i < totient; i++)
             {
-                if (totient % i == 0)
+                if (totient % i != 0)
                     continue;
 

[Timeout] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:38:21
 
             for (long i = 2; i < totient; i++)
             {
-                if (totient % i == 0)
+                if (totient * i == 0)
                     continue;
 

[Timeout] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:39:21
             for (long i = 2; i < totient; i++)
             {
                 if (totient % i == 0)
-                    continue;
+                    ;
 
                 if (IsPrime(i) && i != p && i != q)

[Timeout] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:41:21
                 if (totient % i == 0)
                     continue;
 
-                if (IsPrime(i) && i != p && i != q)
+                if (IsPrime(i) || i != p && i != q)
                 {
                     long exp = GetDecryptExp(i, totient);

[Timeout] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:41:21
                 if (totient % i == 0)
                     continue;
 
-                if (IsPrime(i) && i != p && i != q)
+                if (!(IsPrime(i) && i != p && i != q))
                 {
                     long exp = GetDecryptExp(i, totient);

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:44:25
                 if (IsPrime(i) && i != p && i != q)
                 {
                     long exp = GetDecryptExp(i, totient);
-                    if (exp > 0)
+                    if (!(exp > 0))
                     {
                         list.Add(i);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:44:25
                 if (IsPrime(i) && i != p && i != q)
                 {
                     long exp = GetDecryptExp(i, totient);
-                    if (exp > 0)
+                    if (exp < 0)
                     {
                         list.Add(i);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:46:25
                     long exp = GetDecryptExp(i, totient);
                     if (exp > 0)
                     {
-                        list.Add(i);
+                        ;
                         list.Add(exp);
                     }

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:47:25
                     if (exp > 0)
                     {
                         list.Add(i);
-                        list.Add(exp);
+                        ;
                     }
 

[Survived] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:50:25
                         list.Add(exp);
                     }
 
-                    if (list.Count > maxLength - 1)
+                    if (!(list.Count > maxLength - 1))
                         break;
                 }

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:50:38
                         list.Add(exp);
                     }
 
-                    if (list.Count > maxLength - 1)
+                    if (list.Count > maxLength + 1)
                         break;
                 }

[Survived] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:51:25
                     }
 
                     if (list.Count > maxLength - 1)
-                        break;
+                        ;
                 }
             }

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:61:39
         // Get the encryption exponent (e).
         public static long GetEncryptExp(long p, long q)
         {
-            long totient = (p - 1) * (q - 1);
+            long totient = (p - 1) * (q + 1);
             for (long i = 2; i < totient; i++)
             {
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.SimpleRSATests.GetEncryptExp_ShouldReturnCorrectEncryptionExponent; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.GetEncryptExp_ValidInput_ReturnsCorrectExponent

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:61:28
         // Get the encryption exponent (e).
         public static long GetEncryptExp(long p, long q)
         {
-            long totient = (p - 1) * (q - 1);
+            long totient = (p - 1) / (q - 1);
             for (long i = 2; i < totient; i++)
             {
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetEncryptExp_ValidPrimes_ReturnsCorrectEncryptionExponent; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetEncryptExp_ValidPrimes_ReturnsCorrectEncryptionExponent

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:62:43
         public static long GetEncryptExp(long p, long q)
         {
             long totient = (p - 1) * (q - 1);
-            for (long i = 2; i < totient; i++)
+            for (long i = 2; i < totient; i--)
             {
                 if (totient % i == 0)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SimpleRSATests.GetEncryptExp_ShouldReturnEncryptionExponent; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.SimpleRSATests.GetEncryptExp_ShouldReturnCorrectEncryptionExponent; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.GetEncryptExp_ValidInput_ReturnsCorrectExponent

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:62:30
         public static long GetEncryptExp(long p, long q)
         {
             long totient = (p - 1) * (q - 1);
-            for (long i = 2; i < totient; i++)
+            for (long i = 2; i > totient; i++)
             {
                 if (totient % i == 0)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetEncryptExp_ValidPrimes_ReturnsCorrectEncryptionExponent; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetEncryptExp_ValidPrimes_ReturnsCorrectEncryptionExponent

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:67:21
                 if (totient % i == 0)
                     continue;
 
-                if (IsPrime(i) && i != p && i != q)
+                if (IsPrime(i) && i != p || i != q)
                 {
                     long exp = GetDecryptExp(i, totient);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.SimpleRSATests.GetEncryptExp_ShouldReturnCorrectEncryptionExponent

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:82:20
         public static long GetDecryptExp(long x, long t)
         {
             long k = 1;
-            while (true)
+            while (false)
             {
                 k = k + t;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:82:20
         public static long GetDecryptExp(long x, long t)
         {
             long k = 1;
-            while (true)
+            while (!(true))
             {
                 k = k + t;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:84:21
             long k = 1;
             while (true)
             {
-                k = k + t;
+                k = k - t;
                 if (k % x == 0)
                     return k / x;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:85:21
             while (true)
             {
                 k = k + t;
-                if (k % x == 0)
+                if (k % x != 0)
                     return k / x;
             }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.DecryptTwo_ValidInput_ReturnsDecryptedText

[Timeout] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:85:21
             while (true)
             {
                 k = k + t;
-                if (k % x == 0)
+                if (k * x == 0)
                     return k / x;
             }

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:86:28
             {
                 k = k + t;
                 if (k % x == 0)
-                    return k / x;
+                    return k * x;
             }
         }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.DecryptTwo_ValidInput_ReturnsDecryptedText; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SimpleRSATests.GetPrimes_ShouldReturnArrayOfPrimes

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:97:29
             // encrypted 
             long[] en = new long[len];
 
-            for (int i = 0; i < msg.Length; i++)
+            for (int i = 0; i <= msg.Length; i++)
             {
                 // plain text
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Encrypt_ValidInput_ReturnsEncryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Encrypt_ValidInput_ReturnsEncryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Encrypt_ValidInput_ReturnsEncryptedText

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:97:45
             // encrypted 
             long[] en = new long[len];
 
-            for (int i = 0; i < msg.Length; i++)
+            for (int i = 0; i < msg.Length; i--)
             {
                 // plain text
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Encrypt_ValidInput_ReturnsEncryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Encrypt_ValidInput_ReturnsEncryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Encrypt_ValidInput_ReturnsEncryptedText

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:102:34
                 // plain text
                 long pt = msg[i];
                 long k = 1;
-                for (long j = 0; j < key; j++)
+                for (long j = 0; j <= key; j++)
                 {
                     k = MulMod(k, pt, modulus);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:102:34
                 // plain text
                 long pt = msg[i];
                 long k = 1;
-                for (long j = 0; j < key; j++)
+                for (long j = 0; j > key; j++)
                 {
                     k = MulMod(k, pt, modulus);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:103:17
                 long pt = msg[i];
                 long k = 1;
                 for (long j = 0; j < key; j++)
-                {
-                    k = MulMod(k, pt, modulus);
-                }
+                {}
 
                 // cipher text
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:108:25
                 }
 
                 // cipher text
-                en[i] = k + 96;
+                en[i] = k - 96;
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:125:29
         public static string Decrypt(long key, long modulus, long[] en)
         {
             StringBuilder sb = new StringBuilder();
-            for (int i = 0; i < en.Length; i++)
+            for (int i = 0; i > en.Length; i++)
             {
                 // cipher text
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:125:29
         public static string Decrypt(long key, long modulus, long[] en)
         {
             StringBuilder sb = new StringBuilder();
-            for (int i = 0; i < en.Length; i++)
+            for (int i = 0; i <= en.Length; i++)
             {
                 // cipher text
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:128:27
             for (int i = 0; i < en.Length; i++)
             {
                 // cipher text
-                long ct = en[i] - 96;
+                long ct = en[i] + 96;
                 long k = 1;
                 for (long j = 0; j < key; j++)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:131:17
                 long ct = en[i] - 96;
                 long k = 1;
                 for (long j = 0; j < key; j++)
-                {
-                    k = MulMod(k, ct, modulus);
-                }
+                {}
 
                 // Get positive modulo.
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:138:17
                 // Get positive modulo.
                 const long n = 256;
                 k = PosMod(k, n);
-                sb.Append(Convert.ToChar(k));
+                ;
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:149:34
         // Overflows when modulus is greater than 10 million.
         public static long MulMod(long a, long b, long mod)
         {
-            return ((a % mod) * (b % mod)) % mod;
+            return ((a % mod) * (b * mod)) % mod;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulMod_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:149:21
         // Overflows when modulus is greater than 10 million.
         public static long MulMod(long a, long b, long mod)
         {
-            return ((a % mod) * (b % mod)) % mod;
+            return ((a % mod) / (b % mod)) % mod;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.SimpleRSATests.MulMod_CalculatesModularMultiplication; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.Decrypt_ValidInput_ReturnsDecryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulMod_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:156:17
         public static long MulModTwo(long a, long b, long mod)
         {
             long result = 0; 
-            a = a % mod;
+            a = a * mod;
             while (b > 0)
             {
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:157:20
         {
             long result = 0; 
             a = a % mod;
-            while (b > 0)
+            while (b < 0)
             {
                 // If b is odd, add 'a' to result. 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:157:20
         {
             long result = 0; 
             a = a % mod;
-            while (b > 0)
+            while (!(b > 0))
             {
                 // If b is odd, add 'a' to result. 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.SimpleRSATests.MulModTwo_CalculatesModularMultiplication; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:160:21
             while (b > 0)
             {
                 // If b is odd, add 'a' to result. 
-                if (b % 2 == 1)
+                if (b * 2 == 1)
                 {
                     result = (result + a) % mod;
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.SimpleRSATests.MulModTwo_CalculatesModularMultiplication; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:160:21
             while (b > 0)
             {
                 // If b is odd, add 'a' to result. 
-                if (b % 2 == 1)
+                if (b % 2 != 1)
                 {
                     result = (result + a) % mod;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:162:31
                 // If b is odd, add 'a' to result. 
                 if (b % 2 == 1)
                 {
-                    result = (result + a) % mod;
+                    result = (result - a) % mod;
                 }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:162:30
                 // If b is odd, add 'a' to result. 
                 if (b % 2 == 1)
                 {
-                    result = (result + a) % mod;
+                    result = (result + a) * mod;
                 }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:166:21
                 }
 
                 // Multiply 'a' with 2.
-                a = (a * 2) % mod;
+                a = (a * 2) * mod;
 
                 // Divide b by 2 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:166:22
                 }
 
                 // Multiply 'a' with 2.
-                a = (a * 2) % mod;
+                a = (a / 2) % mod;
 
                 // Divide b by 2 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] DivideAssignmentExpression to MultiplyAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:169:17
                 a = (a * 2) % mod;
 
                 // Divide b by 2 
-                b /= 2;
+                b *= 2;
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:172:20
                 b /= 2;
             }
 
-            return result % mod;
+            return result * mod;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.MulModTwo_ValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:180:21
         // Result is positive or zero.
         public static int PosMod(int a, int n)
         {
-            return (a % n + n) % n;
+            return (a % n - n) % n;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.PosMod_IntValidInput_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.PosMod_IntValidInput_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.PosMod_IntValidInput_ReturnsCorrectResult
