[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:180:21
         // Result is positive or zero.
         public static int PosMod(int a, int n)
         {
-            return (a % n + n) % n;
+            return (a * n + n) % n;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.PosMod_IntValidInput_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.PosMod_IntValidInput_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.PosMod_IntValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:187:20
         // Result is positive or zero.
         public static long PosMod(long a, long n)
         {
-            return (a % n + n) % n;
+            return (a % n + n) * n;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.PosMod_ValidLongInput_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.PosMod_ValidLongInput_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.PosMod_ValidLongInput_ReturnsCorrectResult

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:220:44
         public static string DecryptTwo(long key, long modulus, long[] en)
         {
             StringBuilder sb = new StringBuilder();
-            for (int i = 0; i < en.Length; i++)
+            for (int i = 0; i < en.Length; i--)
             {
                 // cipher text
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.DecryptTwo_ValidInput_ReturnsDecryptedText

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:241:20
         public static long ModularPow(long num, long exponent, long modulus)
         {
             long result = 1;
-            while (exponent > 0)
+            while (!(exponent > 0))
             {
                 if ((exponent & 1) == 1)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:241:20
         public static long ModularPow(long num, long exponent, long modulus)
         {
             long result = 1;
-            while (exponent > 0)
+            while (exponent < 0)
             {
                 if ((exponent & 1) == 1)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:243:21
             long result = 1;
             while (exponent > 0)
             {
-                if ((exponent & 1) == 1)
+                if ((exponent & 1) != 1)
                     result = (result * num) % modulus;
                 exponent = exponent >> 1;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Bitwise mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:243:22
             long result = 1;
             while (exponent > 0)
             {
-                if ((exponent & 1) == 1)
+                if ((exponent | 1) == 1)
                     result = (result * num) % modulus;
                 exponent = exponent >> 1;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:244:30
             while (exponent > 0)
             {
                 if ((exponent & 1) == 1)
-                    result = (result * num) % modulus;
+                    result = (result * num) * modulus;
                 exponent = exponent >> 1;
                 num = (num * num) % modulus;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:244:31
             while (exponent > 0)
             {
                 if ((exponent & 1) == 1)
-                    result = (result * num) % modulus;
+                    result = (result / num) % modulus;
                 exponent = exponent >> 1;
                 num = (num * num) % modulus;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Bitwise mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:245:28
             {
                 if ((exponent & 1) == 1)
                     result = (result * num) % modulus;
-                exponent = exponent >> 1;
+                exponent = exponent << 1;
                 num = (num * num) % modulus;
             }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:246:24
                 if ((exponent & 1) == 1)
                     result = (result * num) % modulus;
                 exponent = exponent >> 1;
-                num = (num * num) % modulus;
+                num = (num / num) % modulus;
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:246:23
                 if ((exponent & 1) == 1)
                     result = (result * num) % modulus;
                 exponent = exponent >> 1;
-                num = (num * num) % modulus;
+                num = (num * num) * modulus;
             }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.DecryptTwo_ValidInput_ReturnsDecryptedText; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_LongValidInput_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:256:20
         public static int ModularPow(int num, int exponent, int modulus)
         {
             int result = 1;
-            while (exponent > 0)
+            while (exponent < 0)
             {
                 if ((exponent & 1) == 1)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_IntValidInput_ReturnsCorrectResult

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:256:20
         public static int ModularPow(int num, int exponent, int modulus)
         {
             int result = 1;
-            while (exponent > 0)
+            while (!(exponent > 0))
             {
                 if ((exponent & 1) == 1)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SimpleRSATests.ModularPow_IntValidInput_ReturnsCorrectResult

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:274:29
             // encrypted 
             BigInteger[] en = new BigInteger[len];
 
-            for (int i = 0; i < msg.Length; i++)
+            for (int i = 0; i > msg.Length; i++)
             {
                 // plain text

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:293:33
             for (int i = 0; i < en.Length; i++)
             {
                 // cipher text
-                BigInteger ct = en[i] - 96;
+                BigInteger ct = en[i] + 96;
                 BigInteger k = BigInteger.ModPow(ct, key, modulus);
 

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:298:21
 
                 // Get positive modulo.
                 BigInteger N = 256;
-                k = k % N;
+                k = k * N;
                 int ch = (int)k;
                 int n = 256;

[NoCoverage] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:302:17
                 int ch = (int)k;
                 int n = 256;
                 ch = PosMod(ch, n);
-                sb.Append(Convert.ToChar(ch));
+                ;
             }
 

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:310:23
 
         public static BigInteger[] EncryptFour(BigInteger key, BigInteger modulus, string msg)
         {
-            int len = msg.Length / 4;
+            int len = msg.Length * 4;
             if (msg.Length % 4 > 0)
                 ++len;

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:311:17
         public static BigInteger[] EncryptFour(BigInteger key, BigInteger modulus, string msg)
         {
             int len = msg.Length / 4;
-            if (msg.Length % 4 > 0)
+            if (msg.Length % 4 < 0)
                 ++len;
 

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:311:17
         public static BigInteger[] EncryptFour(BigInteger key, BigInteger modulus, string msg)
         {
             int len = msg.Length / 4;
-            if (msg.Length % 4 > 0)
+            if (msg.Length % 4 >= 0)
                 ++len;
 

[NoCoverage] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:312:17
         {
             int len = msg.Length / 4;
             if (msg.Length % 4 > 0)
-                ++len;
+                ;
 
             // encrypted 

[NoCoverage] PreIncrementExpression to PreDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:312:17
         {
             int len = msg.Length / 4;
             if (msg.Length % 4 > 0)
-                ++len;
+                --len;
 
             // encrypted 

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:320:29
             // Pack characters.
             int[] m = StrToArray(msg);
 
-            for (int i = 0; i < m.Length; i++)
+            for (int i = 0; i <= m.Length; i++)
             {
                 // plain text

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:320:29
             // Pack characters.
             int[] m = StrToArray(msg);
 
-            for (int i = 0; i < m.Length; i++)
+            for (int i = 0; i > m.Length; i++)
             {
                 // plain text

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:342:21
                 // cipher text
                 BigInteger ct = en[i] - 96;
                 BigInteger k = BigInteger.ModPow(ct, key, modulus);
-                k = k % N;
+                k = k * N;
                 int a = (int)k;
                 // Unpack integer

[NoCoverage] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:345:17
                 k = k % N;
                 int a = (int)k;
                 // Unpack integer
-                sb.Append(IntToStr(a));
+                ;
             }
 

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:355:21
         // Convert string to Array.
         public static int[] StrToArray(string str)
         {
-            int n = str.Length / 4;
+            int n = str.Length * 4;
             if (str.Length % 4 > 0)
                 ++n;

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:356:17
         public static int[] StrToArray(string str)
         {
             int n = str.Length / 4;
-            if (str.Length % 4 > 0)
+            if (str.Length % 4 >= 0)
                 ++n;
             int[] array = new int[n];

[NoCoverage] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:356:17
         public static int[] StrToArray(string str)
         {
             int n = str.Length / 4;
-            if (str.Length % 4 > 0)
+            if (!(str.Length % 4 > 0))
                 ++n;
             int[] array = new int[n];

[NoCoverage] PreIncrementExpression to PreDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:357:17
         {
             int n = str.Length / 4;
             if (str.Length % 4 > 0)
-                ++n;
+                --n;
             int[] array = new int[n];
 

[NoCoverage] Statement mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:357:17
         {
             int n = str.Length / 4;
             if (str.Length % 4 > 0)
-                ++n;
+                ;
             int[] array = new int[n];
 

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:361:45
             int[] array = new int[n];
 
             int k = 0;
-            for (int i = 0; i < str.Length; i += 4)
+            for (int i = 0; i < str.Length; i -= 4)
             {
                 string s1 = str.Substring(i, Math.Min(4, str.Length - i));

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:361:29
             int[] array = new int[n];
 
             int k = 0;
-            for (int i = 0; i < str.Length; i += 4)
+            for (int i = 0; i > str.Length; i += 4)
             {
                 string s1 = str.Substring(i, Math.Min(4, str.Length - i));

[NoCoverage] Linq method mutation (Min() to Max())
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:363:46
             int k = 0;
             for (int i = 0; i < str.Length; i += 4)
             {
-                string s1 = str.Substring(i, Math.Min(4, str.Length - i));
+                string s1 = str.Substring(i, Math.Max(4, str.Length - i));
                 array[k++] = StrToInt(s1);
             }

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:363:58
             int k = 0;
             for (int i = 0; i < str.Length; i += 4)
             {
-                string s1 = str.Substring(i, Math.Min(4, str.Length - i));
+                string s1 = str.Substring(i, Math.Min(4, str.Length + i));
                 array[k++] = StrToInt(s1);
             }

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:364:23
             for (int i = 0; i < str.Length; i += 4)
             {
                 string s1 = str.Substring(i, Math.Min(4, str.Length - i));
-                array[k++] = StrToInt(s1);
+                array[k--] = StrToInt(s1);
             }
 

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:374:45
         public static int StrToInt(string str)
         {
             int result = 0;
-            for (int i = 0; i < str.Length; i++)
+            for (int i = 0; i < str.Length; i--)
             {
                 result = (256 * result) + str[i];

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:374:29
         public static int StrToInt(string str)
         {
             int result = 0;
-            for (int i = 0; i < str.Length; i++)
+            for (int i = 0; i > str.Length; i++)
             {
                 result = (256 * result) + str[i];

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:376:27
             int result = 0;
             for (int i = 0; i < str.Length; i++)
             {
-                result = (256 * result) + str[i];
+                result = (256 / result) + str[i];
             }
 

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:376:26
             int result = 0;
             for (int i = 0; i < str.Length; i++)
             {
-                result = (256 * result) + str[i];
+                result = (256 * result) - str[i];
             }
 

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:386:20
         public static string IntToStr(int a)
         {
             string result = string.Empty;
-            while (a > 0)
+            while (a >= 0)
             {
                 char ch = (char)(a % 256);

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:386:20
         public static string IntToStr(int a)
         {
             string result = string.Empty;
-            while (a > 0)
+            while (a < 0)
             {
                 char ch = (char)(a % 256);

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:388:34
             string result = string.Empty;
             while (a > 0)
             {
-                char ch = (char)(a % 256);
+                char ch = (char)(a * 256);
                 result = ch + result;
                 a = a / 256;

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:390:21
             {
                 char ch = (char)(a % 256);
                 result = ch + result;
-                a = a / 256;
+                a = a * 256;
             }
 
