[Killed] Linq method mutation (Average() to Min())
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:11:23
     public static double Variance(this double[] source)
     {
         int n = source.Count();
-        double mean = source.Average();
+        double mean = source.Min();
         double m2 = 0;
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.StatOneTests.StandardDeviation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:16:28
 
         foreach (double x in source)
         {
-            double delta = x - mean;
+            double delta = x + mean;
             m2 += delta * delta;
         }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.Variance_SingleElement_ReturnsZero; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.StandardDeviation_SingleElement_ReturnsZero

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:17:19
         foreach (double x in source)
         {
             double delta = x - mean;
-            m2 += delta * delta;
+            m2 += delta / delta;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.Variance_SingleElement_ReturnsZero; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.StandardDeviation_SingleElement_ReturnsZero

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:17:13
         foreach (double x in source)
         {
             double delta = x - mean;
-            m2 += delta * delta;
+            m2 -= delta * delta;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.StatOneTests.Variance_ShouldCalculateCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.Variance_ShouldCalculateCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.StandardDeviation_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:20:16
             m2 += delta * delta;
         }
 
-        return m2 / n;
+        return m2 * n;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.StatOneTests.StandardDeviation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:25:5
 
     // Standard Deviation is the square root of the variance.  Denoted sigma.
     public static double StandardDeviation(this double[] source)
-    {
-        return Math.Sqrt(source.Variance());
-    }
+    {}
 
     public static double Range(this IEnumerable<double> source)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.StandardDeviation_EmptyArray_ThrowsException

[Killed] Linq method mutation (Max() to Min())
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:31:16
 
     public static double Range(this IEnumerable<double> source)
     {
-        return source.Max() - source.Min();
+        return source.Min() - source.Min();
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Range_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Range_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.StatOneTests.Range_ShouldCalculateRangeCorrectly

[Killed] Linq method mutation (Min() to Max())
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:31:31
 
     public static double Range(this IEnumerable<double> source)
     {
-        return source.Max() - source.Min();
+        return source.Max() - source.Max();
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Range_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Range_CalculatesCorrectly

[Killed] Linq method mutation (Average() to Min())
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:38:28
     {
         int n = source.Count();
 
-        double avgSource = source.Average();
+        double avgSource = source.Min();
         double avgOther = other.Average();
         double covariance = 0;
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.Covariance_IdenticalArrays_ShouldEqualVariance

[Killed] Linq method mutation (Average() to Min())
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:39:27
         int n = source.Count();
 
         double avgSource = source.Average();
-        double avgOther = other.Average();
+        double avgOther = other.Min();
         double covariance = 0;
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.Covariance_IdenticalArrays_ShouldEqualVariance

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:42:25
         double avgOther = other.Average();
         double covariance = 0;
 
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i <= n; i++)
         {
             covariance += (source[i] - avgSource) * (other[i] - avgOther);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Covariance_CalculatesCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:42:25
         double avgOther = other.Average();
         double covariance = 0;
 
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i > n; i++)
         {
             covariance += (source[i] - avgSource) * (other[i] - avgOther);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.Covariance_IdenticalArrays_ShouldEqualVariance

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:44:54
 
         for (int i = 0; i < n; i++)
         {
-            covariance += (source[i] - avgSource) * (other[i] - avgOther);
+            covariance += (source[i] - avgSource) * (other[i] + avgOther);
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.Covariance_IdenticalArrays_ShouldEqualVariance

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:44:27
 
         for (int i = 0; i < n; i++)
         {
-            covariance += (source[i] - avgSource) * (other[i] - avgOther);
+            covariance += (source[i] - avgSource) / (other[i] - avgOther);
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Covariance_CalculatesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:47:16
             covariance += (source[i] - avgSource) * (other[i] - avgOther);
         }
 
-        return covariance / n;
+        return covariance * n;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.Covariance_IdenticalArrays_ShouldEqualVariance

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:52:16
 
     public static double Pearson(double[] source, double[] other)
     {
-        return Covariance(source, other) /
-               (source.StandardDeviation() * other.StandardDeviation());
+        return Covariance(source, other) *
+               (source.StandardDeviation() * other.StandardDeviation());
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.StatOneTests.Pearson_ShouldCalculatePearsonCorrelationCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:53:17
     public static double Pearson(double[] source, double[] other)
     {
         return Covariance(source, other) /
-               (source.StandardDeviation() * other.StandardDeviation());
+               (source.StandardDeviation() / other.StandardDeviation());
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Pearson_CalculatesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:59:17
 
     public static double StandardScore(double value, double mean, double std)
     {
-        return (value - mean) / std;
+        return (value + mean) / std;
     }
     
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.StandardScore_NegativeValues; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.StandardScore_PositiveValues

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:59:16
 
     public static double StandardScore(double value, double mean, double std)
     {
-        return (value - mean) / std;
+        return (value - mean) * std;
     }
     
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.StandardScore_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.StandardScore_NegativeValues; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.StandardScore_PositiveValues

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:64:16
     
     public static double GetXIntercept(double slope, double yIntercept)
     {
-        return -yIntercept / slope;
+        return -yIntercept * slope;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetXIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.GetXIntercept_PositiveSlope

[Killed] UnaryMinusExpression to UnaryPlusExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:64:16
     
     public static double GetXIntercept(double slope, double yIntercept)
     {
-        return -yIntercept / slope;
+        return +yIntercept / slope;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.GetXIntercept_PositiveSlope

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:69:16
 
     public static double GetY(double x, double slope, double yIntercept)
     {
-        return slope * x + yIntercept;
+        return slope / x + yIntercept;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.GetY_PositiveValues

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:69:16
 
     public static double GetY(double x, double slope, double yIntercept)
     {
-        return slope * x + yIntercept;
+        return slope * x - yIntercept;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetY_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetY_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.GetY_NegativeValues

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:87:13
         {
             double x = source[i];
             double y = other[i];
-            sumX += x;
+            sumX -= x;
             sumY += y;
             sumXX += x * x;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.GetSlopeIntercept_SimpleData_ShouldCalculateCorrectly

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:88:13
             double x = source[i];
             double y = other[i];
             sumX += x;
-            sumY += y;
+            sumY -= y;
             sumXX += x * x;
             sumXY += x * y;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:89:22
             double y = other[i];
             sumX += x;
             sumY += y;
-            sumXX += x * x;
+            sumXX += x / x;
             sumXY += x * y;
         }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:89:13
             double y = other[i];
             sumX += x;
             sumY += y;
-            sumXX += x * x;
+            sumXX -= x * x;
             sumXY += x * y;
         }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.GetSlopeIntercept_SimpleData_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:90:22
             sumX += x;
             sumY += y;
             sumXX += x * x;
-            sumXY += x * y;
+            sumXY += x / y;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.GetSlopeIntercept_SimpleData_ShouldCalculateCorrectly

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:90:13
             sumX += x;
             sumY += y;
             sumXX += x * x;
-            sumXY += x * y;
+            sumXY -= x * y;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.GetSlopeIntercept_SimpleData_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:93:24
             sumXY += x * y;
         }
 
-        double delta = n * sumXX - sumX * sumX;
+        double delta = n * sumXX + sumX * sumX;
 
         yIntercept = (sumXX * sumY - sumX * sumXY) / delta;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.GetSlopeIntercept_SimpleData_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:93:24
             sumXY += x * y;
         }
 
-        double delta = n * sumXX - sumX * sumX;
+        double delta = n / sumXX - sumX * sumX;
 
         yIntercept = (sumXX * sumY - sumX * sumXY) / delta;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.GetSlopeIntercept_SimpleData_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:95:38
 
         double delta = n * sumXX - sumX * sumX;
 
-        yIntercept = (sumXX * sumY - sumX * sumXY) / delta;
+        yIntercept = (sumXX * sumY - sumX / sumXY) / delta;
 
         // slope
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:95:23
 
         double delta = n * sumXX - sumX * sumX;
 
-        yIntercept = (sumXX * sumY - sumX * sumXY) / delta;
+        yIntercept = (sumXX / sumY - sumX * sumXY) / delta;
 
         // slope
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.GetSlopeIntercept_SimpleData_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:98:17
         yIntercept = (sumXX * sumY - sumX * sumXY) / delta;
 
         // slope
-        return (n * sumXY - sumX * sumY) / delta;
+        return (n * sumXY + sumX * sumY) / delta;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:98:17
         yIntercept = (sumXX * sumY - sumX * sumXY) / delta;
 
         // slope
-        return (n * sumXY - sumX * sumY) / delta;
+        return (n / sumXY - sumX * sumY) / delta;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.GetSlopeIntercept_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Gemini.Prompt3.StatOneTests.GetSlopeIntercept_SimpleData_ShouldCalculateCorrectly

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:111:32
         double sumXY = 0;
         double sumYY = 0;
 
-        for (int i = 0; i < n; i++)
+        for (int i = 0; i < n; i--)
         {
             double x = source[i];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.RSquared_ShouldCalculateCorrectly

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:118:13
             sumX += x;
             sumY += y;
             sumXX += x * x;
-            sumYY += y * y;
+            sumYY -= y * y;
             sumXY += x * y;
         }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:118:22
             sumX += x;
             sumY += y;
             sumXX += x * x;
-            sumYY += y * y;
+            sumYY += y / y;
             sumXY += x * y;
         }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.RSquared_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:119:22
             sumY += y;
             sumXX += x * x;
             sumYY += y * y;
-            sumXY += x * y;
+            sumXY += x / y;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.RSquared_ShouldCalculateCorrectly

[Killed] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:119:13
             sumY += y;
             sumXX += x * x;
             sumYY += y * y;
-            sumXY += x * y;
+            sumXY -= x * y;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.RSquared_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:123:16
         }
 
         // correlation
-        return (n * sumXY - sumX * sumY) /
-               System.Math.Sqrt((n * sumXX - sumX * sumX) * (n * sumYY - sumY * sumY));
+        return (n * sumXY - sumX * sumY) *
+               System.Math.Sqrt((n * sumXX - sumX * sumX) * (n * sumYY - sumY * sumY));
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:123:29
         }
 
         // correlation
-        return (n * sumXY - sumX * sumY) /
+        return (n * sumXY - sumX / sumY) /
                System.Math.Sqrt((n * sumXX - sumX * sumX) * (n * sumYY - sumY * sumY));
     }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.RSquared_ShouldCalculateCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.Correlation_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:124:34
 
         // correlation
         return (n * sumXY - sumX * sumY) /
-               System.Math.Sqrt((n * sumXX - sumX * sumX) * (n * sumYY - sumY * sumY));
+               System.Math.Sqrt((n * sumXX + sumX * sumX) * (n * sumYY - sumY * sumY));
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.RSquared_ShouldCalculateCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.Correlation_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:124:33
 
         // correlation
         return (n * sumXY - sumX * sumY) /
-               System.Math.Sqrt((n * sumXX - sumX * sumX) * (n * sumYY - sumY * sumY));
+               System.Math.Sqrt((n * sumXX - sumX * sumX) / (n * sumYY - sumY * sumY));
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Correlation_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.StatOneTests.RSquared_ShouldCalculateCorrectly

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:131:16
 
     public static double RSquared(double cor)
     {
-        return cor * cor;
+        return cor / cor;
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.RSquared_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.RSquared_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.RSquared_NegativeCorrelation

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:137:16
     public static double RSquared(double[] source, double[] other)
     {
         double cor = Correlation(source, other);
-        return cor * cor;
+        return cor / cor;
     }
 

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:145:25
     public static double ChiSquared(double[] observed, double[] expected)
     {
         double result = 0;
-        for (int i = 0; i < observed.Length; i++)
+        for (int i = 0; i <= observed.Length; i++)
         {
             double delta = observed[i] - expected[i];

[NoCoverage] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:145:46
     public static double ChiSquared(double[] observed, double[] expected)
     {
         double result = 0;
-        for (int i = 0; i < observed.Length; i++)
+        for (int i = 0; i < observed.Length; i--)
         {
             double delta = observed[i] - expected[i];

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:147:28
         double result = 0;
         for (int i = 0; i < observed.Length; i++)
         {
-            double delta = observed[i] - expected[i];
+            double delta = observed[i] + expected[i];
             result += (delta * delta) / expected[i];
         }

[NoCoverage] AddAssignmentExpression to SubtractAssignmentExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:148:13
         for (int i = 0; i < observed.Length; i++)
         {
             double delta = observed[i] - expected[i];
-            result += (delta * delta) / expected[i];
+            result -= (delta * delta) / expected[i];
         }
 

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:148:24
         for (int i = 0; i < observed.Length; i++)
         {
             double delta = observed[i] - expected[i];
-            result += (delta * delta) / expected[i];
+            result += (delta / delta) / expected[i];
         }
 

[Survived] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:166:13
 
         // Save the sign of x
         int sign = 1;
-        if (x < 0)
+        if (!(x < 0))
         {
             sign = -1;

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:166:13
 
         // Save the sign of x
         int sign = 1;
-        if (x < 0)
+        if (x > 0)
         {
             sign = -1;

[NoCoverage] UnaryMinusExpression to UnaryPlusExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:168:20
         int sign = 1;
         if (x < 0)
         {
-            sign = -1;
+            sign = +1;
         }
 

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:171:13
             sign = -1;
         }
 
-        x = Math.Abs(x) / Math.Sqrt(2.0);
+        x = Math.Abs(x) * Math.Sqrt(2.0);
 
         // A&S formula 7.1.26

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:174:20
         x = Math.Abs(x) / Math.Sqrt(2.0);
 
         // A&S formula 7.1.26
-        double t = 1.0 / (1.0 + p * x);
+        double t = 1.0 * (1.0 + p * x);
         double y = 1.0 - (((((a5 * t + a4) * t) + a3) * t + a2) * t + a1) * t * Math.Exp(-x * x);
 

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:174:33
         x = Math.Abs(x) / Math.Sqrt(2.0);
 
         // A&S formula 7.1.26
-        double t = 1.0 / (1.0 + p * x);
+        double t = 1.0 / (1.0 + p / x);
         double y = 1.0 - (((((a5 * t + a4) * t) + a3) * t + a2) * t + a1) * t * Math.Exp(-x * x);
 

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:175:26
 
         // A&S formula 7.1.26
         double t = 1.0 / (1.0 + p * x);
-        double y = 1.0 - (((((a5 * t + a4) * t) + a3) * t + a2) * t + a1) * t * Math.Exp(-x * x);
+        double y = 1.0 - (((((a5 * t + a4) * t) + a3) * t + a2) * t + a1) / t * Math.Exp(-x * x);
 
         return 0.5 * (1.0 + sign * y);

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:175:27
 
         // A&S formula 7.1.26
         double t = 1.0 / (1.0 + p * x);
-        double y = 1.0 - (((((a5 * t + a4) * t) + a3) * t + a2) * t + a1) * t * Math.Exp(-x * x);
+        double y = 1.0 - (((((a5 * t + a4) * t) + a3) * t + a2) / t + a1) * t * Math.Exp(-x * x);
 
         return 0.5 * (1.0 + sign * y);

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:177:16
         double t = 1.0 / (1.0 + p * x);
         double y = 1.0 - (((((a5 * t + a4) * t) + a3) * t + a2) * t + a1) * t * Math.Exp(-x * x);
 
-        return 0.5 * (1.0 + sign * y);
+        return 0.5 / (1.0 + sign * y);
     }
 }

[Survived] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:177:29
         double t = 1.0 / (1.0 + p * x);
         double y = 1.0 - (((((a5 * t + a4) * t) + a3) * t + a2) * t + a1) * t * Math.Exp(-x * x);
 
-        return 0.5 * (1.0 + sign * y);
+        return 0.5 * (1.0 + sign / y);
     }
 }
