[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:42:17
 
         public static bool SolveTheGrid(int[][] grid)
         {
-            if (FindEmpty(grid) == null)
+            if (FindEmpty(grid) != null)
             {
                 return false;
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SudokuSolverTests.SolveTheGrid_ShouldReturnTrueForValidInput

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:49:33
             else
             {
                 int[]? arr = FindEmpty(grid);
-                for (int i = 1; i < 10; i++)
+                for (int i = 1; i <= 10; i++)
                 {
                     if (IsPossible(grid, arr, i))

[Timeout] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:49:41
             else
             {
                 int[]? arr = FindEmpty(grid);
-                for (int i = 1; i < 10; i++)
+                for (int i = 1; i < 10; i--)
                 {
                     if (IsPossible(grid, arr, i))

[Survived] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:51:25
                 int[]? arr = FindEmpty(grid);
                 for (int i = 1; i < 10; i++)
                 {
-                    if (IsPossible(grid, arr, i))
+                    if (!(IsPossible(grid, arr, i)))
                     {
                         grid[arr[0]][arr[1]] = i;

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:55:29
                     {
                         grid[arr[0]][arr[1]] = i;
 
-                        if (!SolveTheGrid(grid))
+                        if (SolveTheGrid(grid))
                         {
                             

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:68:20
                 }
             }
             board = grid;
-            return true;
+            return false;
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SudokuSolverTests.SolveTheGrid_ShouldReturnTrueForValidInput

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:75:46
         public static int[]? FindEmpty(int[][] grid)
         {
             int[] arr = [0, 0];
-            for (int i = 0; i < grid.Length; i++)
+            for (int i = 0; i < grid.Length; i--)
             {
                 for (int j = 0; j < grid[i].Length; j++)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.FindEmpty_ReturnsNullForFullGrid; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SudokuSolverTests.FindEmpty_ShouldReturnNullWhenNoEmptyCellExists; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SudokuSolverTests.SolveTheGrid_ShouldReturnTrueForValidInput

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:75:29
         public static int[]? FindEmpty(int[][] grid)
         {
             int[] arr = [0, 0];
-            for (int i = 0; i < grid.Length; i++)
+            for (int i = 0; i > grid.Length; i++)
             {
                 for (int j = 0; j < grid[i].Length; j++)
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.SudokuSolverTests.FindEmpty_FindsFirstEmptyCell; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.FindEmpty_ReturnsCorrectEmptyCell

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:77:33
             int[] arr = [0, 0];
             for (int i = 0; i < grid.Length; i++)
             {
-                for (int j = 0; j < grid[i].Length; j++)
+                for (int j = 0; j > grid[i].Length; j++)
                 {
                     if (grid[i][j] == 0)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.FindEmpty_ReturnsCorrectEmptyCell

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:77:33
             int[] arr = [0, 0];
             for (int i = 0; i < grid.Length; i++)
             {
-                for (int j = 0; j < grid[i].Length; j++)
+                for (int j = 0; j <= grid[i].Length; j++)
                 {
                     if (grid[i][j] == 0)
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.SudokuSolverTests.FindEmpty_NoEmptyCells_ReturnsNull; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.FindEmpty_ReturnsNullForFullGrid; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SudokuSolverTests.FindEmpty_ShouldReturnNullWhenNoEmptyCellExists

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:79:25
             {
                 for (int j = 0; j < grid[i].Length; j++)
                 {
-                    if (grid[i][j] == 0)
+                    if (grid[i][j] != 0)
                     {
                         arr = [i, j];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.FindEmpty_ReturnsNullForFullGrid; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.FindEmpty_ReturnsCorrectEmptyCell; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.SudokuSolverTests.SolveTheGrid_ShouldReturnFalseForUnsolvableGrid

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:80:21
                 for (int j = 0; j < grid[i].Length; j++)
                 {
                     if (grid[i][j] == 0)
-                    {
-                        arr = [i, j];
-                        return arr;
-                    }
+                    {}
                 }
             }
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.SudokuSolverTests.FindEmpty_FindsFirstEmptyCell; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.FindEmpty_ReturnsCorrectEmptyCell; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SudokuSolverTests.FindEmpty_ShouldReturnCorrectCoordinatesWhenEmptyCellExists

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:91:36
 
         public static bool IsPossible(int[][] grid, int[]? arr, int num)
         {
-            for (int i = 0; i < 9; i++)
+            for (int i = 0; i < 9; i--)
             {
                 if (grid[arr[0]][i] == num && i != arr[1])
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:91:29
 
         public static bool IsPossible(int[][] grid, int[]? arr, int num)
         {
-            for (int i = 0; i < 9; i++)
+            for (int i = 0; i <= 9; i++)
             {
                 if (grid[arr[0]][i] == num && i != arr[1])
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:93:21
         {
             for (int i = 0; i < 9; i++)
             {
-                if (grid[arr[0]][i] == num && i != arr[1])
+                if (grid[arr[0]][i] == num || i != arr[1])
                 {
                     return false;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SudokuSolverTests.IsPossible_ValidNumber_ReturnsTrue

[Killed] Negate expression
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:93:21
         {
             for (int i = 0; i < 9; i++)
             {
-                if (grid[arr[0]][i] == num && i != arr[1])
+                if (!(grid[arr[0]][i] == num && i != arr[1]))
                 {
                     return false;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:99:29
                 }
             }
 
-            for (int i = 0; i < 9; i++)
+            for (int i = 0; i <= 9; i++)
             {
                 if (grid[i][arr[1]] == num && i != arr[0])
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SudokuSolverTests.SolveTheGrid_ShouldReturnTrueForValidInput

[Killed] PostIncrementExpression to PostDecrementExpression mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:99:36
                 }
             }
 
-            for (int i = 0; i < 9; i++)
+            for (int i = 0; i < 9; i--)
             {
                 if (grid[i][arr[1]] == num && i != arr[0])
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SudokuSolverTests.IsPossible_ValidNumber_ReturnsTrue

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:101:21
 
             for (int i = 0; i < 9; i++)
             {
-                if (grid[i][arr[1]] == num && i != arr[0])
+                if (grid[i][arr[1]] == num || i != arr[0])
                 {
                     return false;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SudokuSolverTests.IsPossible_ValidNumber_ReturnsTrue

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:101:21
 
             for (int i = 0; i < 9; i++)
             {
-                if (grid[i][arr[1]] == num && i != arr[0])
+                if (grid[i][arr[1]] != num && i != arr[0])
                 {
                     return false;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:107:48
                 }
             }
 
-            for (int i = (arr[0] / 3) * 3; i < (arr[0] / 3) * 3 + 3; i++)
+            for (int i = (arr[0] / 3) * 3; i < (arr[0] / 3) * 3 - 3; i++)
             {
                 for (int j = (arr[1] / 3) * 3; j < (arr[1] / 3) * 3 + 3; j++)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.SudokuSolverTests.IsPossible_ShouldReturnCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:107:44
                 }
             }
 
-            for (int i = (arr[0] / 3) * 3; i < (arr[0] / 3) * 3 + 3; i++)
+            for (int i = (arr[0] / 3) * 3; i > (arr[0] / 3) * 3 + 3; i++)
             {
                 for (int j = (arr[1] / 3) * 3; j < (arr[1] / 3) * 3 + 3; j++)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.SudokuSolverTests.IsPossible_ShouldReturnCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:109:48
 
             for (int i = (arr[0] / 3) * 3; i < (arr[0] / 3) * 3 + 3; i++)
             {
-                for (int j = (arr[1] / 3) * 3; j < (arr[1] / 3) * 3 + 3; j++)
+                for (int j = (arr[1] / 3) * 3; j <= (arr[1] / 3) * 3 + 3; j++)
                 {
                     if (grid[i][j] == num && i != arr[0] && j != arr[1])
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.SudokuSolverTests.SolveTheGrid_ShouldReturnTrueForValidInput

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:109:48
 
             for (int i = (arr[0] / 3) * 3; i < (arr[0] / 3) * 3 + 3; i++)
             {
-                for (int j = (arr[1] / 3) * 3; j < (arr[1] / 3) * 3 + 3; j++)
+                for (int j = (arr[1] / 3) * 3; j > (arr[1] / 3) * 3 + 3; j++)
                 {
                     if (grid[i][j] == num && i != arr[0] && j != arr[1])
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.SudokuSolverTests.IsPossible_ShouldReturnCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:111:25
             {
                 for (int j = (arr[1] / 3) * 3; j < (arr[1] / 3) * 3 + 3; j++)
                 {
-                    if (grid[i][j] == num && i != arr[0] && j != arr[1])
+                    if (grid[i][j] != num && i != arr[0] && j != arr[1])
                         return false;
                 }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SudokuSolverTests.IsPossible_ValidNumber_ReturnsTrue

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:111:61
             {
                 for (int j = (arr[1] / 3) * 3; j < (arr[1] / 3) * 3 + 3; j++)
                 {
-                    if (grid[i][j] == num && i != arr[0] && j != arr[1])
+                    if (grid[i][j] == num && i != arr[0] && j == arr[1])
                         return false;
                 }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.SudokuSolverTests.IsPossible_ShouldReturnCorrectResult

[Killed] Boolean mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:112:32
                 for (int j = (arr[1] / 3) * 3; j < (arr[1] / 3) * 3 + 3; j++)
                 {
                     if (grid[i][j] == num && i != arr[0] && j != arr[1])
-                        return false;
+                        return true;
                 }
             }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt1.SudokuSolverTests.IsPossible_ShouldReturnCorrectResult
