[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:8:21
 {
     public bool CheckVictory(string[] grid)
     {
-        bool row1 = grid[0] == grid[1] && grid[1] == grid[2];
+        bool row1 = grid[0] == grid[1] || grid[1] == grid[2];
         bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:8:43
 {
     public bool CheckVictory(string[] grid)
     {
-        bool row1 = grid[0] == grid[1] && grid[1] == grid[2];
+        bool row1 = grid[0] == grid[1] && grid[1] != grid[2];
         bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.TickTackToeVictoryTests.CheckVictory_HorizontalWin; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnTrue_WhenRow1IsFilledWithSameSymbol

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:9:21
     public bool CheckVictory(string[] grid)
     {
         bool row1 = grid[0] == grid[1] && grid[1] == grid[2];
-        bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
+        bool row2 = grid[3] != grid[4] && grid[4] == grid[5];
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];

[Survived] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:9:21
     public bool CheckVictory(string[] grid)
     {
         bool row1 = grid[0] == grid[1] && grid[1] == grid[2];
-        bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
+        bool row2 = grid[3] == grid[4] || grid[4] == grid[5];
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:10:21
     {
         bool row1 = grid[0] == grid[1] && grid[1] == grid[2];
         bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
-        bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
+        bool row3 = grid[6] == grid[7] || grid[7] == grid[8];
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:10:43
     {
         bool row1 = grid[0] == grid[1] && grid[1] == grid[2];
         bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
-        bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
+        bool row3 = grid[6] == grid[7] && grid[7] != grid[8];
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:11:21
         bool row1 = grid[0] == grid[1] && grid[1] == grid[2];
         bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
-        bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
+        bool col1 = grid[0] != grid[3] && grid[3] == grid[6];
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
         bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnFalse_WhenNoVictoryCondition

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:11:43
         bool row1 = grid[0] == grid[1] && grid[1] == grid[2];
         bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
-        bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
+        bool col1 = grid[0] == grid[3] && grid[3] != grid[6];
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
         bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.TickTackToeVictoryTests.CheckVictory_VerticalWin

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:12:21
         bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
-        bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
+        bool col2 = grid[1] == grid[4] || grid[4] == grid[7];
         bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
         bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnFalse_WhenNoVictoryCondition

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:12:21
         bool row2 = grid[3] == grid[4] && grid[4] == grid[5];
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
-        bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
+        bool col2 = grid[1] != grid[4] && grid[4] == grid[7];
         bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
         bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnFalse_WhenNoVictoryCondition

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:13:21
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
-        bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
+        bool col3 = grid[2] != grid[5] && grid[5] == grid[8];
         bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
         bool diagUp = grid[6] == grid[4] && grid[4] == grid[2];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnFalse_WhenNoVictoryCondition

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:13:21
         bool row3 = grid[6] == grid[7] && grid[7] == grid[8];
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
-        bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
+        bool col3 = grid[2] == grid[5] || grid[5] == grid[8];
         bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
         bool diagUp = grid[6] == grid[4] && grid[4] == grid[2];
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnFalse_WhenNoVictoryCondition

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:14:47
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
         bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
-        bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
+        bool diagDown = grid[0] == grid[4] && grid[4] != grid[8];
         bool diagUp = grid[6] == grid[4] && grid[4] == grid[2];
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.TickTackToeVictoryTests.CheckVictory_NoWin; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectResult

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:14:25
         bool col1 = grid[0] == grid[3] && grid[3] == grid[6];
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
         bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
-        bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
+        bool diagDown = grid[0] == grid[4] || grid[4] == grid[8];
         bool diagUp = grid[6] == grid[4] && grid[4] == grid[2];
 
killedBy: UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.TickTackToeVictoryTests.CheckVictory_NoWin; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnFalse_WhenNoVictoryCondition

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:15:23
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
         bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
         bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
-        bool diagUp = grid[6] == grid[4] && grid[4] == grid[2];
+        bool diagUp = grid[6] == grid[4] || grid[4] == grid[2];
 
         return row1 || row2 || row3 || col1 || col2 || col3 || diagDown || diagUp;
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnFalse_WhenNoVictoryCondition

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:15:45
         bool col2 = grid[1] == grid[4] && grid[4] == grid[7];
         bool col3 = grid[2] == grid[5] && grid[5] == grid[8];
         bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
-        bool diagUp = grid[6] == grid[4] && grid[4] == grid[2];
+        bool diagUp = grid[6] == grid[4] && grid[4] != grid[2];
 
         return row1 || row2 || row3 || col1 || col2 || col3 || diagDown || diagUp;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectly

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:17:16
         bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
         bool diagUp = grid[6] == grid[4] && grid[4] == grid[2];
 
-        return row1 || row2 || row3 || col1 || col2 || col3 || diagDown || diagUp;
+        return row1 || row2 && row3 || col1 || col2 || col3 || diagDown || diagUp;
     }
 }
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt1.TickTackToeVictoryTests.CheckVictory_ShouldReturnTrue_WhenRow1IsFilledWithSameSymbol

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/TickTackToeVictory.cs:17:16
         bool diagDown = grid[0] == grid[4] && grid[4] == grid[8];
         bool diagUp = grid[6] == grid[4] && grid[4] == grid[2];
 
-        return row1 || row2 || row3 || col1 || col2 || col3 || diagDown || diagUp;
+        return row1 || row2 || row3 && col1 || col2 || col3 || diagDown || diagUp;
     }
 }
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.TickTackToeVictoryTests.CheckVictory_ShouldReturnCorrectResult
