[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:13:25
         var listArray = new List<int>();
         var doubleZero = new int[] {0, 0};
 
-        for (int i = 0; listArray.Count < arr.Length; i++)
+        for (int i = 0; listArray.Count > arr.Length; i++)
         {
             if (arr[i] != 0)
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnArrayWithDuplicatedZerosAtEnd_WhenZerosAtEndPresent; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnUnchangedArray_WhenNoZerosPresent; UnitTestGeneration.Easy.Tests.Cloude.Prompt2.DoubleZeroArrayTests.DuplicateZeros_MaximumLengthArray_ReturnsCorrectResult

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:16:13
         for (int i = 0; listArray.Count < arr.Length; i++)
         {
             if (arr[i] != 0)
-            {
-                listArray.Add(arr[i]);
-            }
+            {}
             else
             {
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnArrayWithDuplicatedZerosAtEnd_WhenZerosAtEndPresent; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnUnchangedArray_WhenNoZerosPresent

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/DoubleZeroArray.cs:20:13
                 listArray.Add(arr[i]);
             }
             else
-            {
-                listArray.AddRange(doubleZero);
-            }
+            {}
         }
 
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.DoubleZeroArrayTests.DuplicateZeros_ShouldReturnArrayWithDuplicatedZerosAtEnd_WhenZerosAtEndPresent; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.DoubleZeroArrayTests.DuplicateZeros_ZerosAtEnd_DuplicatesCorrectly; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.DoubleZeroArrayTests.DuplicateZeros_ShouldDuplicateZeros_WhenInputArrayHasZeros
