[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:13:25
     {
         var maxLentgh = new List<int>();
         var maxNumber = 0;
-        for (int i = 0; i < nums.Length; i++)
+        for (int i = 0; i > nums.Length; i++)
         {
             if (nums[i] == 1)
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:16:13
         for (int i = 0; i < nums.Length; i++)
         {
             if (nums[i] == 1)
-            {
-                maxNumber += 1;
-            }
+            {}
             else
             {
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:20:13
                 maxNumber += 1;
             }
             else
-            {
-                maxLentgh.Add(maxNumber);
-                maxNumber = 0;
-            }
+            {}
             if (i == nums.Length - 1)
             {
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ConsecutiveAtBeginning_ReturnsCorrectMax; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_MultipleSequences_ReturnsCorrectMax

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/FindConsecutive.cs:25:13
                 maxNumber = 0;
             }
             if (i == nums.Length - 1)
-            {
-                maxLentgh.Add(maxNumber);
-            }
+            {}
         }
         return maxLentgh.Max();
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldReturnCorrectResult_ForDifferentArrays; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt2.FindConsecutiveTests.FindMaxConsecutiveOnes_ShouldHandleSingleOne
