[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/GetUrl.cs:7:5
 public static class GetUrl
 {
     public static string ExtractRequestType(Uri url)
-    {
-        return url.Segments.Last().TrimEnd('/');
-    }
+    {}
 }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.GetUrlTests.ExtractRequestType_ShouldReturnLastSegment_WhenUrlHasSpecialCharacters; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.GetUrlTests.ExtractRequestType_ShouldReturnEmptyString_WhenUrlHasNoSegments; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.GetUrlTests.ExtractRequestType_ShouldReturnLastSegment_WhenUrlHasMultipleSegments
