[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/IsNumber.cs:8:5
 public static class IsNumber
 {
     public static bool IsNumeric(string number)
-    {
-        if (string.IsNullOrEmpty(number)) return false;
-        foreach (var digit in number)
-            if (!int.TryParse(digit.ToString(), out _))
-                return false;
-        return true;
-    }
+    {}
 }
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.IsNumberTests.IsNumeric_ShouldReturnTrue_ForValidNumericStrings; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.IsNumberTests.IsNumeric_ShouldReturnTrue_ForValidNumericStrings; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.IsNumberTests.IsNumeric_ValidInteger_ReturnsTrue
