[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Easy.App/RemoveArrayDuplicates.cs:16:13
         foreach (var num in nums)
         {
             if (nums[result - 1] != num)
-            {
-                nums[result++] = num;
-            }
+            {}
         }
 
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldHandleArrayWithNoDuplicates; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.RemoveArrayDuplicatesTests.RemoveDuplicates_ShouldRemoveDuplicates_AndReturnCorrectLength; UnitTestGeneration.Easy.Tests.Gemini.Prompt3.RemoveArrayDuplicatesTests.RemoveDuplicates_NoDuplicates_ReturnsOriginalLength
