[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Easy.App/SqrtFunction.cs:8:12
 public static class SqrtFunction
 {
     public static decimal Sqrt(decimal x, decimal epsilon = 0.0M) {
-        if(x<0) throw new OverflowException("Cannot calculate square root from a negative number");
+        if(x>0) throw new OverflowException("Cannot calculate square root from a negative number");
 
         decimal current = (decimal)Math.Sqrt((double)x), previous;
killedBy: UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPerfectSquares; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPerfectSquares; UnitTestGeneration.Easy.Tests.ChatGPT.Prompt3.SqrtFunctionTests.Sqrt_ShouldReturnCorrectResult_ForPerfectSquares
