[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:21:21
                 {
                     var find = Array.Find(arr, i => i == item * 2);
                     if (find != 0)
-                    {
-                        return true;
-                    }
+                    {}
                 }
                 if (item == 0)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithNonZeroDoubleExists_ReturnsTrue; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt1.CheckIfDoubleExistsTests.CheckIfExists_ReturnsTrue_WhenDoubleExists; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_ZeroAsDouble_ReturnsTrue

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/CheckIfDoubleExists.cs:30:25
                     for (int cont = index + 1; cont < arr.Length; cont++)
                     {
                         if (arr[cont] == item)
-                        {
-                            return true;
-                        }
+                        {}
                     }
                 }
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.CheckIfDoubleExistsTests.CheckIfExists_MultipleZeros_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.CheckIfDoubleExistsTests.ArrayWithMultipleZeros_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.CheckIfDoubleExistsTests.CheckIfExists_ArrayWithOnlyZeroes_ReturnsTrue
