[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:21:40
             for (int cont = 0; cont < arr.Length; cont++)
             {
                 var result = -1;
-                for (int contX = cont; contX < arr.Length; contX++)
+                for (int contX = cont; contX <= arr.Length; contX++)
                 {
                     if (contX + 1 < arr.Length)

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:23:25
                 var result = -1;
                 for (int contX = cont; contX < arr.Length; contX++)
                 {
-                    if (contX + 1 < arr.Length)
+                    if (contX + 1 > arr.Length)
                     {
                         if (arr[contX + 1] > result)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithMultipleElements_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithTwoElements_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithDuplicateElements_ReturnsCorrectResult

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/ElementReplacement.cs:25:29
                 {
                     if (contX + 1 < arr.Length)
                     {
-                        if (arr[contX + 1] > result)
+                        if (arr[contX + 1] < result)
                         {
                             result = arr[contX + 1];
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithMultipleElements_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithTwoElements_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.ElementReplacementTests.ReplaceElements_ArrayWithDuplicateElements_ReturnsCorrectResult
