[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/EnumerableExtensions.cs:24:16
             else
                 dict[element] = count;
         }
-        return dict.Count == 0;
+        return dict.Count != 0;
     }
     public static bool SequenceEqualOrderIgnore<T>(this IEnumerable<T> first, IEnumerable<T> second)
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_WithCustomComparer_SequencesEqual_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_WithDefaultComparer_SequencesEqual_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.EnumerableExtensionsTests.SequenceEqualOrderIgnore_BothSequencesEmpty_ReturnsTrue
