[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:14:13
     decimal denominator {get; set;}
     public static decimal SafeDivision(decimal numerator, decimal denominator)
     {
-        if (numerator == 0 || denominator == 0)
+        if (numerator == 0 && denominator == 0)
             throw new DivideByZeroException();
         return numerator / denominator;
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.FractionConvertersTests.SafeDivision_NumeratorZero_ThrowsDivideByZeroException; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ZeroNumerator_ThrowsException1; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.FractionConvertersTests.SafeDivision_ZeroNumerator_ThrowsException

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/FractionConverters.cs:29:9
             simplified = numerator / denominator;
         }
         catch (DivideByZeroException)
-        {
-            Console.WriteLine("Attempted to write by zero.");
-        }
+        {}
         return simplified;
     }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.FractionConvertersTests.Fraction_DenominatorZero_WritesErrorMessage; UnitTestGeneration.Moderate.Tests.Cloude.Prompt3.FractionConvertersTests.Fraction_DenominatorIsZero_WritesErrorMessage
