[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:22:48
         Stack<string> stack = new Stack<string>();
         List<string> postfix = new List<string>();
         foreach(string token in tokens) {
-            if(Decimal.TryParse(token, out _)) {
-                postfix.Add(token);
-            } else if(operators.TryGetValue(token, out var op1)) {
+            if(Decimal.TryParse(token, out _)) {} else if(operators.TryGetValue(token, out var op1)) {
                 while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
                     int c = op1.predence.CompareTo(op2.predence);
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_SimpleExpression_ConvertsCorrectly; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_SingleNumber_ReturnsNumber

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:25:23
             if(Decimal.TryParse(token, out _)) {
                 postfix.Add(token);
             } else if(operators.TryGetValue(token, out var op1)) {
-                while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
+                while(stack.Count < 0 && operators.TryGetValue(stack.Peek(), out var op2)){
                     int c = op1.predence.CompareTo(op2.predence);
                     if(c < 0 || !op1.rightAssociative && c<=0) {

[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:27:33
             } else if(operators.TryGetValue(token, out var op1)) {
                 while(stack.Count > 0 && operators.TryGetValue(stack.Peek(), out var op2)){
                     int c = op1.predence.CompareTo(op2.predence);
-                    if(c < 0 || !op1.rightAssociative && c<=0) {
+                    if(c < 0 || !op1.rightAssociative || c<=0) {
                         postfix.Add(stack.Pop());
                     } else {
killedBy: UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_RightAssociativeOperator_ReturnsCorrectPostfix; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.InfixToPostfixAppTests.InfixToPostfix_ReturnsCorrectPostfixExpression

[Timeout] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:29:28
                     int c = op1.predence.CompareTo(op2.predence);
                     if(c < 0 || !op1.rightAssociative && c<=0) {
                         postfix.Add(stack.Pop());
-                    } else {
-                        break;
-                    }
+                    } else {}
                 }
                 stack.Push(token);

[Survived] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:34:35
                     }
                 }
                 stack.Push(token);
-            } else if(token=="(") {
-                stack.Push("(");
-            } else if(token ==")") {
+            } else if(token=="(") {} else if(token ==")") {
                 while(stack.Count > 0 && stack.Peek() != "(") {
                     postfix.Add(stack.Pop());

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:37:23
             } else if(token=="(") {
                 stack.Push("(");
             } else if(token ==")") {
-                while(stack.Count > 0 && stack.Peek() != "(") {
+                while(stack.Count < 0 && stack.Peek() != "(") {
                     postfix.Add(stack.Pop());
                 }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_InvalidExpression_ThrowsException; UnitTestGeneration.Moderate.Tests.Cloude.Prompt1.InfixToPostfixAppTests.InfixToPostfix_HandlesInvalidInput

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:43:15
                 postfix.Add(stack.Pop());
             }
         }
-        while(stack.Count >0) {
+        while(stack.Count <0) {
             postfix.Add(stack.Pop());
         }
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.InfixToPostfixAppTests.InfixToPostfix_SimpleExpression_ConvertsCorrectly; UnitTestGeneration.Moderate.Tests.ChatGPT.Prompt1.InfixToPostfixAppTests.InfixToPostfix_ReturnsCorrectResult_WhenExpressionHasSingleOperator; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.InfixToPostfixAppTests.InfixToPostfix_SimpleExpression_ReturnsCorrectPostfix

[Timeout] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/InfixToPostfixApp.cs:46:38
         while(stack.Count >0) {
             postfix.Add(stack.Pop());
         }
-        foreach(string s in postfix) {
-            Console.Write(s+" ");
-        }
+        foreach(string s in postfix) {}
         Console.WriteLine("");
         return postfix;   
