[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:23:17
         if (CanGetFamilyLoan(ages.Item1, ages.Item2))
         {
             var monthlyPaymentSize = FindMonthlyPaymentSize(salaries.Item1, salaries.Item2);
-            if (monthlyPaymentSize > minimumPaymentSize)
+            if (monthlyPaymentSize >= minimumPaymentSize)
             {
                 return new Tuple<bool, int>(true, monthlyPaymentSize);

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/LoanApplication.cs:24:13
         {
             var monthlyPaymentSize = FindMonthlyPaymentSize(salaries.Item1, salaries.Item2);
             if (monthlyPaymentSize > minimumPaymentSize)
-            {
-                return new Tuple<bool, int>(true, monthlyPaymentSize);
-            }
+            {}
 
             return new Tuple<bool, int>(false, monthlyPaymentSize);
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.LoanApplicationTests.IsFamilyApplicableForLoad_BothAgesAboveLegalAge_PaymentSizeAboveMinimum_ReturnsTrueAndPaymentSize; UnitTestGeneration.Moderate.Tests.Gemini.Prompt2.LoanApplicationTests.IsFamilyApplicableForLoad_Eligible_ReturnsTrue; UnitTestGeneration.Moderate.Tests.Gemini.Prompt1.LoanApplicationTests.IsFamilyApplicableForLoad_EligibleFamily_SufficientPayment
