[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/PostfixEvaluation.cs:19:43
         decimal temp,topStack, retVal=0;
         var stack = new Stack<string>();
         foreach(string s in postfix) {
-            if(Decimal.TryParse(s,out _)) {
-                stack.Push(s);
-            } else if(operators.TryGetValue(s,out var op)) {
+            if(Decimal.TryParse(s,out _)) {} else if(operators.TryGetValue(s,out var op)) {
                 Decimal.TryParse(stack.Pop(), out topStack);
                 Decimal.TryParse(stack.Pop(), out temp);
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PostfixEvaluationTests.EvaluatePostfix_Addition_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PostfixEvaluationTests.EvaluatePostfix_SingleValue_ReturnsValue; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PostfixEvaluationTests.EvaluatePostfix_Division_ReturnsCorrectResult

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/PostfixEvaluation.cs:21:60
         foreach(string s in postfix) {
             if(Decimal.TryParse(s,out _)) {
                 stack.Push(s);
-            } else if(operators.TryGetValue(s,out var op)) {
-                Decimal.TryParse(stack.Pop(), out topStack);
-                Decimal.TryParse(stack.Pop(), out temp);
-                switch(s) {
-                    case "+":
-                        retVal=Decimal.Add(temp, topStack);
-                        break;
-                    case "-":
-                        retVal=Decimal.Subtract(temp, topStack);
-                        break;
-                    case "÷":
-                        retVal=Decimal.Divide(temp, topStack);
-                        break;
-                    case "×":
-                        retVal=Decimal.Multiply(temp, topStack);
-                        break;
-                    default:
-                        retVal=-987656789;
-                        break;
-                }
-                stack.Push(retVal.ToString());
-            }
+            } else if(operators.TryGetValue(s,out var op)) {}
         }
         return stack.Pop();
killedBy: UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PostfixEvaluationTests.EvaluatePostfix_Addition_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PostfixEvaluationTests.EvaluatePostfix_Division_ReturnsCorrectResult; UnitTestGeneration.Moderate.Tests.Cloude.Prompt2.PostfixEvaluationTests.EvaluatePostfix_Multiplication_ReturnsCorrectResult
