[Timeout] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:14:17
         {
             bool primeTestResult = Convert.ToBoolean(numberToCheck % potencialDivider);
 
-            if (potencialDivider <= Math.Sqrt(numberToCheck))
+            if (potencialDivider > Math.Sqrt(numberToCheck))
             {
                 if (!primeTestResult)

[NoCoverage] Block removal mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:28:21
                         return IsNumberPrime(numberToCheck, potencialDivider);
                     } 
                     else
-                    {
-                        potencialDivider += 2;
-                        return IsNumberPrime(numberToCheck, potencialDivider);
-                    }
+                    {}
                 }
             }

[Survived] Logical mutation
Code/bakis/UnitTestGeneration.Moderate.App/PrimeNumers.cs:57:26
                 {
                     primeTestResult = false;
                 }
-                else if (!IsNumberEven(numberToCheck) && IsNumberPrime(numberToCheck)) 
+                else if (!IsNumberEven(numberToCheck) || IsNumberPrime(numberToCheck)) 
                 {
                     primeTestResult = true;
