[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Moderate.App/UnitsConverter.cs:28:12
     {
             
         cmconverted = centimeters / 2.54m;
-        if(cmconverted >= onefoot)
+        if(cmconverted > onefoot)
         {
             decimal dividedbytwelve = Math.Round(cmconverted / 12, 2);
