[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:115:20
             int i = 0;
             int dstPos = 0;
             int srcPos = 0;
-            while (len > 0)
+            while (len >= 0)
             {
                 for (i = 0; i < 16; i++)

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:117:29
             int srcPos = 0;
             while (len > 0)
             {
-                for (i = 0; i < 16; i++)
+                for (i = 0; i > 16; i++)
                 {
                     x[i] = ctx[i];

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:122:29
                     x[i] = ctx[i];
                 }
                 GetRounds(x);
-                for (i = 0; i < 16; i++)
+                for (i = 0; i > 16; i++)
                 {
                     x[i] += ctx[i];

[Survived] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:123:17
                 }
                 GetRounds(x);
                 for (i = 0; i < 16; i++)
-                {
-                    x[i] += ctx[i];
-                }
+                {}
                 for (i = 0; i < 16; i++)
                 {

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:126:29
                 {
                     x[i] += ctx[i];
                 }
-                for (i = 0; i < 16; i++)
+                for (i = 0; i > 16; i++)
                 {
                     Store32(buf, i * 4, x[i]);
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.ChaChaTests.Encrypt_ShouldEncryptCorrectly

[NoCoverage] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:134:17
                 // nonce
                 ctx[12] += 1;
                 if (ctx[12] == 0)
-                {
-                    ctx[13] += 1;
-                }
+                {}
 
                 if (len < 64)

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:138:21
                     ctx[13] += 1;
                 }
 
-                if (len < 64)
+                if (len <= 64)
                 {
                     break;

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:139:17
                 }
 
                 if (len < 64)
-                {
-                    break;
-                }
+                {}
 
                 for (i = 0; i < 64; i++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.ChaChaTests.Encrypt_ShouldEncryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:143:29
                     break;
                 }
 
-                for (i = 0; i < 64; i++)
+                for (i = 0; i > 64; i++)
                 {
                     dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:156:25
             // left over bytes
             // This should never happen.  The plain text should be right padded
             // with dummy characters.  The last byte is the padding length.
-            for (i = 0; i < len; i++)
+            for (i = 0; i <= len; i++)
             {
                 dst[i + dstPos] = (byte)(src[i + srcPos] ^ buf[i]);
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.ChaChaTests.Encrypt_ShouldEncryptCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Encrypt_EncryptsAndDecryptsCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.Demo_EncryptsAndDecryptsCorrectly

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:171:13
         public void GetRounds(uint[] state)
         {
             for (var i = 0; i < 10; i++)
-            {
-                // The compiler generates better code with references.
-                Round(ref state[0], ref state[4], ref state[8], ref state[12]);
-                Round(ref state[1], ref state[5], ref state[9], ref state[13]);
-                Round(ref state[2], ref state[6], ref state[10], ref state[14]);
-                Round(ref state[3], ref state[7], ref state[11], ref state[15]);
-                Round(ref state[0], ref state[5], ref state[10], ref state[15]);
-                Round(ref state[1], ref state[6], ref state[11], ref state[12]);
-                Round(ref state[2], ref state[7], ref state[8], ref state[13]);
-                Round(ref state[3], ref state[4], ref state[9], ref state[14]);
-            }
+            {}
         }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.GetRounds_PerformsCorrectNumberOfRounds; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.ChaChaTests.GetRounds_ShouldApplyRoundsCorrectly

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:194:9
         /// <param name="c">int</param>
         /// <param name="d">int</param>
         public void Round(ref uint a, ref uint b, ref uint c, ref uint d)
-        {
-            // The compiler generates better code with references.
-            a += b;
-            d = RotateLeft(d ^ a, 16);
-            c += d;
-            b = RotateLeft(b ^ c, 12);
-            a += b;
-            d = RotateLeft(d ^ a, 8);
-            c += d;
-            b = RotateLeft(b ^ c, 7);
-        }
+        {}
 
         // Rotate value left by count bits.
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.ChaChaTests.GetRounds_PerformsCorrectNumberOfRounds; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.ChaChaTests.GetRounds_ShouldApplyRoundsCorrectly

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/ChaCha.cs:231:29
             result[14] = Load32(nonce, 0);
             result[15] = Load32(nonce, 4);
 
-            for (var i = 0; i < 8; i++)
+            for (var i = 0; i > 8; i++)
             {
                 result[i + 4] = Load32(key, i * 4);
