[Killed] Logical mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:15:17
         int min = int.MaxValue, minIndex = -1;
 
         for (int v = 0; v < vertexQuantity; v++)
-            if (sptSet[v] == false && dist[v] <= min)
+            if (sptSet[v] == false || dist[v] <= min)
             {
                 min = dist[v];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.DijkstraTests.FindMinDistance_NoUnvisitedVertices_ReturnsNegativeOne

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:41:25
         int[] dist = new int[vertexQuantity]; 
         bool[] sptSet = new bool[vertexQuantity];
 
-        for (int i = 0; i < vertexQuantity; i++)
+        for (int i = 0; i <= vertexQuantity; i++)
         {
             dist[i] = int.MaxValue;
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:42:9
         bool[] sptSet = new bool[vertexQuantity];
 
         for (int i = 0; i < vertexQuantity; i++)
-        {
-            dist[i] = int.MaxValue;
-            sptSet[i] = false;
-        }
+        {}
 
         dist[src] = 0;
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:49:37
 
         dist[src] = 0;
 
-        for (int count = 0; count < vertexQuantity - 1; count++)
+        for (int count = 0; count < vertexQuantity + 1; count++)
         {
             int u = FindMinDistance(dist, sptSet);
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.UseDijkstraAlgorithm_ShouldPrintCorrectly_WhenGivenGraphAndSourceVertex

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:71:32
 
         Console.ForegroundColor = ConsoleColor.Yellow;
         Console.WriteLine("Algorym Dijkistry został zastosowany dla następującej macierzy:");
-        if (graphHeight > 0 && graphWidth > 0)
+        if (graphHeight > 0 && graphWidth < 0)
         {
             for (int col = 0; col < graphWidth; col++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Dijkstra.cs:76:17
             for (int col = 0; col < graphWidth; col++)
             {
                 for (int row = 0; row < graphHeight; row++)
-                {
-                    Console.Write($"{graph[col, row]} ");
-                }
+                {}
                 Console.Write("\n");
             }
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.DijkstraTests.PrintGraph_ShouldPrintCorrectly_WhenGivenGraph
