[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:14:9
     public static double Dot(this double[] lhs, double[] rhs)
     {
         if (lhs.Length != rhs.Length)
-        {
-            throw new ArgumentException("Dot product arguments must have same dimension");
-        }
+        {}
 
         double result = 0;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Dot_ThrowsException_WhenArraysHaveDifferentLengths; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Dot_DifferentLengths_ThrowsArgumentException

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:50:9
     public static double[] ToRowVector(this double[,] source)
     {
         if (source.GetLength(1) != 1)
-        {
-            throw new InvalidOperationException("The column vector should have only 1 element in width.");
-        }
+        {}
 
         var rowVector = new double[source.Length];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.ToRowVector_ThrowsException_WhenColumnVectorHasMultipleColumns; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToRowVector_ColumnVectorWithMultipleColumns_ThrowsInvalidOperationException

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:56:25
 
         var rowVector = new double[source.Length];
 
-        for (var i = 0; i < rowVector.Length; i++)
+        for (var i = 0; i > rowVector.Length; i++)
         {
             rowVector[i] = source[i, 0];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.ToRowVector_CreatesCorrectRowVector; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.ToRowVector_ColumnVectorWithOneColumn_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.ToRowVector_ShouldConvertColumnVectorToRowVector_WhenGivenColumnVector

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:68:9
     public static double[,] Multiply(this double[,] source, double[,] operand)
     {
         if (source.GetLength(1) != operand.GetLength(0))
-        {
-            throw new InvalidOperationException(
-                "The width of a first operand should match the height of a second.");
-        }
+        {}
 
         var result = new double[source.GetLength(0), operand.GetLength(1)];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_ThrowsException_WhenDimensionsMismatch

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:75:25
 
         var result = new double[source.GetLength(0), operand.GetLength(1)];
 
-        for (var i = 0; i < result.GetLength(0); i++)
+        for (var i = 0; i > result.GetLength(0); i++)
         {
             for (var j = 0; j < result.GetLength(1); j++)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.EigenvalueTests.Multiply_CalculatesCorrectResult; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Multiply_CompatibleMatrices_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Multiply_ShouldMultiplyMatrices_WhenGivenTwoMatrices

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/Eigenvalue.cs:81:33
             {
                 double elementProduct = 0;
 
-                for (var k = 0; k < source.GetLength(1); k++)
+                for (var k = 0; k <= source.GetLength(1); k++)
                 {
                     elementProduct += source[i, k] * operand[k, j];
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.EigenvalueTests.Multiply_CompatibleMatrices_ReturnsCorrectResult; UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt2.EigenvalueTests.Multiply_ShouldMultiplyMatrices_WhenGivenTwoMatrices
