[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:36:30
 
             long totient = (p - 1) * (q - 1);
 
-            for (long i = 2; i < totient; i++)
+            for (long i = 2; i <= totient; i++)
             {
                 if (totient % i == 0)

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:41:35
                 if (totient % i == 0)
                     continue;
 
-                if (IsPrime(i) && i != p && i != q)
+                if (IsPrime(i) && i == p && i != q)
                 {
                     long exp = GetDecryptExp(i, totient);

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:44:25
                 if (IsPrime(i) && i != p && i != q)
                 {
                     long exp = GetDecryptExp(i, totient);
-                    if (exp > 0)
+                    if (exp >= 0)
                     {
                         list.Add(i);

[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:45:21
                 {
                     long exp = GetDecryptExp(i, totient);
                     if (exp > 0)
-                    {
-                        list.Add(i);
-                        list.Add(exp);
-                    }
+                    {}
 
                     if (list.Count > maxLength - 1)
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SimpleRSATests.GetPrimes_ValidPrimes_ReturnsCorrectPrimes

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:50:25
                         list.Add(exp);
                     }
 
-                    if (list.Count > maxLength - 1)
+                    if (list.Count < maxLength - 1)
                         break;
                 }

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:62:30
         public static long GetEncryptExp(long p, long q)
         {
             long totient = (p - 1) * (q - 1);
-            for (long i = 2; i < totient; i++)
+            for (long i = 2; i <= totient; i++)
             {
                 if (totient % i == 0)

[Timeout] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:157:20
         {
             long result = 0; 
             a = a % mod;
-            while (b > 0)
+            while (b >= 0)
             {
                 // If b is odd, add 'a' to result. 

[Timeout] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:241:20
         public static long ModularPow(long num, long exponent, long modulus)
         {
             long result = 1;
-            while (exponent > 0)
+            while (exponent >= 0)
             {
                 if ((exponent & 1) == 1)

[Timeout] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:256:20
         public static int ModularPow(int num, int exponent, int modulus)
         {
             int result = 1;
-            while (exponent > 0)
+            while (exponent >= 0)
             {
                 if ((exponent & 1) == 1)

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:356:17
         public static int[] StrToArray(string str)
         {
             int n = str.Length / 4;
-            if (str.Length % 4 > 0)
+            if (str.Length % 4 < 0)
                 ++n;
             int[] array = new int[n];

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:361:29
             int[] array = new int[n];
 
             int k = 0;
-            for (int i = 0; i < str.Length; i += 4)
+            for (int i = 0; i <= str.Length; i += 4)
             {
                 string s1 = str.Substring(i, Math.Min(4, str.Length - i));

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SimpleRSA.cs:374:29
         public static int StrToInt(string str)
         {
             int result = 0;
-            for (int i = 0; i < str.Length; i++)
+            for (int i = 0; i <= str.Length; i++)
             {
                 result = (256 * result) + str[i];
