[Killed] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:31:16
 
     public static double Range(this IEnumerable<double> source)
     {
-        return source.Max() - source.Min();
+        return source.Max() + source.Min();
     }
 
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.StatOneTests.Range_SingleElement_ReturnsZero; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Range_CalculatesCorrectly; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.StatOneTests.Range_CalculatesCorrectly

[NoCoverage] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:145:25
     public static double ChiSquared(double[] observed, double[] expected)
     {
         double result = 0;
-        for (int i = 0; i < observed.Length; i++)
+        for (int i = 0; i > observed.Length; i++)
         {
             double delta = observed[i] - expected[i];

[NoCoverage] Arithmetic mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:148:23
         for (int i = 0; i < observed.Length; i++)
         {
             double delta = observed[i] - expected[i];
-            result += (delta * delta) / expected[i];
+            result += (delta * delta) * expected[i];
         }
 

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:166:13
 
         // Save the sign of x
         int sign = 1;
-        if (x < 0)
+        if (x <= 0)
         {
             sign = -1;

[NoCoverage] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/StatOne.cs:167:9
         // Save the sign of x
         int sign = 1;
         if (x < 0)
-        {
-            sign = -1;
-        }
+        {}
 
         x = Math.Abs(x) / Math.Sqrt(2.0);
