[Killed] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:43:13
         public static bool SolveTheGrid(int[][] grid)
         {
             if (FindEmpty(grid) == null)
-            {
-                return false;
-            }
+            {}
             else
             {
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.SudokuSolverTests.SolveTheGrid_ShouldReturnFalseForUnsolvableGrid

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:49:33
             else
             {
                 int[]? arr = FindEmpty(grid);
-                for (int i = 1; i < 10; i++)
+                for (int i = 1; i > 10; i++)
                 {
                     if (IsPossible(grid, arr, i))

[Survived] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:56:25
                         grid[arr[0]][arr[1]] = i;
 
                         if (!SolveTheGrid(grid))
-                        {
-                            
-                            return true;
-                            
-                        }
+                        {}
 
                         grid[arr[0]][arr[1]] = 0;

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:75:29
         public static int[]? FindEmpty(int[][] grid)
         {
             int[] arr = [0, 0];
-            for (int i = 0; i < grid.Length; i++)
+            for (int i = 0; i <= grid.Length; i++)
             {
                 for (int j = 0; j < grid[i].Length; j++)
killedBy: UnitTestGeneration.Difficult.Tests.ChatGPT.Prompt3.SudokuSolverTests.SolveTheGrid_ShouldReturnFalseForUnsolvableGrid; UnitTestGeneration.Difficult.Tests.Gemini.Prompt1.SudokuSolverTests.FindEmpty_NoEmptyCells_ReturnsNull

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:91:29
 
         public static bool IsPossible(int[][] grid, int[]? arr, int num)
         {
-            for (int i = 0; i < 9; i++)
+            for (int i = 0; i > 9; i++)
             {
                 if (grid[arr[0]][i] == num && i != arr[1])
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SudokuSolverTests.IsPossible_InvalidNumberInColumn_ReturnsFalse; UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SudokuSolverTests.IsPossible_InvalidNumberInRow_ReturnsFalse

[Killed] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:93:21
         {
             for (int i = 0; i < 9; i++)
             {
-                if (grid[arr[0]][i] == num && i != arr[1])
+                if (grid[arr[0]][i] != num && i != arr[1])
                 {
                     return false;
killedBy: UnitTestGeneration.Difficult.Tests.Cloude.Prompt3.SudokuSolverTests.IsPossible_ValidNumber_ReturnsTrue; UnitTestGeneration.Difficult.Tests.Cloude.Prompt2.SudokuSolverTests.IsPossible_ReturnsCorrectResult

[Survived] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:94:17
             for (int i = 0; i < 9; i++)
             {
                 if (grid[arr[0]][i] == num && i != arr[1])
-                {
-                    return false;
-                }
+                {}
             }
 

[Survived] Equality mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:99:29
                 }
             }
 
-            for (int i = 0; i < 9; i++)
+            for (int i = 0; i > 9; i++)
             {
                 if (grid[i][arr[1]] == num && i != arr[0])

[Survived] Block removal mutation
Code/bakis/UnitTestGeneration.Difficult.App/SudokuSolver.cs:102:17
             for (int i = 0; i < 9; i++)
             {
                 if (grid[i][arr[1]] == num && i != arr[0])
-                {
-                    return false;
-                }
+                {}
             }
 
